{
  "author": "Alessandro Artale",
  "results": [
    {
      "title": "The Science of the Einstein Telescope",
      "abstract": "Einstein Telescope (ET) is the European project for a gravitational-wave (GW) observatory of third-generation. In this paper we present a comprehensive discussion of its science objectives, providing state-of-the-art predictions for the capabilities of ET in both geometries currently under consideration, a single-site triangular configuration or two L-shaped detectors. We discuss the impact that ET will have on domains as broad and diverse as fundamental physics, cosmology, early Universe, astrophysics of compact objects, physics of matter in extreme conditions, and dynamics of stellar collapse. We discuss how the study of extreme astrophysical events will be enhanced by multi-messenger observations. We highlight the ET synergies with ground-based and space-borne GW observatories, including multi-band investigations of the same sources, improved parameter estimation, and complementary information on astrophysical or cosmological mechanisms obtained combining observations from different frequency bands. We present advancements in waveform modeling dedicated to third-generation observatories, along with open tools developed within the ET Collaboration for assessing the scientific potentials of different detector configurations. We finally discuss the data analysis challenges posed by third-generation observatories, which will enable access to large populations of sources and provide unprecedented precision. △ Less",
      "url": "https://arxiv.org/abs/2503.12263"
    },
    {
      "title": "On Deciding the Data Complexity of Answering Linear Monadic Datalog Queries with LTL Operators(Extended Version)",
      "abstract": "Our concern is the data complexity of answering linear monadic datalog queries whose atoms in the rule bodies can be prefixed by operators of linear temporal logic LTL. We first observe that, for data complexity, answering any connected query with operators $\\bigcirc/\\bigcirc^-$ (at the next/previous moment) is either in AC0, or in $ACC0\\!\\setminus\\!AC0$, or $NC^1$-complete, or LogSpace-hard and in NLogSpace. Then we show that the problem of deciding LogSpace-hardness of answering such queries is PSpace-complete, while checking membership in the classes AC0 and ACC0 as well as $NC^1$-completeness can be done in ExpSpace. Finally, we prove that membership in AC0 or in ACC0, $NC^1$-completeness, and LogSpace-hardness are undecidable for queries with operators $\\Diamond_f/\\Diamond_p$ (sometime in the future/past) provided that $NC^1 \\ne NLogSpace$, and $LogSpace \\ne NLogSpace$. △ Less",
      "url": "https://arxiv.org/abs/2501.13762"
    },
    {
      "title": "Non-Rigid Designators in Modal and Temporal Free Description Logics (Extended Version)",
      "abstract": "Definite descriptions, such as 'the General Chair of KR 2024', are a semantically transparent device for object identification in knowledge representation. In first-order modal logic, definite descriptions have been widely investigated for their non-rigidity, which allows them to designate different objects (or none at all) at different states. We propose expressive modal description logics with non-rigid definite descriptions and names, and investigate decidability and complexity of the satisfaction problem. We first systematically link satisfiability for the one-variable fragment of first-order modal logic with counting to our modal description logics. Then, we prove a promising NEXPTIME-completeness result for concept satisfiability for the fundamental epistemic multi-agent logic $\\mathbf{S5}^{n}$ and its neighbours, and show that some expressive logics that are undecidable with constant domain become decidable (but Ackermann-hard) with expanding domains. Finally, we conduct a fine-grained analysis of decidability of temporal logics. △ Less",
      "url": "https://arxiv.org/abs/2405.07656"
    },
    {
      "title": "Non-Rigid Designators in Epistemic and Temporal Free Description Logics (Extended Version)",
      "abstract": "Definite descriptions, such as 'the smallest planet in the Solar System', have been recently recognised as semantically transparent devices for object identification in knowledge representation formalisms. Along with individual names, they have been introduced also in the context of description logic languages, enriching the expressivity of standard nominal constructors. Moreover, in the first-order modal logic literature, definite descriptions have been widely investigated for their non-rigid behaviour, which allows them to denote different objects at different states. In this direction, we introduce epistemic and temporal extensions of standard description logics, with nominals and the universal role, additionally equipped with definite descriptions constructors. Regarding names and descriptions, in these languages we allow for: possible lack of denotation, ensured by partial models, coming from free logic semantics as a generalisation of the classical ones; and non-rigid designation features, obtained by assigning to terms distinct values across states, as opposed to the standard rigidity condition on individual expressions. In the absence of the rigid designator assumption, we show that the satisfiability problem for epistemic free description logics is NExpTime-complete, while satisfiability for temporal free description logics over linear time structures is undecidable. △ Less",
      "url": "https://arxiv.org/abs/2308.08640"
    },
    {
      "title": "Complexity of Safety and coSafety Fragments of Linear Temporal Logic",
      "abstract": "Linear Temporal Logic (LTL) is the de-facto standard temporal logic for system specification, whose foundational properties have been studied for over five decades. Safety and cosafety properties define notable fragments of LTL, where a prefix of a trace suffices to establish whether a formula is true or not over that trace. In this paper, we study the complexity of the problems of satisfiability, validity, and realizability over infinite and finite traces for the safety and cosafety fragments of LTL. As for satisfiability and validity over infinite traces, we prove that the majority of the fragments have the same complexity as full LTL, that is, they are PSPACE-complete. The picture is radically different for realizability: we find fragments with the same expressive power whose complexity varies from 2EXPTIME-complete (as full LTL) to EXPTIME-complete. Notably, for all cosafety fragments, the complexity of the three problems does not change passing from infinite to finite traces, while for all safety fragments the complexity of satisfiability (resp., realizability) over finite traces drops to NP-complete (resp., $Π^P_2$-complete). △ Less",
      "url": "https://arxiv.org/abs/2211.14913"
    },
    {
      "title": "First-order Temporal Logic on Finite Traces: Semantic Properties, Decidable Fragments, and Applications",
      "abstract": "Formalisms based on temporal logics interpreted over finite strict linear orders, known in the literature as finite traces, have been used for temporal specification in automated planning, process modelling, (runtime) verification and synthesis of programs, as well as in knowledge representation and reasoning. In this paper, we focus on first-order temporal logic on finite traces. We first investigate preservation of equivalences and satisfiability of formulas between finite and infinite traces, by providing a set of semantic and syntactic conditions to guarantee when the distinction between reasoning in the two cases can be blurred. Moreover, we show that the satisfiability problem on finite traces for several decidable fragments of first-order temporal logic is ExpSpace-complete, as in the infinite trace case, while it decreases to NExpTime when finite traces bounded in the number of instants are considered. This leads also to new complexity results for temporal description logics over finite traces. Finally, we investigate applications to planning and verification, in particular by establishing connections with the notions of insensitivity to infiniteness and safety from the literature. △ Less",
      "url": "https://arxiv.org/abs/2202.00610"
    },
    {
      "title": "First-Order Rewritability and Complexity of Two-Dimensional Temporal Ontology-Mediated Queries",
      "abstract": "Aiming at ontology-based data access to temporal data, we design two-dimensional temporal ontology and query languages by combining logics from the (extended) DL-Lite family with linear temporal logic LTL over discrete time (Z,<). Our main concern is first-order rewritability of ontology-mediated queries (OMQs) that consist of a 2D ontology and a positive temporal instance query. Our target languages for FO-rewritings are two-sorted FO(<) - first-order logic with sorts for time instants ordered by the built-in precedence relation < and for the domain of individuals - its extension FOE with the standard congruence predicates t \\equiv 0 mod n, for any fixed n > 1, and FO(RPR) that admits relational primitive recursion. In terms of circuit complexity, FOE- and FO(RPR)-rewritability guarantee answering OMQs in uniform AC0 and NC1, respectively. We proceed in three steps. First, we define a hierarchy of 2D DL-Lite/LTL ontology languages and investigate the FO-rewritability of OMQs with atomic queries by constructing projections onto 1D LTL OMQs and employing recent results on the FO-rewritability of propositional LTL OMQs. As the projections involve deciding consistency of ontologies and data, we also consider the consistency problem for our languages. While the undecidability of consistency for 2D ontology languages with expressive Boolean role inclusions might be expected, we also show that, rather surprisingly, the restriction to Krom and Horn role inclusions leads to decidability (and ExpSpace-completeness), even if one admits full Booleans on concepts. As a final step, we lift some of the rewritability results for atomic OMQs to OMQs with expressive positive temporal instance queries. The lifting results are based on an in-depth study of the canonical models and only concern Horn ontologies. △ Less",
      "url": "https://arxiv.org/abs/2111.06806"
    },
    {
      "title": "On Free Description Logics with Definite Descriptions",
      "abstract": "Definite descriptions are phrases of the form 'the $x$ such that $\\varphi$', used to refer to single entities in a context. They are often more meaningful to users than individual names alone, in particular when modelling or querying data over ontologies. We investigate free description logics with both individual names and definite descriptions as terms of the language, while also accounting for their possible lack of denotation. We focus on the extensions of $\\mathcal{ALC}$ and, respectively, $\\mathcal{EL}$ with nominals, the universal role, and definite descriptions. We show that standard reasoning in these extensions is not harder than in the original languages, and we characterise the expressive power of concepts relative to first-order formulas using a suitable notion of bisimulation. Moreover, we lay the foundations for automated support for definite descriptions generation by studying the complexity of deciding the existence of definite descriptions for an individual under an ontology. Finally, we provide a polynomial-time reduction of reasoning in other free description logic languages based on dual-domain semantics to the case of partial interpretations. △ Less",
      "url": "https://arxiv.org/abs/2106.15513"
    },
    {
      "title": "Hierarchical generative models for star clusters from hydro-dynamical simulations",
      "abstract": "Star formation in molecular clouds is clumpy, hierarchically subclustered. Fractal structure also emerges in hydro-dynamical simulations of star-forming clouds. Simulating the formation of realistic star clusters with hydro-dynamical simulations is a computational challenge, considering that only the statistically averaged results of large batches of simulations are reliable, due to the chaotic nature of the gravitational N-body problem. While large sets of initial conditions for N-body runs can be produced by hydro-dynamical simulations of star formation, this is prohibitively expensive in terms of computational time. Here we address this issue by introducing a new technique for generating many sets of new initial conditions from a given set of star masses, positions and velocities from a hydro-dynamical simulation. We use hierarchical clustering in phase space to learn a tree representation of the spatial and kinematic relations between stars. This constitutes the basis for the random generation of new sets of stars which share the same clustering structure of the original ones but have individually different masses, positions, and velocities. We apply this method to the output of a number of hydro-dynamical star-formation simulations, comparing the generated initial conditions to the original ones through a series of quantitative tests, including comparing mass and velocity distributions and fractal dimension. Finally, we evolve both the original and the generated star clusters using a direct N-body code, obtaining a qualitatively similar evolution. △ Less",
      "url": "https://arxiv.org/abs/2106.00684"
    },
    {
      "title": "Hierarchical black hole mergers in young, globular and nuclear star clusters: the effect of metallicity, spin and cluster properties",
      "abstract": "We explore hierarchical black hole (BH) mergers in nuclear star clusters (NSCs), globular clusters (GCs) and young star clusters (YSCs), accounting for both original and dynamically assembled binary BHs (BBHs). We find that the median mass of both first- and nth-generation dynamical mergers is larger in GCs and YSCs with respect to NSCs, because the lighter BHs are ejected by supernova kicks from the lower-mass clusters. Also, first- and nth-generation BH masses are strongly affected by the metallicity of the progenitor stars: the median mass of the primary BH of a nth-generation merger is $\\sim{}24-38$ M$_\\odot$ ($\\sim{}9-15$ M$_\\odot$) in metal-poor (metal-rich) NSCs. The maximum BH mass mainly depends on the escape velocity: BHs with mass up to several thousand M$_\\odot$ form in NSCs, while YSCs and GCs host BHs with mass up to several hundred M$_\\odot$. Furthermore, we calculate the fraction of mergers with at least one component in the pair-instability mass gap ($f_{\\rm PI}$) and in the intermediate-mass BH regime ($f_{\\rm IMBH}$). In the fiducial model for dynamical BBHs with metallicity $Z=0.002$, we find $f_{\\rm PI}\\approx{}0.05$, $0.02$ and $0.007$ ($f_{\\rm IMBH}\\approx{}0.01$, $0.002$ and $0.001$) in NSCs, GCs and YSCs, respectively. Both $f_{\\rm PI}$ and $f_{\\rm IMBH}$ drop by at least one order of magnitude at solar metallicity. Finally, we investigate the formation of GW190521 by assuming that it is either a nearly equal-mass BBH or an intermediate-mass ratio inspiral. △ Less",
      "url": "https://arxiv.org/abs/2103.05016"
    },
    {
      "title": "Automated Reasoning in Temporal DL-Lite",
      "abstract": "This paper investigates the feasibility of automated reasoning over temporal DL-Lite (TDL-Lite) knowledge bases (KBs). We test the usage of off-the-shelf LTL reasoners to check satisfiability of TDL-Lite KBs. In particular, we test the robustness and the scalability of reasoners when dealing with TDL-Lite TBoxes paired with a temporal ABox. We conduct various experiments to analyse the performance of different reasoners by randomly generating TDL-Lite KBs and then measuring the running time and the size of the translations. Furthermore, in an effort to make the usage of TDL-Lite KBs a reality, we present a fully fledged tool with a graphical interface to design them. Our interface is based on conceptual modelling principles and it is integrated with our translation tool and a temporal reasoner. △ Less",
      "url": "https://arxiv.org/abs/2008.07463"
    },
    {
      "title": "Mass and rate of hierarchical black hole mergers in young, globular and nuclear star clusters",
      "abstract": "Hierarchical mergers are one of the distinctive signatures of binary black hole (BBH) formation through dynamical evolution. Here, we present a fast semi-analytic approach to simulate hierarchical mergers in nuclear star clusters (NSCs), globular clusters (GCs) and young star clusters (YSCs). Hierarchical mergers are more common in NSCs than they are in both GCs and YSCs, because of the different escape velocity. The mass distribution of hierarchical BBHs strongly depends on the properties of first-generation BBHs, such as their progenitor's metallicity. In our fiducial model, we form black holes (BHs) with masses up to $\\sim{}10^3$ M$_\\odot$ in NSCs and up to $\\sim{}10^2$ M$_\\odot$ in both GCs and YSCs. When escape velocities in excess of 100 km~s$^{-1}$ are considered, BHs with mass $>10^3$ M$_\\odot$ are allowed to form in NSCs. Hierarchical mergers lead to the formation of BHs in the pair instability mass gap and intermediate-mass BHs, but only in metal-poor environments. The local BBH merger rate in our models ranges from $\\sim{}10$ to $\\sim{} 60$ Gpc$^{-3}$ yr$^{-1}$; hierarchical BBHs in NSCs account for $\\sim{}10^{-2}- 0.2$ Gpc$^{-3}$ yr$^{-1}$, with a strong upper limit of $\\sim{}10$ Gpc$^{-3}$ yr$^{-1}$. When comparing our models with the second gravitational-wave transient catalog, we find that multiple formation channels are favored to reproduce the observed BBH population. △ Less",
      "url": "https://arxiv.org/abs/2007.15022"
    },
    {
      "title": "Living Without Beth and Craig: Definitions and Interpolants in Description and Modal Logics with Nominals and Role Inclusions",
      "abstract": "The Craig interpolation property (CIP) states that an interpolant for an implication exists iff it is valid. The projective Beth definability property (PBDP) states that an explicit definition exists iff a formula stating implicit definability is valid. Thus, the CIP and PBDP reduce potentially hard existence problems to entailment in the underlying logic. Description (and modal) logics with nominals and/or role inclusions do not enjoy the CIP nor the PBDP, but interpolants and explicit definitions have many applications, in particular in concept learning, ontology engineering, and ontology-based data management. In this article we show that, even without Beth and Craig, the existence of interpolants and explicit definitions is decidable in description logics with nominals and/or role inclusions such as ALCO, ALCH and ALCHOI and corresponding hybrid modal logics. However, living without Beth and Craig makes this problem harder than entailment: the existence problems become 2ExpTime-complete in the presence of an ontology or the universal modality, and coNExpTime-complete otherwise. We also analyze explicit definition existence if all symbols (except the one that is defined) are admitted in the definition. In this case the complexity depends on whether one considers individual or concept names. Finally, we consider the problem of computing interpolants and explicit definitions if they exist and turn the complexity upper bound proof into an algorithm computing them, at least for description logics with role inclusions. △ Less",
      "url": "https://arxiv.org/abs/2007.02736"
    },
    {
      "title": "The cosmic merger rate density evolution of compact binaries formed in young star clusters and in isolated binaries",
      "abstract": "Next generation ground-based gravitational-wave detectors will observe binary black hole (BBH) mergers up to redshift $z\\gtrsim{}10$, probing the evolution of compact binary (CB) mergers across cosmic time. Here, we present a new data-driven model to estimate the cosmic merger rate density (MRD) evolution of CBs, by coupling catalogs of CB mergers with observational constraints on the cosmic star formation rate density and on the metallicity evolution of the Universe. We adopt catalogs of CB mergers derived from recent $N-$body and population-synthesis simulations, to describe the MRD of CBs formed in young star clusters (hereafter, dynamical CBs) and in the field (hereafter, isolated CBs). The local MRD of dynamical BBHs is $\\mathcal{R}_{\\rm BBH}=64^{+34}_{-20}$ Gpc$^{-3}$ yr$^{-1}$, consistent with the 90% credible interval from the first and second observing run (O1 and O2) of the LIGO-Virgo collaboration, and with the local MRD of isolated BBHs ($\\mathcal{R}_{\\rm BBH}=50^{+71}_{-37}$ Gpc$^{-3}$ yr$^{-1}$). The local MRD of dynamical and isolated black hole - neutron star binaries is $\\mathcal{R}_{\\rm BHNS}=41^{+33}_{-23}$ and $49^{+48}_{-34}$~Gpc$^{-3}$ yr$^{-1}$, respectively. Both values are consistent with the upper limit inferred from O1 and O2. Finally, the local MRD of dynamical binary neutron stars (BNSs, $\\mathcal{R}_{\\rm BNS}=151^{+59}_{-38}$ Gpc$^{-3}$ yr$^{-1}$) is a factor of two lower than the local MRD of isolated BNSs ($\\mathcal{R}_{\\rm BNS}=283^{+97}_{-75}$ Gpc$^{-3}$ yr$^{-1}$). The MRD for all CB classes grows with redshift, reaching its maximum at $z \\in [1.5,2.5]$, and then decreases. This trend springs from the interplay between cosmic star formation rate, metallicity evolution and delay time of binary compact objects. △ Less",
      "url": "https://arxiv.org/abs/2004.09533"
    },
    {
      "title": "First-Order Rewritability of Ontology-Mediated Queries in Linear Temporal Logic",
      "abstract": "We investigate ontology-based data access to temporal data. We consider temporal ontologies given in linear temporal logic LTL interpreted over discrete time (Z,<). Queries are given in LTL or MFO(<), monadic first-order logic with a built-in linear order. Our concern is first-order rewritability of ontology-mediated queries (OMQs) consisting of a temporal ontology and a query. By taking account of the temporal operators used in the ontology and distinguishing between ontologies given in full LTL and its core, Krom and Horn fragments, we identify a hierarchy of OMQs with atomic queries by proving rewritability into either FO(<), first-order logic with the built-in linear order, or FO(<,E), which extends FO(<) with the standard arithmetic predicates saying that \"x is equivalent to 0 modulo n\", for any fixed n > 1, or FO(RPR), which extends FO(<) with relational primitive recursion. In terms of circuit complexity, FO(<,E)- and FO(RPR)-rewritability guarantee OMQ answering in uniform AC0 and, respectively, NC1. We obtain similar hierarchies for more expressive types of queries: positive LTL-formulas, monotone MFO(<)- and arbitrary MFO(<)-formulas. Our results are directly applicable if the temporal data to be accessed is one-dimensional; moreover, they lay foundations for investigating ontology-based access using combinations of temporal and description logics over two-dimensional temporal data. △ Less",
      "url": "https://arxiv.org/abs/2004.07221"
    },
    {
      "title": "Host galaxies of merging compact objects: mass, star formation rate, metallicity and colours",
      "abstract": "Characterizing the properties of the host galaxies of merging compact objects provides essential clues to interpret current and future gravitational-wave detections. Here, we investigate the stellar mass, star formation rate (SFR), metallicity and colours of the host galaxies of merging compact objects in the local Universe, by combining the results of MOBSE population-synthesis models together with galaxy catalogs from the EAGLE simulation. We predict that the stellar mass of the host galaxy is an excellent tracer of the merger rate per galaxy ${\\rm n}_{\\rm GW}$ of double neutron stars (DNSs), double black holes (DBHs) and black hole-neutron star binaries (BHNSs). We find a significant correlation also between ${\\rm n}_{\\rm GW}$ and SFR. As a consequence, ${\\rm n}_{\\rm GW}$ correlates also with the $r-$band luminosity and with the $g-r$ colour of the host galaxies. Interestingly, $\\gtrsim{}60$ %, $\\gtrsim{}64$ % and $\\gtrsim{}73$ % of all the DNSs, BHNSs and DBHs merging in the local Universe lie in early-type galaxies, such as NGC 4993. We predict a local DNS merger rate density of $\\sim{}238~{\\rm Gpc}^{-3}~{\\rm yr}~^{-1}$ and a DNS merger rate $\\sim{}16-121$ Myr$^{-1}$ for Milky Way-like galaxies. Thus, our results are consistent with both the DNS merger rate inferred from GW170817 and the one inferred from Galactic DNSs. △ Less",
      "url": "https://arxiv.org/abs/1903.00083"
    },
    {
      "title": "A Decidable Very Expressive Description Logic for Databases (Extended Version)",
      "abstract": "We introduce $\\mathcal{DLR}^+$, an extension of the n-ary propositionally closed description logic $\\mathcal{DLR}$ to deal with attribute-labelled tuples (generalising the positional notation), projections of relations, and global and local objectification of relations, able to express inclusion, functional, key, and external uniqueness dependencies. The logic is equipped with both TBox and ABox axioms. We show how a simple syntactic restriction on the appearance of projections sharing common attributes in a $\\mathcal{DLR}^+$ knowledge base makes reasoning in the language decidable with the same computational complexity as $\\mathcal{DLR}$. The obtained $\\mathcal{DLR}^\\pm$ n-ary description logic is able to encode more thoroughly conceptual data models such as EER, UML, and ORM. △ Less",
      "url": "https://arxiv.org/abs/1707.08468"
    },
    {
      "title": "Extending DLR with Labelled Tuples, Projections, Functional Dependencies and Objectification (full version)",
      "abstract": "We introduce an extension of the n-ary description logic DLR to deal with attribute-labelled tuples (generalising the positional notation), with arbitrary projections of relations (inclusion dependencies), generic functional dependencies and with global and local objectification (reifying relations or their projections). We show how a simple syntactic condition on the appearance of projections and functional dependencies in a knowledge base makes the language decidable without increasing the computational complexity of the basic DLR language. △ Less",
      "url": "https://arxiv.org/abs/1604.00799"
    },
    {
      "title": "The DL-Lite Family and Relations",
      "abstract": "The recently introduced series of description logics under the common moniker DL-Lite has attracted attention of the description logic and semantic web communities due to the low computational complexity of inference, on the one hand, and the ability to represent conceptual modeling formalisms, on the other. The main aim of this article is to carry out a thorough and systematic investigation of inference in extensions of the original DL-Lite logics along five axes: by (i) adding the Boolean connectives and (ii) number restrictions to concept constructs, (iii) allowing role hierarchies, (iv) allowing role disjointness, symmetry, asymmetry, reflexivity, irreflexivity and transitivity constraints, and (v) adopting or dropping the unique same assumption. We analyze the combined complexity of satisfiability for the resulting logics, as well as the data complexity of instance checking and answering positive existential queries. Our approach is based on embedding DL-Lite logics in suitable fragments of the one-variable first-order logic, which provides useful insights into their properties and, in particular, computational behavior. △ Less",
      "url": "https://arxiv.org/abs/1401.3487"
    },
    {
      "title": "The Complexity of Clausal Fragments of LTL",
      "abstract": "We introduce and investigate a number of fragments of propo- sitional temporal logic LTL over the flow of time (Z, <). The fragments are defined in terms of the available temporal operators and the structure of the clausal normal form of the temporal formulas. We determine the computational complexity of the satisfiability problem for each of the fragments, which ranges from NLogSpace to PTime, NP and PSpace. △ Less",
      "url": "https://arxiv.org/abs/1306.5088"
    },
    {
      "title": "Temporal Description Logic for Ontology-Based Data Access (Extended Version)",
      "abstract": "Our aim is to investigate ontology-based data access over temporal data with validity time and ontologies capable of temporal conceptual modelling. To this end, we design a temporal description logic, TQL, that extends the standard ontology language OWL 2 QL, provides basic means for temporal conceptual modelling and ensures first-order rewritability of conjunctive queries for suitably defined data instances with validity time. △ Less",
      "url": "https://arxiv.org/abs/1304.5185"
    },
    {
      "title": "A Cookbook for Temporal Conceptual Data Modelling with Description Logics",
      "abstract": "We design temporal description logics suitable for reasoning about temporal conceptual data models and investigate their computational complexity. Our formalisms are based on DL-Lite logics with three types of concept inclusions (ranging from atomic concept inclusions and disjointness to the full Booleans), as well as cardinality constraints and role inclusions. In the temporal dimension, they capture future and past temporal operators on concepts, flexible and rigid roles, the operators `always' and `some time' on roles, data assertions for particular moments of time and global concept inclusions. The logics are interpreted over the Cartesian products of object domains and the flow of time (Z,<), satisfying the constant domain assumption. We prove that the most expressive of our temporal description logics (which can capture lifespan cardinalities and either qualitative or quantitative evolution constraints) turn out to be undecidable. However, by omitting some of the temporal operators on concepts/roles or by restricting the form of concept inclusions we obtain logics whose complexity ranges between PSpace and NLogSpace. These positive results were obtained by reduction to various clausal fragments of propositional temporal logic, which opens a way to employ propositional or first-order temporal provers for reasoning about temporal data models. △ Less",
      "url": "https://arxiv.org/abs/1209.5571"
    },
    {
      "title": "A Temporal Description Logic for Reasoning about Actions and Plans",
      "abstract": "A class of interval-based temporal languages for uniformly representing and reasoning about actions and plans is presented. Actions are represented by describing what is true while the action itself is occurring, and plans are constructed by temporally relating actions and world states. The temporal languages are members of the family of Description Logics, which are characterized by high expressivity combined with good computational properties. The subsumption problem for a class of temporal Description Logics is investigated and sound and complete decision procedures are given. The basic language TL-F is considered first: it is the composition of a temporal logic TL -- able to express interval temporal networks -- together with the non-temporal logic F -- a Feature Description Logic. It is proven that subsumption in this language is an NP-complete problem. Then it is shown how to reason with the more expressive languages TLU-FU and TL-ALCF. The former adds disjunction both at the temporal and non-temporal sides of the language, the latter extends the non-temporal side with set-valued features (i.e., roles) and a propositionally complete language. △ Less",
      "url": "https://arxiv.org/abs/1105.5446"
    }
  ]
}