{
  "author": "Chu-Min Li",
  "results": [
    {
      "title": "ILP Techniques for Enhancing Branch and Bound MaxSAT Solvers",
      "abstract": "This paper investigates the impact of ILP techniques on BnB MaxSAT solvers, particularly ILP preprocessing techniques and various portfolio strategies. Experimental results demonstrate that ILP techniques enable WMaxCDCL-OpenWbo1200 and MaxCDCL-OpenWbo300, the best two solvers in the unweighted track of the MaxSAT evaluation 2024, to solve 27 and 30 additional instances, respectively. Furthermore, although state-of-the-art MaxSAT solvers heavily rely on an ILP solver in their portfolios, our proposed approach uses ILP preprocessing techniques to reduce this dependency. Allocating only a short runtime to the ILP solver within a portfolio that includes (W)MaxCDCL, as proposed in our approach, is sufficient to achieve strong results. △ Less",
      "url": "https://arxiv.org/abs/2506.06216"
    },
    {
      "title": "An Efficient Evolutionary Algorithm for Diversified Top-k (Weight) Clique Search Problems",
      "abstract": "In many real-world problems and applications, finding only a single element, even though the best, among all possible candidates, cannot fully meet the requirements. We may wish to have a collection where each individual is not only outstanding but also distinctive. Diversified Top-k (DTk) problems are a kind of combinatorial optimization problem for finding such a promising collection of multiple sub-structures, such as subgraphs like cliques and social communities. In this paper, we address two representative and practical DTk problems, DTk Clique search (DTkC) and DTk Weight Clique search (DTkWC), and propose an efficient algorithm called Diversified Top-k Evolutionary AlgorithM (DiverTEAM) for these two problems. DiverTEAM consists of a local search algorithm, which focuses on generating high-quality and diverse individuals and sub-structures, and a genetic algorithm that makes individuals work as a team and converge to (near-)optima efficiently. Extensive experiments show that DiverTEAM exhibits an excellent and robust performance across various benchmarks of DTkC and DTkWC. △ Less",
      "url": "https://arxiv.org/abs/2404.09997"
    },
    {
      "title": "Rethinking the Soft Conflict Pseudo Boolean Constraint on MaxSAT Local Search Solvers",
      "abstract": "MaxSAT is an optimization version of the famous NP-complete Satisfiability problem (SAT). Algorithms for MaxSAT mainly include complete solvers and local search incomplete solvers. In many complete solvers, once a better solution is found, a Soft conflict Pseudo Boolean (SPB) constraint will be generated to enforce the algorithm to find better solutions. In many local search algorithms, clause weighting is a key technique for effectively guiding the search directions. In this paper, we propose to transfer the SPB constraint into the clause weighting system of the local search method, leading the algorithm to better solutions. We further propose an adaptive clause weighting strategy that breaks the tradition of using constant values to adjust clause weights. Based on the above methods, we propose a new local search algorithm called SPB-MaxSAT that provides new perspectives for clause weighting on MaxSAT local search solvers. Extensive experiments demonstrate the excellent performance of the proposed methods. △ Less",
      "url": "https://arxiv.org/abs/2401.10589"
    },
    {
      "title": "An Efficient Solution Space Exploring and Descent Method for Packing Equal Spheres in a Sphere",
      "abstract": "The problem of packing equal spheres in a spherical container is a classic global optimization problem, which has attracted enormous studies in academia and found various applications in industry. This problem is computationally challenging, and many efforts focus on small-scale instances with the number of spherical items less than 200 in the literature. In this work, we propose an efficient local search heuristic algorithm named solution space exploring and descent for solving this problem, which can quantify the solution's quality to determine the number of exploring actions and quickly discover a high-quality solution. Besides, we propose an adaptive neighbor object maintenance method to speed up the convergence of the continuous optimization process and reduce the time consumption. Computational experiments on a large number of benchmark instances with $5 \\leq n \\leq 400$ spherical items show that our algorithm significantly outperforms the state-of-the-art algorithm. In particular, it improves the 274 best-known results and matches the 84 best-known results out of the 396 well-known benchmark instances. △ Less",
      "url": "https://arxiv.org/abs/2305.10023"
    },
    {
      "title": "Geometric Batch Optimization for the Packing Equal Circles in a Circle Problem on Large Scale",
      "abstract": "The problem of packing equal circles in a circle is a classic and famous packing problem, which is well-studied in academia and has a variety of applications in industry. This problem is computationally challenging, and researchers mainly focus on small-scale instances with the number of circular items n less than 320 in the literature. In this work, we aim to solve this problem on large scale. Specifically, we propose a novel geometric batch optimization method that not only can significantly speed up the convergence process of continuous optimization but also reduce the memory requirement during the program's runtime. Then we propose a heuristic search method, called solution-space exploring and descent, that can discover a feasible solution efficiently on large scale. Besides, we propose an adaptive neighbor object maintenance method to maintain the neighbor structure applied in the continuous optimization process. In this way, we can find high-quality solutions on large scale instances within reasonable computational times. Extensive experiments on the benchmark instances sampled from n = 300 to 1,000 show that our proposed algorithm outperforms the state-of-the-art algorithms and performs excellently on large scale instances. In particular, our algorithm found 10 improved solutions out of the 21 well-studied moderate scale instances and 95 improved solutions out of the 101 sampled large scale instances. Furthermore, our geometric batch optimization, heuristic search, and adaptive maintenance methods are general and can be adapted to other packing and continuous optimization problems. △ Less",
      "url": "https://arxiv.org/abs/2303.02650"
    },
    {
      "title": "Incorporating Multi-armed Bandit with Local Search for MaxSAT",
      "abstract": "Partial MaxSAT (PMS) and Weighted PMS (WPMS) are two practical generalizations of the MaxSAT problem. In this paper, we propose a local search algorithm for these problems, called BandHS, which applies two multi-armed bandits to guide the search directions when escaping local optima. One bandit is combined with all the soft clauses to help the algorithm select to satisfy appropriate soft clauses, and the other bandit with all the literals in hard clauses to help the algorithm select appropriate literals to satisfy the hard clauses. These two bandits can improve the algorithm's search ability in both feasible and infeasible solution spaces. We further propose an initialization method for (W)PMS that prioritizes both unit and binary clauses when producing the initial solutions. Extensive experiments demonstrate the excellent performance and generalization capability of our proposed methods, that greatly boost the state-of-the-art local search algorithm, SATLike3.0, and the state-of-the-art SAT-based incomplete solver, NuWLS-c. △ Less",
      "url": "https://arxiv.org/abs/2211.16011"
    },
    {
      "title": "Hybrid Learning with New Value Function for the Maximum Common Subgraph Problem",
      "abstract": "Maximum Common induced Subgraph (MCS) is an important NP-hard problem with wide real-world applications. Branch-and-Bound (BnB) is the basis of a class of efficient algorithms for MCS, consisting in successively selecting vertices to match and pruning when it is discovered that a solution better than the best solution found so far does not exist. The method of selecting the vertices to match is essential for the performance of BnB. In this paper, we propose a new value function and a hybrid selection strategy used in reinforcement learning to define a new vertex selection method, and propose a new BnB algorithm, called McSplitDAL, for MCS. Extensive experiments show that McSplitDAL significantly improves the current best BnB algorithms, McSplit+LL and McSplit+RL. An empirical analysis is also performed to illustrate why the new value function and the hybrid selection strategy are effective. △ Less",
      "url": "https://arxiv.org/abs/2208.08620"
    },
    {
      "title": "Reinforced Lin-Kernighan-Helsgaun Algorithms for the Traveling Salesman Problems",
      "abstract": "TSP is a classical NP-hard combinatorial optimization problem with many practical variants. LKH is one of the state-of-the-art local search algorithms for the TSP. LKH-3 is a powerful extension of LKH that can solve many TSP variants. Both LKH and LKH-3 associate a candidate set to each city to improve the efficiency, and have two different methods, $α$-measure and POPMUSIC, to decide the candidate sets. In this work, we first propose a Variable Strategy Reinforced LKH (VSR-LKH) algorithm, which incorporates three reinforcement learning methods (Q-learning, Sarsa, Monte Carlo) with LKH, for the TSP. We further propose a new algorithm called VSR-LKH-3 that combines the variable strategy reinforcement learning method with LKH-3 for typical TSP variants, including the TSP with time windows (TSPTW) and Colored TSP (CTSP). The proposed algorithms replace the inflexible traversal operations in LKH and LKH-3 and let the algorithms learn to make a choice at each search step by reinforcement learning. Both LKH and LKH-3, with either $α$-measure or POPMUSIC, can be significantly improved by our methods. Extensive experiments on 236 widely-used TSP benchmarks with up to 85,900 cities demonstrate the excellent performance of VSR-LKH. VSR-LKH-3 also significantly outperforms the state-of-the-art heuristics for TSPTW and CTSP. △ Less",
      "url": "https://arxiv.org/abs/2207.03876"
    },
    {
      "title": "A Strengthened Branch and Bound Algorithm for the Maximum Common (Connected) Subgraph Problem",
      "abstract": "We propose a new and strengthened Branch-and-Bound (BnB) algorithm for the maximum common (connected) induced subgraph problem based on two new operators, Long-Short Memory (LSM) and Leaf vertex Union Match (LUM). Given two graphs for which we search for the maximum common (connected) induced subgraph, the first operator of LSM maintains a score for the branching node using the short-term reward of each vertex of the first graph and the long-term reward of each vertex pair of the two graphs. In this way, the BnB process learns to reduce the search tree size significantly and improve the algorithm performance. The second operator of LUM further improves the performance by simultaneously matching the leaf vertices connected to the current matched vertices, and allows the algorithm to match multiple vertex pairs without affecting the solution optimality. We incorporate the two operators into the state-of-the-art BnB algorithm McSplit, and denote the resulting algorithm as McSplit+LL. Experiments show that McSplit+LL outperforms McSplit+RL, a more recent variant of McSplit using reinforcement learning that is superior than McSplit. △ Less",
      "url": "https://arxiv.org/abs/2201.06252"
    },
    {
      "title": "BandMaxSAT: A Local Search MaxSAT Solver with Multi-armed Bandit",
      "abstract": "We address Partial MaxSAT (PMS) and Weighted PMS (WPMS), two practical generalizations of the MaxSAT problem, and propose a local search algorithm for these problems, called BandMaxSAT, that applies a multi-armed bandit model to guide the search direction. The bandit in our method is associated with all the soft clauses in the input (W)PMS instance. Each arm corresponds to a soft clause. The bandit model can help BandMaxSAT to select a good direction to escape from local optima by selecting a soft clause to be satisfied in the current step, that is, selecting an arm to be pulled. We further propose an initialization method for (W)PMS that prioritizes both unit and binary clauses when producing the initial solutions. Extensive experiments demonstrate that BandMaxSAT significantly outperforms the state-of-the-art (W)PMS local search algorithm SATLike3.0. Specifically, the number of instances in which BandMaxSAT obtains better results is about twice that obtained by SATLike3.0. Moreover, we combine BandMaxSAT with the complete solver TT-Open-WBO-Inc. The resulting solver BandMaxSAT-c also outperforms some of the best state-of-the-art complete (W)PMS solvers, including SATLike-c, Loandra and TT-Open-WBO-Inc. △ Less",
      "url": "https://arxiv.org/abs/2201.05544"
    },
    {
      "title": "Branching Strategy Selection Approach Based on Vivification Ratio",
      "abstract": "The two most effective branching strategies LRB and VSIDS perform differently on different types of instances. Generally, LRB is more effective on crafted instances, while VSIDS is more effective on application ones. However, distinguishing the types of instances is difficult. To overcome this drawback, we propose a branching strategy selection approach based on the vivification ratio. This approach uses the LRB branching strategy more to solve the instances with a very low vivification ratio. We tested the instances from the main track of SAT competitions in recent years. The results show that the proposed approach is robust and it significantly increases the number of solved instances. It is worth mentioning that, with the help of our approach, the solver Maple\\_CM can solve more than 16 instances for the benchmark from the 2020 SAT competition. △ Less",
      "url": "https://arxiv.org/abs/2112.06917"
    },
    {
      "title": "Combining Reinforcement Learning with Lin-Kernighan-Helsgaun Algorithm for the Traveling Salesman Problem",
      "abstract": "We address the Traveling Salesman Problem (TSP), a famous NP-hard combinatorial optimization problem. And we propose a variable strategy reinforced approach, denoted as VSR-LKH, which combines three reinforcement learning methods (Q-learning, Sarsa and Monte Carlo) with the well-known TSP algorithm, called Lin-Kernighan-Helsgaun (LKH). VSR-LKH replaces the inflexible traversal operation in LKH, and lets the program learn to make choice at each search step by reinforcement learning. Experimental results on 111 TSP benchmarks from the TSPLIB with up to 85,900 cities demonstrate the excellent performance of the proposed method. △ Less",
      "url": "https://arxiv.org/abs/2012.04461"
    },
    {
      "title": "Stochastic Item Descent Method for Large Scale Equal Circle Packing Problem",
      "abstract": "Stochastic gradient descent (SGD) is a powerful method for large-scale optimization problems in the area of machine learning, especially for a finite-sum formulation with numerous variables. In recent years, mini-batch SGD gains great success and has become a standard technique for training deep neural networks fed with big amount of data. Inspired by its success in deep learning, we apply the idea of SGD with batch selection of samples to a classic optimization problem in decision version. Given $n$ unit circles, the equal circle packing problem (ECPP) asks whether there exist a feasible packing that could put all the circles inside a circular container without overlapping. Specifically, we propose a stochastic item descent method (SIDM) for ECPP in large scale, which randomly divides the unit circles into batches and runs Broyden-Fletcher-Goldfarb-Shanno (BFGS) algorithm on the corresponding batch function iteratively to speedup the calculation. We also increase the batch size during the batch iterations to gain higher quality solution. Comparing to the current best packing algorithms, SIDM greatly speeds up the calculation of optimization process and guarantees the solution quality for large scale instances with up to 1500 circle items, while the baseline algorithms usually handle about 300 circle items. The results indicate the highly efficiency of SIDM for this classic optimization problem in large scale, and show potential for other large scale classic optimization problems in which gradient descent is used for optimization. △ Less",
      "url": "https://arxiv.org/abs/2001.08540"
    },
    {
      "title": "A Learning based Branch and Bound for Maximum Common Subgraph Problems",
      "abstract": "Branch-and-bound (BnB) algorithms are widely used to solve combinatorial problems, and the performance crucially depends on its branching heuristic.In this work, we consider a typical problem of maximum common subgraph (MCS), and propose a branching heuristic inspired from reinforcement learning with a goal of reaching a tree leaf as early as possible to greatly reduce the search tree size.Extensive experiments show that our method is beneficial and outperforms current best BnB algorithm for the MCS. △ Less",
      "url": "https://arxiv.org/abs/1905.05840"
    },
    {
      "title": "An Exact Algorithm for Minimum Weight Vertex Cover Problem in Large Graphs",
      "abstract": "This paper proposes a novel branch-and-bound(BMWVC) algorithm to exactly solve the minimum weight vertex cover problem (MWVC) in large graphs. The original contribution is several new graph reduction rules, allowing to reduce a graph G and the time needed to find a minimum weight vertex cover in G. Experiments on large graphs from real-world applications show that the reduction rules are effective and the resulting BMWVC algorithm outperforms relevant exact and heuristic MWVC algorithms. △ Less",
      "url": "https://arxiv.org/abs/1903.05948"
    },
    {
      "title": "An Iterative Path-Breaking Approach with Mutation and Restart Strategies for the MAX-SAT Problem",
      "abstract": "Although Path-Relinking is an effective local search method for many combinatorial optimization problems, its application is not straightforward in solving the MAX-SAT, an optimization variant of the satisfiability problem (SAT) that has many real-world applications and has gained more and more attention in academy and industry. Indeed, it was not used in any recent competitive MAX-SAT algorithms in our knowledge. In this paper, we propose a new local search algorithm called IPBMR for the MAX-SAT, that remedies the drawbacks of the Path-Relinking method by using a careful combination of three components: a new strategy named Path-Breaking to avoid unpromising regions of the search space when generating trajectories between two elite solutions; a weak and a strong mutation strategies, together with restarts, to diversify the search; and stochastic path generating steps to avoid premature local optimum solutions. We then present experimental results to show that IPBMR outperforms two of the best state-of-the-art MAX-SAT solvers, and an empirical investigation to identify and explain the effect of the three components in IPBMR. △ Less",
      "url": "https://arxiv.org/abs/1808.03611"
    },
    {
      "title": "Clause Vivification by Unit Propagation in CDCL SAT Solvers",
      "abstract": "Original and learnt clauses in Conflict-Driven Clause Learning (CDCL) SAT solvers often contain redundant literals. This may have a negative impact on performance because redundant literals may deteriorate both the effectiveness of Boolean constraint propagation and the quality of subsequent learnt clauses. To overcome this drawback, we propose a clause vivification approach that eliminates redundant literals by applying unit propagation. The proposed clause vivification is activated before the SAT solver triggers some selected restarts, and only affects a subset of original and learnt clauses, which are considered to be more relevant according to metrics like the literal block distance (LBD). Moreover, we conducted an empirical investigation with instances coming from the hard combinatorial and application categories of recent SAT competitions. The results show that a remarkable number of additional instances are solved when the proposed approach is incorporated into five of the best performing CDCL SAT solvers (Glucose, TC_Glucose, COMiniSatPS, MapleCOMSPS and MapleCOMSPS_LRB). More importantly, the empirical investigation includes an in-depth analysis of the effectiveness of clause vivification. It is worth mentioning that one of the SAT solvers described here was ranked first in the main track of SAT Competition 2017 thanks to the incorporation of the proposed clause vivification. That solver was further improved in this paper and won the bronze medal in the main track of SAT Competition 2018. △ Less",
      "url": "https://arxiv.org/abs/1807.11061"
    },
    {
      "title": "Sum Coloring : New upper bounds for the chromatic strength",
      "abstract": "The Minimum Sum Coloring Problem (MSCP) is derived from the Graph Coloring Problem (GCP) by associating a weight to each color. The aim of MSCP is to find a coloring solution of a graph such that the sum of color weights is minimum. MSCP has important applications in fields such as scheduling and VLSI design. We propose in this paper new upper bounds of the chromatic strength, i.e. the minimum number of colors in an optimal solution of MSCP, based on an abstraction of all possible colorings of a graph called motif. Experimental results on standard benchmarks show that our new bounds are significantly tighter than the previous bounds in general, allowing to reduce substantially the search space when solving MSCP . △ Less",
      "url": "https://arxiv.org/abs/1609.02726"
    }
  ]
}