{
  "author": "Daniel Harabor",
  "results": [
    {
      "title": "Flow-Based Task Assignment for Large-Scale Online Multi-Agent Pickup and Delivery",
      "abstract": "We study the problem of online Multi-Agent Pickup and Delivery (MAPD), where a team of agents must repeatedly serve dynamically appearing tasks on a shared map. Existing online methods either rely on simple heuristics, which result in poor decisions, or employ complex reasoning, which suffers from limited scalability under real-time constraints. In this work, we focus on the task assignment subproblem and formulate it as a minimum-cost flow over the environment graph. This eliminates the need for pairwise distance computations and allows agents to be simultaneously assigned to tasks and routed toward them. The resulting flow network also supports efficient guide path extraction to integrate with the planner and accelerates planning under real-time constraints. To improve solution quality, we introduce two congestion-aware edge cost models that incorporate real-time traffic estimates. This approach supports real-time execution and scales to over 20000 agents and 30000 tasks within 1-second planning time, outperforming existing baselines in both computational efficiency and assignment quality. △ Less",
      "url": "https://arxiv.org/abs/2508.05890"
    },
    {
      "title": "Online Submission and Evaluation System Design for Competition Operations",
      "abstract": "Research communities have developed benchmark datasets across domains to compare the performance of algorithms and techniques However, tracking the progress in these research areas is not easy, as publications appear in different venues at the same time, and many of them claim to represent the state-of-the-art. To address this, research communities often organise periodic competitions to evaluate the performance of various algorithms and techniques, thereby tracking advancements in the field. However, these competitions pose a significant operational burden. The organisers must manage and evaluate a large volume of submissions. Furthermore, participants typically develop their solutions in diverse environments, leading to compatibility issues during the evaluation of their submissions. This paper presents an online competition system that automates the submission and evaluation process for a competition. The competition system allows organisers to manage large numbers of submissions efficiently, utilising isolated environments to evaluate submissions. This system has already been used successfully for several competitions, including the Grid-Based Pathfinding Competition and the League of Robot Runners competition. △ Less",
      "url": "https://arxiv.org/abs/2507.17730"
    },
    {
      "title": "An Exact System Optimum Assignment Model for Transit Demand Management",
      "abstract": "Mass transit systems are experiencing increasing congestion in many cities. The schedule-based transit assignment problem (STAP) involves a joint choice model for departure times and routes, defining a space-time path in which passengers decide when to depart and which route to take. User equilibrium (UE) models for the STAP indicates the current congestion cost, while a system optimum (SO) models can provide insights for congestion relief directions. However, current STAP methods rely on approximate SO (Approx. SO) models, which underestimate the potential for congestion reduction in the system. The few studies in STAP that compute exact SO solutions ignore realistic constraints such as hard capacity, multi-line networks, or spatial-temporal competing demand flows. The paper proposes an exact SO method for the STAP that overcomes these limitations. We apply our approach to a case study involving part of the Hong Kong Mass Transit Railway network, which includes 5 lines, 12 interacting origin-destination pairs and 52,717 passengers. Computing an Approx. SO solution for this system indicates a modest potential for congestion reduction measures, with a cost reduction of 17.39% from the UE solution. Our exact SO solution is 36.35% lower than the UE solution, which is more than double the potential for congestion reduction. We then show how the exact SO solution can be used to identify opportunities for congestion reduction: (i) which origin-destination pairs have the most potential to reduce congestion; (ii) how many passengers can be reasonably shifted; (iii) future system potential with increasing demand and expanding network capacity. △ Less",
      "url": "https://arxiv.org/abs/2505.22241"
    },
    {
      "title": "Departure time choice user equilibrium for public transport demand management",
      "abstract": "Departure time management is an efficient way in addressing the peak-hour crowding in public transport by reducing the temporal imbalance between service supply and travel demand. From the demand management perspective, the problem is to determine an equilibrium distribution of departure times for which no user can reduce their generalized cost by changing their departure times unilaterally. This study introduces the departure time choice user equilibrium problem in public transport (DTUE-PT) for multi-line, schedule-based networks with hard train capacity constraints. We model the DTUE-PT problem as a Non-linear Mathematical Program problem (NMP) (minimizing the system gap) with a simulation model describing the complex system dynamics and passenger interactions. We develop an efficient, adaptive gap-based descent direction (AdaGDD) solution algorithm to solve the NMP problem. We validate the methodology on a multi-line public transport network with transfers by comparing with classical public transport assignment benchmark models, including Method of Successive Average (MSA) and day-to-day learning methods. The results show that the model can achieve a system gap ratio (the solution gap relative to the ideal least cost of an origin-destination option) of 0.1926, which significantly improves the solution performance from day-to-day learning (85%) and MSA (76%) algorithms. The sensitivity analysis highlights the solution stability of AdaGDD method over initial solution settings. The potential use of DTUE-PT model is demonstrated for evaluating the network design of Hong Kong mass transit railway network and can be easily extended to incorporate the route choice. △ Less",
      "url": "https://arxiv.org/abs/2505.18202"
    },
    {
      "title": "Dynamic Replanning for Improved Public Transport Routing",
      "abstract": "Delays in public transport are common, often impacting users through prolonged travel times and missed transfers. Existing solutions for handling delays remain limited; backup plans based on historical data miss opportunities for earlier arrivals, while snapshot planning accounts for current delays but not future ones. With the growing availability of live delay data, users can adjust their journeys in real-time. However, the literature lacks a framework that fully exploits this advantage for system-scale dynamic replanning. To address this, we formalise the dynamic replanning problem in public transport routing and propose two solutions: a \"pull\" approach, where users manually request replanning, and a novel \"push\" approach, where the server proactively monitors and adjusts journeys. Our experiments show that the push approach outperforms the pull approach, achieving significant speedups. The results also reveal substantial arrival time savings enabled by dynamic replanning. △ Less",
      "url": "https://arxiv.org/abs/2505.14193"
    },
    {
      "title": "Anytime Single-Step MAPF Planning with Anytime PIBT",
      "abstract": "PIBT is a popular Multi-Agent Path Finding (MAPF) method at the core of many state-of-the-art MAPF methods including LaCAM, CS-PIBT, and WPPL. The main utility of PIBT is that it is a very fast and effective single-step MAPF solver and can return a collision-free single-step solution for hundreds of agents in less than a millisecond. However, the main drawback of PIBT is that it is extremely greedy in respect to its priorities and thus leads to poor solution quality. Additionally, PIBT cannot use all the planning time that might be available to it and returns the first solution it finds. We thus develop Anytime PIBT, which quickly finds a one-step solution identically to PIBT but then continuously improves the solution in an anytime manner. We prove that Anytime PIBT converges to the optimal solution given sufficient time. We experimentally validate that Anytime PIBT can rapidly improve single-step solution quality within milliseconds and even find the optimal single-step action. However, we interestingly find that improving the single-step solution quality does not have a significant effect on full-horizon solution costs. △ Less",
      "url": "https://arxiv.org/abs/2504.07841"
    },
    {
      "title": "Real-Time LaCAM for Real-Time MAPF",
      "abstract": "The vast majority of Multi-Agent Path Finding (MAPF) methods with completeness guarantees require planning full-horizon paths. However, planning full-horizon paths can take too long and be impractical in real-world applications. Instead, real-time planning and execution, which only allows the planner a finite amount of time before executing and replanning, is more practical for real-world multi-agent systems. Several methods utilize real-time planning schemes but none are provably complete, which leads to livelock or deadlock. Our main contribution is Real-Time LaCAM, the first Real-Time MAPF method with provable completeness guarantees. We do this by leveraging LaCAM (Okumura 2023) in an incremental fashion. Our results show how we can iteratively plan for congested environments with a cutoff time of milliseconds while still maintaining the same success rate as full-horizon LaCAM. We also show how it can be used with a single-step learned MAPF policy. △ Less",
      "url": "https://arxiv.org/abs/2504.06091"
    },
    {
      "title": "Parallelizing Multi-objective A* Search",
      "abstract": "The Multi-objective Shortest Path (MOSP) problem is a classic network optimization problem that aims to find all Pareto-optimal paths between two points in a graph with multiple edge costs. Recent studies on multi-objective search with A* (MOA*) have demonstrated superior performance in solving difficult MOSP instances. This paper presents a novel search framework that allows efficient parallelization of MOA* with different objective orders. The framework incorporates a unique upper bounding strategy that helps the search reduce the problem's dimensionality to one in certain cases. Experimental results demonstrate that the proposed framework can enhance the performance of recent A*-based solutions, with the speed-up proportional to the problem dimension. △ Less",
      "url": "https://arxiv.org/abs/2503.10075"
    },
    {
      "title": "Advancing MAPF towards the Real World: A Scalable Multi-Agent Realistic Testbed (SMART)",
      "abstract": "We present Scalable Multi-Agent Realistic Testbed (SMART), a realistic and efficient software tool for evaluating Multi-Agent Path Finding (MAPF) algorithms. MAPF focuses on planning collision-free paths for a group of agents. While state-ofthe-art MAPF algorithms can plan paths for hundreds of robots in seconds, they often rely on simplified robot models, making their real-world performance unclear. Researchers typically lack access to hundreds of physical robots in laboratory settings to evaluate the algorithms. Meanwhile, industrial professionals who lack expertise in MAPF require an easy-to-use simulator to efficiently test and understand the performance of MAPF algorithms in their specific settings. SMART fills this gap with several advantages: (1) SMART uses physics-engine-based simulators to create realistic simulation environments, accounting for complex real-world factors such as robot kinodynamics and execution uncertainties, (2) SMART uses an execution monitor framework based on the Action Dependency Graph, facilitating seamless integration with various MAPF algorithms and robot models, and (3) SMART scales to thousands of robots. The code is publicly available at https://github.com/smart-mapf/smart. △ Less",
      "url": "https://arxiv.org/abs/2503.04798"
    },
    {
      "title": "Online Guidance Graph Optimization for Lifelong Multi-Agent Path Finding",
      "abstract": "We study the problem of optimizing a guidance policy capable of dynamically guiding the agents for lifelong Multi-Agent Path Finding based on real-time traffic patterns. Multi-Agent Path Finding (MAPF) focuses on moving multiple agents from their starts to goals without collisions. Its lifelong variant, LMAPF, continuously assigns new goals to agents. In this work, we focus on improving the solution quality of PIBT, a state-of-the-art rule-based LMAPF algorithm, by optimizing a policy to generate adaptive guidance. We design two pipelines to incorporate guidance in PIBT in two different ways. We demonstrate the superiority of the optimized policy over both static guidance and human-designed policies. Additionally, we explore scenarios where task distribution changes over time, a challenging yet common situation in real-world applications that is rarely explored in the literature. △ Less",
      "url": "https://arxiv.org/abs/2411.16506"
    },
    {
      "title": "Real-Time Energy-Optimal Path Planning for Electric Vehicles",
      "abstract": "The rapid adoption of electric vehicles (EVs) in modern transport systems has made energy-aware routing a critical task in their successful integration, especially within large-scale networks. In cases where an EV's remaining energy is limited and charging locations are not easily accessible, some destinations may only be reachable through an energy-optimal path: a route that consumes less energy than all other alternatives. The feasibility of such energy-efficient paths depends heavily on the accuracy of the energy model used for planning, and thus failing to account for vehicle dynamics can lead to inaccurate energy estimates, rendering some planned routes infeasible in reality. This paper explores the impact of vehicle dynamics on energy-optimal path planning for EVs. We develop an accurate energy model that incorporates key vehicle dynamics parameters into energy calculations, thereby reducing the risk of planning infeasible paths under battery constraints. The paper also introduces two novel online reweighting functions that allow for a faster, pre-processing free, pathfinding in the presence of negative energy costs resulting from regenerative braking, making them ideal for real-time applications. Through extensive experimentation on real-world transport networks, we demonstrate that our approach considerably enhances energy-optimal pathfinding for EVs in both computational efficiency and energy estimation accuracy. △ Less",
      "url": "https://arxiv.org/abs/2411.12964"
    },
    {
      "title": "Anytime Multi-Agent Path Finding using Operation Parallelism in Large Neighborhood Search",
      "abstract": "Multi-Agent Path Finding (MAPF) is the problem of finding a set of collision-free paths for multiple agents in a shared environment while minimizing the sum of travel time. Since solving the MAPF problem optimally is NP-hard, anytime algorithms based on Large Neighborhood Search (LNS) are promising to find good-quality solutions in a scalable way by iteratively destroying and repairing the paths. We propose Destroy-Repair Operation Parallelism for LNS (DROP-LNS), a parallel framework that performs multiple destroy and repair operations concurrently to explore more regions of the search space within a limited time budget. Unlike classic MAPF approaches, DROP-LNS can exploit parallelized hardware to improve the solution quality. We also formulate two variants of parallelism and conduct experimental evaluations. The results show that DROP-LNS significantly outperforms the state-of-the-art and the variants. △ Less",
      "url": "https://arxiv.org/abs/2402.01961"
    },
    {
      "title": "Traffic Flow Optimisation for Lifelong Multi-Agent Path Finding",
      "abstract": "Multi-Agent Path Finding (MAPF) is a fundamental problem in robotics that asks us to compute collision-free paths for a team of agents, all moving across a shared map. Although many works appear on this topic, all current algorithms struggle as the number of agents grows. The principal reason is that existing approaches typically plan free-flow optimal paths, which creates congestion. To tackle this issue, we propose a new approach for MAPF where agents are guided to their destination by following congestion-avoiding paths. We evaluate the idea in two large-scale settings: one-shot MAPF, where each agent has a single destination, and lifelong MAPF, where agents are continuously assigned new destinations. Empirically, we report large improvements in solution quality for one-short MAPF and in overall throughput for lifelong MAPF. △ Less",
      "url": "https://arxiv.org/abs/2308.11234"
    },
    {
      "title": "Reducing Redundant Work in Jump Point Search",
      "abstract": "JPS (Jump Point Search) is a state-of-the-art optimal algorithm for online grid-based pathfinding. Widely used in games and other navigation scenarios, JPS nevertheless can exhibit pathological behaviours which are not well studied: (i) it may repeatedly scan the same area of the map to find successors; (ii) it may generate and expand suboptimal search nodes. In this work, we examine the source of these pathological behaviours, show how they can occur in practice, and propose a purely online approach, called Constrained JPS (CJPS), to tackle them efficiently. Experimental results show that CJPS has low overheads and is often faster than JPS in dynamically changing grid environments: by up to 7x in large game maps and up to 14x in pathological scenarios. △ Less",
      "url": "https://arxiv.org/abs/2306.15928"
    },
    {
      "title": "Scalable Rail Planning and Replanning with Soft Deadlines",
      "abstract": "The Flatland Challenge, which was first held in 2019 and reported in NeurIPS 2020, is designed to answer the question: How to efficiently manage dense traffic on complex rail networks? Considering the significance of punctuality in real-world railway network operation and the fact that fast passenger trains share the network with slow freight trains, Flatland version 3 introduces trains with different speeds and scheduling time windows. This paper introduces the Flatland 3 problem definitions and extends an award-winning MAPF-based software, which won the NeurIPS 2020 competition, to efficiently solve Flatland 3 problems. The resulting system won the Flatland 3 competition. We designed a new priority ordering for initial planning, a new neighbourhood selection strategy for efficient solution quality improvement with Multi-Agent Path Finding via Large Neighborhood Search(MAPF-LNS), and use MAPF-LNS for partially replanning the trains influenced by malfunction. △ Less",
      "url": "https://arxiv.org/abs/2306.06455"
    },
    {
      "title": "Tracking Progress in Multi-Agent Path Finding",
      "abstract": "Multi-Agent Path Finding (MAPF) is an important core problem for many new and emerging industrial applications. Many works appear on this topic each year, and a large number of substantial advancements and performance improvements have been reported. Yet measuring overall progress in MAPF is difficult: there are many potential competitors, and the computational burden for comprehensive experimentation is prohibitively large. Moreover, detailed data from past experimentation is usually unavailable. In this work, we introduce a set of methodological and visualisation tools which can help the community establish clear indicators for state-of-the-art MAPF performance and which can facilitate large-scale comparisons between MAPF solvers. Our objectives are to lower the barrier of entry for new researchers and to further promote the study of MAPF, since progress in the area and the main challenges are made much clearer. △ Less",
      "url": "https://arxiv.org/abs/2305.08446"
    },
    {
      "title": "Enhanced Methods for the Weight Constrained Shortest Path Problem",
      "abstract": "The classic problem of constrained pathfinding is a well-studied, yet challenging, topic in AI with a broad range of applications in various areas such as communication and transportation. The Weight Constrained Shortest Path Problem (WCSPP), the base form of constrained pathfinding with only one side constraint, aims to plan a cost-optimum path with limited weight/resource usage. Given the bi-criteria nature of the problem (i.e., dealing with the cost and weight of paths), methods addressing the WCSPP have some common properties with bi-objective search. This paper leverages the recent state-of-the-art techniques in both constrained pathfinding and bi-objective search and presents two new solution approaches to the WCSPP on the basis of A* search, both capable of solving hard WCSPP instances on very large graphs. We empirically evaluate the performance of our algorithms on a set of large and realistic problem instances and show their advantages over the state-of-the-art algorithms in both time and space metrics. This paper also investigates the importance of priority queues in constrained search with A*. We show with extensive experiments on both realistic and randomised graphs how bucket-based queues without tie-breaking can effectively improve the algorithmic performance of exhaustive A*-based bi-criteria searches. △ Less",
      "url": "https://arxiv.org/abs/2207.14744"
    },
    {
      "title": "Multi-Target Search in Euclidean Space with Ray Shooting (Full Version)",
      "abstract": "The Euclidean shortest path problem (ESPP) is a well studied problem with many practical applications. Recently a new efficient online approach to this problem, RayScan, has been developed, based on ray shooting and polygon scanning. In this paper we show how we can improve RayScan by carefully reasoning about polygon scans. We also look into how RayScan could be applied in the single-source multi-target scenario, where logic during scanning is used to reduce the number of rays shots required. This improvement also helps in the single target case. We compare the improved RayScan+ against the state-of-the-art ESPP algorithm, illustrating the situations where it is better. △ Less",
      "url": "https://arxiv.org/abs/2207.02436"
    },
    {
      "title": "Integrated Task Assignment and Path Planning for Capacitated Multi-Agent Pickup and Delivery",
      "abstract": "Multi-agent Pickup and Delivery (MAPD) is a challenging industrial problem where a team of robots is tasked with transporting a set of tasks, each from an initial location and each to a specified target location. Appearing in the context of automated warehouse logistics and automated mail sortation, MAPD requires first deciding which robot is assigned what task (i.e., Task Assignment or TA) followed by a subsequent coordination problem where each robot must be assigned collision-free paths so as to successfully complete its assignment (i.e., Multi-Agent Path Finding or MAPF). Leading methods in this area solve MAPD sequentially: first assigning tasks, then assigning paths. In this work we propose a new coupled method where task assignment choices are informed by actual delivery costs instead of by lower-bound estimates. The main ingredients of our approach are a marginal-cost assignment heuristic and a meta-heuristic improvement strategy based on Large Neighbourhood Search. As a further contribution, we also consider a variant of the MAPD problem where each robot can carry multiple tasks instead of just one. Numerical simulations show that our approach yields efficient and timely solutions and we report significant improvement compared with other recent methods from the literature. △ Less",
      "url": "https://arxiv.org/abs/2110.14891"
    },
    {
      "title": "Bi-objective Search with Bi-directional A*",
      "abstract": "Bi-objective search is a well-known algorithmic problem, concerned with finding a set of optimal solutions in a two-dimensional domain. This problem has a wide variety of applications such as planning in transport systems or optimal control in energy systems. Recently, bi-objective A*-based search (BOA*) has shown state-of-the-art performance in large networks. This paper develops a bi-directional and parallel variant of BOA*, enriched with several speed-up heuristics. Our experimental results on 1,000 benchmark cases show that our bi-directional A* algorithm for bi-objective search (BOBA*) can optimally solve all of the benchmark cases within the time limit, outperforming the state of the art BOA*, bi-objective Dijkstra and bi-directional bi-objective Dijkstra by an average runtime improvement of a factor of five over all of the benchmark instances. △ Less",
      "url": "https://arxiv.org/abs/2105.11888"
    },
    {
      "title": "Pairwise Symmetry Reasoning for Multi-Agent Path Finding Search",
      "abstract": "Multi-Agent Path Finding (MAPF) is a challenging combinatorial problem that asks us to plan collision-free paths for a team of cooperative agents. In this work, we show that one of the reasons why MAPF is so hard to solve is due to a phenomenon called pairwise symmetry, which occurs when two agents have many different paths to their target locations, all of which appear promising, but every combination of them results in a collision. We identify several classes of pairwise symmetries and show that each one arises commonly in practice and can produce an exponential explosion in the space of possible collision resolutions, leading to unacceptable runtimes for current state-of-the-art (bounded-sub)optimal MAPF algorithms. We propose a variety of reasoning techniques that detect the symmetries efficiently as they arise and resolve them by using specialized constraints to eliminate all permutations of pairwise colliding paths in a single branching step. We implement these ideas in the context of the leading optimal MAPF algorithm CBS and show that the addition of the symmetry reasoning techniques can have a dramatic positive effect on its performance - we report a reduction in the number of node expansions by up to four orders of magnitude and an increase in scalability by up to thirty times. These gains allow us to solve to optimality a variety of challenging MAPF instances previously considered out of reach for CBS. △ Less",
      "url": "https://arxiv.org/abs/2103.07116"
    },
    {
      "title": "Symmetry Breaking for k-Robust Multi-Agent Path Finding",
      "abstract": "During Multi-Agent Path Finding (MAPF) problems, agents can be delayed by unexpected events. To address such situations recent work describes k-Robust Conflict-BasedSearch (k-CBS): an algorithm that produces coordinated and collision-free plan that is robust for up to k delays. In this work we introducing a variety of pairwise symmetry breaking constraints, specific to k-robust planning, that can efficiently find compatible and optimal paths for pairs of conflicting agents. We give a thorough description of the new constraints and report large improvements to success rate ina range of domains including: (i) classic MAPF benchmarks;(ii) automated warehouse domains and; (iii) on maps from the 2019 Flatland Challenge, a recently introduced railway domain where k-robust planning can be fruitfully applied to schedule trains. △ Less",
      "url": "https://arxiv.org/abs/2102.08689"
    },
    {
      "title": "Organising a Successful AI Online Conference: Lessons from SoCS 2020",
      "abstract": "The 13th Symposium on Combinatorial Search (SoCS) was held May 26-28, 2020. Originally scheduled to take place in Vienna, Austria, the symposium pivoted toward a fully online technical program in early March. As an in-person event SoCS offers participants a diverse array of scholarly activities including technical talks (long and short), poster sessions, plenary sessions, a community meeting and, new for 2020, a Master Class tutorial program. This paper describes challenges, approaches and opportunities associated with adapting these many different activities to the online setting. We consider issues such as scheduling, dissemination, attendee interaction and community engagement before, during and after the event. We report on the approaches taken by SoCS in each case, we give a post-hoc analysis of their their effectiveness and we discuss how these decisions continue to impact the SoCS community in the days after SoCS 2020. △ Less",
      "url": "https://arxiv.org/abs/2006.12129"
    },
    {
      "title": "Position Paper: From Multi-Agent Pathfinding to Pipe Routing",
      "abstract": "The 2D Multi-Agent Path Finding (MAPF) problem aims at finding collision-free paths for a number of agents, from a set of start locations to a set of goal positions in a known 2D environment. MAPF has been studied in theoretical computer science, robotics, and artificial intelligence over several decades, due to its importance for robot navigation. It is currently experiencing significant scientific progress due to its relevance in automated warehousing (such as those operated by Amazon) and in other contemporary application areas. In this paper, we demonstrate that many recently developed MAPF algorithms apply more broadly than currently believed in the MAPF research community. In particular, we describe the 3D Pipe Routing (PR) problem, which aims at placing collision-free pipes from given start locations to given goal locations in a known 3D environment. The MAPF and PR problems are similar: a solution to a MAPF instance is a set of blocked cells in x-y-t space, while a solution to the corresponding PR instance is a set of blocked cells in x-y-z space. We show how to use this similarity to apply several recently developed MAPF algorithms to the PR problem, and discuss their performance on abstract PR instances. We also discuss further research necessary to tackle real-world pipe-routing instances of interest to industry today. This opens up a new direction of industrial relevance for the MAPF research community. △ Less",
      "url": "https://arxiv.org/abs/1905.08412"
    },
    {
      "title": "Searching with Consistent Prioritization for Multi-Agent Path Finding",
      "abstract": "We study prioritized planning for Multi-Agent Path Finding (MAPF). Existing prioritized MAPF algorithms depend on rule-of-thumb heuristics and random assignment to determine a fixed total priority ordering of all agents a priori. We instead explore the space of all possible partial priority orderings as part of a novel systematic and conflict-driven combinatorial search framework. In a variety of empirical comparisons, we demonstrate state-of-the-art solution qualities and success rates, often with similar runtimes to existing algorithms. We also develop new theoretical results that explore the limitations of prioritized planning, in terms of completeness and optimality, for the first time. △ Less",
      "url": "https://arxiv.org/abs/1812.06356"
    },
    {
      "title": "Faster and More Robust Mesh-based Algorithms for Obstacle k-Nearest Neighbour",
      "abstract": "We are interested in the problem of finding $k$ nearest neighbours in the plane and in the presence of polygonal obstacles ($\\textit{OkNN}$). Widely used algorithms for OkNN are based on incremental visibility graphs, which means they require costly and online visibility checking and have worst-case quadratic running time. Recently $\\mathbf{Polyanya}$, a fast point-to-point pathfinding algorithm was proposed which avoids the disadvantages of visibility graphs by searching over an alternative data structure known as a navigation mesh. Previously, we adapted $\\mathbf{Polyanya}$ to multi-target scenarios by developing two specialised heuristic functions: the $\\mathbf{Interval heuristic}$ $h_v$ and the $\\mathbf{Target heuristic}$ $h_t$. Though these methods outperform visibility graph algorithms by orders of magnitude in all our experiments they are not robust: $h_v$ expands many redundant nodes when the set of neighbours is small while $h_t$ performs poorly when the set of neighbours is large. In this paper, we propose new algorithms and heuristics for OkNN which perform well regardless of neighbour density. △ Less",
      "url": "https://arxiv.org/abs/1808.04043"
    },
    {
      "title": "Simulation and Analysis of Container Freight Train Operations at Port Botany",
      "abstract": "Over two million containers crossed the docks at Sydney's Port Botany in 2011/12; a figure that is forecast increase more than threefold by the end of the next decade. To cope with such large growth in volumes the NSW Government plans to double rail mode share at the port by the year 2020. Conventional wisdom from industry and the media says that existing infrastructure cannot handle such volumes. In this paper we use a combination of data analytics and simulation to examine operations at the port and evaluate the efficacy of current infrastructure to handle projected growth in volumes. Contrary to conventional wisdom we find that current rail resources appear distinctly under-utilised. Moreover: (i) the peak rail capacity of Port Botany is 1.78 million TEU per annum; over six times higher than 2011/12 rail volumes; (ii) there are no infrastructural impediments to the achievement of peak rail capacity; (iii) operational changes, not infrastructural investment, are the key to unlocking the potential of the port; (iv) Port Botany is well positioned to handle projected increases in container volumes over the next decade and beyond, including the 28% rail mode share target established by the New South Wales State Government. △ Less",
      "url": "https://arxiv.org/abs/1512.03476"
    },
    {
      "title": "Symmetry-Based Search Space Reduction For Grid Maps",
      "abstract": "In this paper we explore a symmetry-based search space reduction technique which can speed up optimal pathfinding on undirected uniform-cost grid maps by up to 38 times. Our technique decomposes grid maps into a set of empty rectangles, removing from each rectangle all interior nodes and possibly some from along the perimeter. We then add a series of macro-edges between selected pairs of remaining perimeter nodes to facilitate provably optimal traversal through each rectangle. We also develop a novel online pruning technique to further speed up search. Our algorithm is fast, memory efficient and retains the same optimality and completeness guarantees as searching on an unmodified grid map. △ Less",
      "url": "https://arxiv.org/abs/1106.4083"
    },
    {
      "title": "Informed Heuristics for Guiding Stem-and-Cycle Ejection Chains",
      "abstract": "The state of the art in local search for the Traveling Salesman Problem is dominated by ejection chain methods utilising the Stem-and-Cycle reference structure. Though effective such algorithms employ very little information in their successor selection strategy, typically seeking only to minimise the cost of a move. We propose an alternative approach inspired from the AI literature and show how an admissible heuristic can be used to guide successor selection. We undertake an empirical analysis and demonstrate that this technique often produces better results than less informed strategies albeit at the cost of running in higher polynomial time. △ Less",
      "url": "https://arxiv.org/abs/1103.3904"
    }
  ]
}