{
  "author": "Gabriele Röger",
  "results": [
    {
      "title": "Automated planning with ontologies under coherence update semantics (Extended Version)",
      "abstract": "Standard automated planning employs first-order formulas under closed-world semantics to achieve a goal with a given set of actions from an initial state. We follow a line of research that aims to incorporate background knowledge into automated planning problems, for example, by means of ontologies, which are usually interpreted under open-world semantics. We present a new approach for planning with DL-Lite ontologies that combines the advantages of ontology-based action conditions provided by explicit-input knowledge and action bases (eKABs) and ontology-aware action effects under the coherence update semantics. We show that the complexity of the resulting formalism is not higher than that of previous approaches and provide an implementation via a polynomial compilation into classical planning. An evaluation of existing and new benchmarks examines the performance of a planning system on different variants of our compilation. △ Less",
      "url": "https://arxiv.org/abs/2507.15120"
    },
    {
      "title": "GRB 221009A: Observations with LST-1 of CTAO and implications for structured jets in long gamma-ray bursts",
      "abstract": "GRB 221009A is the brightest gamma-ray burst (GRB) observed to date. Extensive observations of its afterglow emission across the electromagnetic spectrum were performed, providing the first strong evidence of a jet with a nontrivial angular structure in a long GRB. We carried out an extensive observation campaign in very-high-energy (VHE) gamma rays with the first Large-Sized Telescope (LST-1) of the future Cherenkov Telescope Array Observatory (CTAO), starting on 2022 October 10, about one day after the burst. A dedicated analysis of the GRB 221009A data is performed to account for the different moonlight conditions under which data were recorded. We find an excess of gamma-like events with a statistical significance of 4.1$σ$ during the observations taken 1.33 days after the burst, followed by background-compatible results for the later days. The results are compared with various models of afterglows from structured jets that are consistent with the published multiwavelength data, but entail significant quantitative and qualitative differences in the VHE emission after one day. We disfavor models that imply VHE flux at one day considerably above $10^{-11}$ erg cm$^{-2}$ s$^{-1}$. Our late-time VHE observations can help disentangle the degeneracy among the models and provide valuable new insight into the structure of GRB jets. △ Less",
      "url": "https://arxiv.org/abs/2507.03077"
    },
    {
      "title": "The Muon Collider",
      "abstract": "Muons offer a unique opportunity to build a compact high-energy electroweak collider at the 10 TeV scale. A Muon Collider enables direct access to the underlying simplicity of the Standard Model and unparalleled reach beyond it. It will be a paradigm-shifting tool for particle physics representing the first collider to combine the high-energy reach of a proton collider and the high precision of an electron-positron collider, yielding a physics potential significantly greater than the sum of its individual parts. A high-energy muon collider is the natural next step in the exploration of fundamental physics after the HL-LHC and a natural complement to a future low-energy Higgs factory. Such a facility would significantly broaden the scope of particle colliders, engaging the many frontiers of the high energy community. The last European Strategy for Particle Physics Update and later the Particle Physics Project Prioritisation Panel in the US requested a study of the muon collider, which is being carried on by the International Muon Collider Collaboration. In this comprehensive document we present the physics case, the state of the work on accelerator design and technology, and propose an R\\&D project that can make the muon collider a reality. △ Less",
      "url": "https://arxiv.org/abs/2504.21417"
    },
    {
      "title": "Pseudo-Boolean Proof Logging for Optimal Classical Planning",
      "abstract": "We introduce lower-bound certificates for classical planning tasks, which can be used to prove the unsolvability of a task or the optimality of a plan in a way that can be verified by an independent third party. We describe a general framework for generating lower-bound certificates based on pseudo-Boolean constraints, which is agnostic to the planning algorithm used. As a case study, we show how to modify the $A^{*}$ algorithm to produce proofs of optimality with modest overhead, using pattern database heuristics and $h^\\textit{max}$ as concrete examples. The same proof logging approach works for any heuristic whose inferences can be efficiently expressed as reasoning over pseudo-Boolean constraints. △ Less",
      "url": "https://arxiv.org/abs/2504.18443"
    },
    {
      "title": "S-EO: A Large-Scale Dataset for Geometry-Aware Shadow Detection in Remote Sensing Applications",
      "abstract": "We introduce the S-EO dataset: a large-scale, high-resolution dataset, designed to advance geometry-aware shadow detection. Collected from diverse public-domain sources, including challenge datasets and government providers such as USGS, our dataset comprises 702 georeferenced tiles across the USA, each covering 500x500 m. Each tile includes multi-date, multi-angle WorldView-3 pansharpened RGB images, panchromatic images, and a ground-truth DSM of the area obtained from LiDAR scans. For each image, we provide a shadow mask derived from geometry and sun position, a vegetation mask based on the NDVI index, and a bundle-adjusted RPC model. With approximately 20,000 images, the S-EO dataset establishes a new public resource for shadow detection in remote sensing imagery and its applications to 3D reconstruction. To demonstrate the dataset's impact, we train and evaluate a shadow detector, showcasing its ability to generalize, even to aerial images. Finally, we extend EO-NeRF - a state-of-the-art NeRF approach for satellite imagery - to leverage our shadow predictions for improved 3D reconstructions. △ Less",
      "url": "https://arxiv.org/abs/2504.06920"
    },
    {
      "title": "Insights from the first flaring activity of a high-synchrotron-peaked blazar with X-ray polarization and VHE gamma rays",
      "abstract": "We study a flaring activity of the HSP Mrk421 that was characterized from radio to very-high-energy (VHE; E $>0.1$TeV) gamma rays with MAGIC, Fermi-LAT, Swift, XMM-Newton and several optical and radio telescopes. These observations included, for the first time for a gamma-ray flare of a blazar, simultaneous X-ray polarization measurements with IXPE. We find substantial variability in both X-rays and VHE gamma rays throughout the campaign, with the highest VHE flux above 0.2 TeV occurring during the IXPE observing window, and exceeding twice the flux of the Crab Nebula. However, the VHE and X-ray spectra are on average softer, and the correlation between these two bands weaker that those reported in previous flares of Mrk421. IXPE reveals an X-ray polarization degree significantly higher than that at radio and optical frequencies. The X-ray polarization angle varies by $\\sim$100$^\\circ$ on timescales of days, and the polarization degree changes by more than a factor 4. The highest X-ray polarization degree reaches 26%, around which a X-ray counter-clockwise hysteresis loop is measured with XMM-Newton. It suggests that the X-ray emission comes from particles close to the high-energy cutoff, hence possibly probing an extreme case of the Turbulent Extreme Multi-Zone model. We model the broadband emission with a simplified stratified jet model throughout the flare. The polarization measurements imply an electron distribution in the X-ray emitting region with a very high minimum Lorentz factor, which is expected in electron-ion plasma, as well as a variation of the emitting region size up to a factor of three during the flaring activity. We find no correlation between the fluxes and the evolution of the model parameters, which indicates a stochastic nature of the underlying physical mechanism. Such behaviour would be expected in a highly turbulent electron-ion plasma crossing a shock front. △ Less",
      "url": "https://arxiv.org/abs/2410.23140"
    },
    {
      "title": "A Two-Week $IXPE$ Monitoring Campaign on Mrk 421",
      "abstract": "X-ray polarization is a unique new probe of the particle acceleration in astrophysical jets made possible through the Imaging X-ray Polarimetry Explorer. Here we report on the first dense X-ray polarization monitoring campaign on the blazar Mrk 421. Our observations were accompanied by an even denser radio and optical polarization campaign. We find significant short-timescale variability in both X-ray polarization degree and angle, including a $\\sim90^\\circ$ angle rotation about the jet axis. We attribute this to random variations of the magnetic field, consistent with the presence of turbulence but also unlikely to be explained by turbulence alone. At the same time, the degree of lower-energy polarization is significantly lower and shows no more than mild variability. Our campaign provides further evidence for a scenario in which energy-stratified shock-acceleration of relativistic electrons, combined with a turbulent magnetic field, is responsible for optical to X-ray synchrotron emission in blazar jets. △ Less",
      "url": "https://arxiv.org/abs/2410.19983"
    },
    {
      "title": "A new method of reconstructing images of gamma-ray telescopes applied to the LST-1 of CTAO",
      "abstract": "Imaging atmospheric Cherenkov telescopes (IACTs) are used to observe very high-energy photons from the ground. Gamma rays are indirectly detected through the Cherenkov light emitted by the air showers they induce. The new generation of experiments, in particular the Cherenkov Telescope Array Observatory (CTAO), sets ambitious goals for discoveries of new gamma-ray sources and precise measurements of the already discovered ones. To achieve these goals, both hardware and data analysis must employ cutting-edge techniques. This also applies to the LST-1, the first IACT built for the CTAO, which is currently taking data on the Canary island of La Palma. This paper introduces a new event reconstruction technique for IACT data, aiming to improve the image reconstruction quality and the discrimination between the signal and the background from misidentified hadrons and electrons. The technique models the development of the extensive air shower signal, recorded as a waveform per pixel, seen by CTAO telescopes' cameras. Model parameters are subsequently passed to random forest regressors and classifiers to extract information on the primary particle. The new reconstruction was applied to simulated data and to data from observations of the Crab Nebula performed by the LST-1. The event reconstruction method presented here shows promising performance improvements. The angular and energy resolution, and the sensitivity, are improved by 10 to 20% over most of the energy range. At low energy, improvements reach up to 22%, 47%, and 50%, respectively. A future extension of the method to stereoscopic analysis for telescope arrays will be the next important step. △ Less",
      "url": "https://arxiv.org/abs/2410.16042"
    },
    {
      "title": "Broadband Multi-wavelength Properties of M87 during the 2018 EHT Campaign including a Very High Energy Flaring Episode",
      "abstract": "The nearby elliptical galaxy M87 contains one of the only two supermassive black holes whose emission surrounding the event horizon has been imaged by the Event Horizon Telescope (EHT). In 2018, more than two dozen multi-wavelength (MWL) facilities (from radio to gamma-ray energies) took part in the second M87 EHT campaign. The goal of this extensive MWL campaign was to better understand the physics of the accreting black hole M87*, the relationship between the inflow and inner jets, and the high-energy particle acceleration. Understanding the complex astrophysics is also a necessary first step towards performing further tests of general relativity. The MWL campaign took place in April 2018, overlapping with the EHT M87* observations. We present a new, contemporaneous spectral energy distribution (SED) ranging from radio to very high energy (VHE) gamma-rays, as well as details of the individual observations and light curves. We also conduct phenomenological modelling to investigate the basic source properties. We present the first VHE gamma-ray flare from M87 detected since 2010. The flux above 350 GeV has more than doubled within a period of about 36 hours. We find that the X-ray flux is enhanced by about a factor of two compared to 2017, while the radio and millimetre core fluxes are consistent between 2017 and 2018. We detect evidence for a monotonically increasing jet position angle that corresponds to variations in the bright spot of the EHT image. Our results show the value of continued MWL monitoring together with precision imaging for addressing the origins of high-energy particle acceleration. While we cannot currently pinpoint the precise location where such acceleration takes place, the new VHE gamma-ray flare already presents a challenge to simple one-zone leptonic emission model approaches, and emphasises the need for combined image and spectral modelling. △ Less",
      "url": "https://arxiv.org/abs/2404.17623"
    },
    {
      "title": "Investigating the shortcomings of the Flow Convergence Method for quantification of Mitral Regurgitation in a pulsatile in-vitro environment and with Computational Fluid Dynamics",
      "abstract": "The flow convergence method includes calculation of the proximal isovelocity surface area (PISA) and is widely used to classify mitral regurgitation (MR) with echocardiography. It constitutes a primary decision factor for determination of treatment and should therefore be a robust quantification method. However, it is known for its tendency to underestimate MR and its dependence on user expertise. The present work systematically compares different pulsatile flow profiles arising from different regurgitation orifices using transesophageal echocardiographic (TEE) probe and particle image velocimetry (PIV) as a reference in an in-vitro environment. It is found that the inter-observer variability using echocardiography is small compared to the systematic underestimation of the regurgitation volume for large orifice areas (up to 52%) where a violation of the flow convergence method assumptions occurs. From a flow perspective, a starting vortex was found as a dominant flow pattern in the regurgant jet for all orifice shapes and sizes. A series of simplified computational fluid dynamics (CFD) simulations indicate that selecting a suboptimal aliasing velocity during echocardiography measurements might be a primary source of potential underestimation in MR characterization via the PISA-based method, reaching up to 40%. In this study, it has been noted in clinical observations that physicians often select an aliasing velocity higher than necessary for optimal estimation in diagnostic procedures. △ Less",
      "url": "https://arxiv.org/abs/2403.05224"
    },
    {
      "title": "The variability patterns of the TeV blazar PG 1553+113 from a decade of MAGIC and multi-band observations",
      "abstract": "PG 1553+113 is one of the few blazars with a convincing quasi-periodic emission in the gamma-ray band. The source is also a very high-energy (VHE; >100 GeV) gamma-ray emitter. To better understand its properties and identify the underlying physical processes driving its variability, the MAGIC Collaboration initiated a multiyear, multiwavelength monitoring campaign in 2015 involving the OVRO 40-m and Medicina radio telescopes, REM, KVA, and the MAGIC telescopes, Swift and Fermi satellites, and the WEBT network. The analysis presented in this paper uses data until 2017 and focuses on the characterization of the variability. The gamma-ray data show a (hint of a) periodic signal compatible with literature, but the X-ray and VHE gamma-ray data do not show statistical evidence for a periodic signal. In other bands, the data are compatible with the gamma-ray period, but with a relatively high p-value. The complex connection between the low and high-energy emission and the non-monochromatic modulation and changes in flux suggests that a simple one-zone model is unable to explain all the variability. Instead, a model including a periodic component along with multiple emission zones is required. △ Less",
      "url": "https://arxiv.org/abs/2403.02159"
    },
    {
      "title": "Insights into the broad-band emission of the TeV blazar Mrk 501 during the first X-ray polarization measurements",
      "abstract": "We present the first multi-wavelength study of Mrk 501 including very-high-energy (VHE) gamma-ray observations simultaneous to X-ray polarization measurements from the Imaging X-ray Polarimetry Explorer (IXPE). We use radio-to-VHE data from a multi-wavelength campaign organized between 2022-03-01 and 2022-07-19. The observations were performed by MAGIC, Fermi-LAT, NuSTAR, Swift (XRT and UVOT), and several instruments covering the optical and radio bands. During the IXPE pointings, the VHE state is close to the average behavior with a 0.2-1 TeV flux of 20%-50% the emission of the Crab Nebula. Despite the average VHE activity, an extreme X-ray behavior is measured for the first two IXPE pointings in March 2022 with a synchrotron peak frequency >1 keV. For the third IXPE pointing in July 2022, the synchrotron peak shifts towards lower energies and the optical/X-ray polarization degrees drop. The X-ray polarization is systematically higher than at lower energies, suggesting an energy-stratification of the jet. While during the IXPE epochs the polarization angle in the X-ray, optical and radio bands align well, we find a clear discrepancy in the optical and radio polarization angles in the middle of the campaign. We model the broad-band spectra simultaneous to the IXPE pointings assuming a compact zone dominating in the X-rays and VHE, and an extended zone stretching further downstream the jet dominating the emission at lower energies. NuSTAR data allow us to precisely constrain the synchrotron peak and therefore the underlying electron distribution. The change between the different states observed in the three IXPE pointings can be explained by a change of magnetization and/or emission region size, which directly connects the shift of the synchrotron peak to lower energies with the drop in polarization degree. △ Less",
      "url": "https://arxiv.org/abs/2401.08560"
    },
    {
      "title": "Constraints on axion-like particles with the Perseus Galaxy Cluster with MAGIC",
      "abstract": "Axion-like particles (ALPs) are pseudo-Nambu-Goldstone bosons that emerge in various theories beyond the standard model. These particles can interact with high-energy photons in external magnetic fields, influencing the observed gamma-ray spectrum. This study analyzes 41.3 hrs of observational data from the Perseus Galaxy Cluster collected with the MAGIC telescopes. We focused on the spectra the radio galaxy in the center of the cluster: NGC 1275. By modeling the magnetic field surrounding this target, we searched for spectral indications of ALP presence. Despite finding no statistical evidence of ALP signatures, we were able to exclude ALP models in the sub-micro electronvolt range. Our analysis improved upon previous work by calculating the full likelihood and statistical coverage for all considered models across the parameter space. Consequently, we achieved the most stringent limits to date for ALP masses around 50 neV, with cross sections down to $g_{aγ} = 3 \\times 10^{-12}$ GeV$^{-1}$. △ Less",
      "url": "https://arxiv.org/abs/2401.07798"
    },
    {
      "title": "Radar Fields: An Extension of Radiance Fields to SAR",
      "abstract": "Radiance fields have been a major breakthrough in the field of inverse rendering, novel view synthesis and 3D modeling of complex scenes from multi-view image collections. Since their introduction, it was shown that they could be extended to other modalities such as LiDAR, radio frequencies, X-ray or ultrasound. In this paper, we show that, despite the important difference between optical and synthetic aperture radar (SAR) image formation models, it is possible to extend radiance fields to radar images thus presenting the first \"radar fields\". This allows us to learn surface models using only collections of radar images, similar to how regular radiance fields are learned and with the same computational complexity on average. Thanks to similarities in how both fields are defined, this work also shows a potential for hybrid methods combining both optical and SAR images. △ Less",
      "url": "https://arxiv.org/abs/2312.12961"
    },
    {
      "title": "Fast, multicolour optical sectioning over extended fields of view by combining interferometric SIM with machine learning",
      "abstract": "Structured illumination can reject out-of-focus signal from a sample, enabling high-speed and high-contrast imaging over large areas with widefield detection optics. Currently, this optical-sectioning technique is limited by image reconstruction artefacts and the need for sequential imaging of multiple colour channels. We combine multicolour interferometric pattern generation with machine-learning processing, permitting high-contrast, real-time reconstruction of image data. The method is insensitive to background noise and unevenly phase-stepped illumination patterns. We validate the method in silico and demonstrate its application on diverse specimens, ranging from fixed and live biological cells to synthetic biosystems, imaging at up to 37 Hz across a 44 x 44 $μm^2$ field of view. △ Less",
      "url": "https://arxiv.org/abs/2311.00089"
    },
    {
      "title": "Chasing Gravitational Waves with the Cherenkov Telescope Array",
      "abstract": "The detection of gravitational waves from a binary neutron star merger by Advanced LIGO and Advanced Virgo (GW170817), along with the discovery of the electromagnetic counterparts of this gravitational wave event, ushered in a new era of multimessenger astronomy, providing the first direct evidence that BNS mergers are progenitors of short gamma-ray bursts (GRBs). Such events may also produce very-high-energy (VHE, > 100GeV) photons which have yet to be detected in coincidence with a gravitational wave signal. The Cherenkov Telescope Array (CTA) is a next-generation VHE observatory which aims to be indispensable in this search, with an unparalleled sensitivity and ability to slew anywhere on the sky within a few tens of seconds. New observing modes and follow-up strategies are being developed for CTA to rapidly cover localization areas of gravitational wave events that are typically larger than the CTA field of view. This work will evaluate and provide estimations on the expected number of of gravitational wave events that will be observable with CTA, considering both on- and off-axis emission. In addition, we will present and discuss the prospects of potential follow-up strategies with CTA. △ Less",
      "url": "https://arxiv.org/abs/2310.07413"
    },
    {
      "title": "Observations of the Crab Nebula and Pulsar with the Large-Sized Telescope Prototype of the Cherenkov Telescope Array",
      "abstract": "CTA (Cherenkov Telescope Array) is the next generation ground-based observatory for gamma-ray astronomy at very-high energies. The Large-Sized Telescope prototype (LST-1) is located at the Northern site of CTA, on the Canary Island of La Palma. LSTs are designed to provide optimal performance in the lowest part of the energy range covered by CTA, down to $\\simeq 20$ GeV. LST-1 started performing astronomical observations in November 2019, during its commissioning phase, and it has been taking data since then. We present the first LST-1 observations of the Crab Nebula, the standard candle of very-high energy gamma-ray astronomy, and use them, together with simulations, to assess the basic performance parameters of the telescope. The data sample consists of around 36 hours of observations at low zenith angles collected between November 2020 and March 2022. LST-1 has reached the expected performance during its commissioning period - only a minor adjustment of the preexisting simulations was needed to match the telescope behavior. The energy threshold at trigger level is estimated to be around 20 GeV, rising to $\\simeq 30$ GeV after data analysis. Performance parameters depend strongly on energy, and on the strength of the gamma-ray selection cuts in the analysis: angular resolution ranges from 0.12 to 0.40 degrees, and energy resolution from 15 to 50%. Flux sensitivity is around 1.1% of the Crab Nebula flux above 250 GeV for a 50-h observation (12% for 30 minutes). The spectral energy distribution (in the 0.03 - 30 TeV range) and the light curve obtained for the Crab Nebula agree with previous measurements, considering statistical and systematic uncertainties. A clear periodic signal is also detected from the pulsar at the center of the Nebula. △ Less",
      "url": "https://arxiv.org/abs/2306.12960"
    },
    {
      "title": "Gamma-ray observations of MAXI J1820+070 during the 2018 outburst",
      "abstract": "MAXI J1820+070 is a low-mass X-ray binary with a black hole as a compact object. This binary underwent an exceptionally bright X-ray outburst from March to October 2018, showing evidence of a non-thermal particle population through its radio emission during this whole period. The combined results of 59.5 hours of observations of the MAXI J1820+070 outburst with the H.E.S.S., MAGIC and VERITAS experiments at energies above 200 GeV are presented, together with Fermi-LAT data between 0.1 and 500 GeV, and multiwavelength observations from radio to X-rays. Gamma-ray emission is not detected from MAXI J1820+070, but the obtained upper limits and the multiwavelength data allow us to put meaningful constraints on the source properties under reasonable assumptions regarding the non-thermal particle population and the jet synchrotron spectrum. In particular, it is possible to show that, if a high-energy gamma-ray emitting region is present during the hard state of the source, its predicted flux should be at most a factor of 20 below the obtained Fermi-LAT upper limits, and closer to them for magnetic fields significantly below equipartition. During the state transitions, under the plausible assumption that electrons are accelerated up to ~ 500 GeV, the multiwavelength data and the gamma-ray upper limits lead consistently to the conclusion that a potential high-energy and very-high-energy gamma-ray emitting region should be located at a distance from the black hole ranging between 10^11 and 10^13 cm. Similar outbursts from low-mass X-ray binaries might be detectable in the near future with upcoming instruments such as CTA. △ Less",
      "url": "https://arxiv.org/abs/2209.09785"
    },
    {
      "title": "Regularization of NeRFs using differential geometry",
      "abstract": "Neural radiance fields, or NeRF, represent a breakthrough in the field of novel view synthesis and 3D modeling of complex scenes from multi-view image collections. Numerous recent works have shown the importance of making NeRF models more robust, by means of regularization, in order to train with possibly inconsistent and/or very sparse data. In this work, we explore how differential geometry can provide elegant regularization tools for robustly training NeRF-like models, which are modified so as to represent continuous and infinitely differentiable functions. In particular, we present a generic framework for regularizing different types of NeRFs observations to improve the performance in challenging conditions. We also show how the same formalism can also be used to natively encourage the regularity of surfaces by means of Gaussian or mean curvatures. △ Less",
      "url": "https://arxiv.org/abs/2206.14938"
    },
    {
      "title": "Sat-NeRF: Learning Multi-View Satellite Photogrammetry With Transient Objects and Shadow Modeling Using RPC Cameras",
      "abstract": "We introduce the Satellite Neural Radiance Field (Sat-NeRF), a new end-to-end model for learning multi-view satellite photogrammetry in the wild. Sat-NeRF combines some of the latest trends in neural rendering with native satellite camera models, represented by rational polynomial coefficient (RPC) functions. The proposed method renders new views and infers surface models of similar quality to those obtained with traditional state-of-the-art stereo pipelines. Multi-date images exhibit significant changes in appearance, mainly due to varying shadows and transient objects (cars, vegetation). Robustness to these challenges is achieved by a shadow-aware irradiance model and uncertainty weighting to deal with transient phenomena that cannot be explained by the position of the sun. We evaluate Sat-NeRF using WorldView-3 images from different locations and stress the advantages of applying a bundle adjustment to the satellite camera models prior to training. This boosts the network performance and can optionally be used to extract additional cues for depth supervision. △ Less",
      "url": "https://arxiv.org/abs/2203.08896"
    },
    {
      "title": "Snowmass 2021 CMB-S4 White Paper",
      "abstract": "This Snowmass 2021 White Paper describes the Cosmic Microwave Background Stage 4 project CMB-S4, which is designed to cross critical thresholds in our understanding of the origin and evolution of the Universe, from the highest energies at the dawn of time through the growth of structure to the present day. We provide an overview of the science case, the technical design, and project plan. △ Less",
      "url": "https://arxiv.org/abs/2203.08024"
    },
    {
      "title": "The Seventeenth Data Release of the Sloan Digital Sky Surveys: Complete Release of MaNGA, MaStar and APOGEE-2 Data",
      "abstract": "This paper documents the seventeenth data release (DR17) from the Sloan Digital Sky Surveys; the fifth and final release from the fourth phase (SDSS-IV). DR17 contains the complete release of the Mapping Nearby Galaxies at Apache Point Observatory (MaNGA) survey, which reached its goal of surveying over 10,000 nearby galaxies. The complete release of the MaNGA Stellar Library (MaStar) accompanies this data, providing observations of almost 30,000 stars through the MaNGA instrument during bright time. DR17 also contains the complete release of the Apache Point Observatory Galactic Evolution Experiment 2 (APOGEE-2) survey which publicly releases infra-red spectra of over 650,000 stars. The main sample from the Extended Baryon Oscillation Spectroscopic Survey (eBOSS), as well as the sub-survey Time Domain Spectroscopic Survey (TDSS) data were fully released in DR16. New single-fiber optical spectroscopy released in DR17 is from the SPectroscipic IDentification of ERosita Survey (SPIDERS) sub-survey and the eBOSS-RM program. Along with the primary data sets, DR17 includes 25 new or updated Value Added Catalogs (VACs). This paper concludes the release of SDSS-IV survey data. SDSS continues into its fifth phase with observations already underway for the Milky Way Mapper (MWM), Local Volume Mapper (LVM) and Black Hole Mapper (BHM) surveys. △ Less",
      "url": "https://arxiv.org/abs/2112.02026"
    },
    {
      "title": "Automatic Stockpile Volume Monitoring using Multi-view Stereo from SkySat Imagery",
      "abstract": "This paper proposes a system for automatic surface volume monitoring from time series of SkySat pushframe imagery. A specific challenge of building and comparing large 3D models from SkySat data is to correct inconsistencies between the camera models associated to the multiple views that are necessary to cover the area at a given time, where these camera models are represented as Rational Polynomial Cameras (RPCs). We address the problem by proposing a date-wise RPC refinement, able to handle dynamic areas covered by sets of partially overlapping views. The cameras are refined by means of a rotation that compensates for errors due to inaccurate knowledge of the satellite attitude. The refined RPCs are then used to reconstruct multiple consistent Digital Surface Models (DSMs) from different stereo pairs at each date. RPC refinement strengthens the consistency between the DSMs of each date, which is extremely beneficial to accurately measure volumes in the 3D surface models. The system is tested in a real case scenario, to monitor large coal stockpiles. Our volume estimates are validated with measurements collected on site in the same period of time. △ Less",
      "url": "https://arxiv.org/abs/2103.00945"
    },
    {
      "title": "Robust Rational Polynomial Camera Modelling for SAR and Pushbroom Imaging",
      "abstract": "The Rational Polynomial Camera (RPC) model can be used to describe a variety of image acquisition systems in remote sensing, notably optical and Synthetic Aperture Radar (SAR) sensors. RPC functions relate 3D to 2D coordinates and vice versa, regardless of physical sensor specificities, which has made them an essential tool to harness satellite images in a generic way. This article describes a terrain-independent algorithm to accurately derive a RPC model from a set of 3D-2D point correspondences based on a regularized least squares fit. The performance of the method is assessed by varying the point correspondences and the size of the area that they cover. We test the algorithm on SAR and optical data, to derive RPCs from physical sensor models or from other RPC models after composition with corrective functions. △ Less",
      "url": "https://arxiv.org/abs/2102.13423"
    },
    {
      "title": "VLBI20-30: a scientific roadmap for the next decade -- The future of the European VLBI Network",
      "abstract": "This white paper describes the science case for Very Long Baseline Interferometry (VLBI) and provides suggestions towards upgrade paths for the European VLBI Network (EVN). The EVN is a distributed long-baseline radio interferometric array, that operates at the very forefront of astronomical research. Recent results, together with the new science possibilities outlined in this vision document, demonstrate the EVN's potential to generate new and exciting results that will transform our view of the cosmos. Together with e-MERLIN, the EVN provides a range of baseline lengths that permit unique studies of faint radio sources to be made over a wide range of spatial scales. The science cases are reviewed in six chapters that cover the following broad areas: cosmology, galaxy formation and evolution, innermost regions of active galactic nuclei, explosive phenomena and transients, stars and stellar masers in the Milky Way, celestial reference frames and space applications. The document concludes with identifying the synergies with other radio, as well as multi-band/multi-messenger instruments, and provide the recommendations for future improvements. The appendices briefly describe other radio VLBI arrays, the technological framework for EVN developments, and a selection of spectral lines of astrophysical interest below 100 GHz. The document includes a glossary for non-specialists, and a list of acronyms at the end. △ Less",
      "url": "https://arxiv.org/abs/2007.02347"
    },
    {
      "title": "The Sixteenth Data Release of the Sloan Digital Sky Surveys: First Release from the APOGEE-2 Southern Survey and Full Release of eBOSS Spectra",
      "abstract": "This paper documents the sixteenth data release (DR16) from the Sloan Digital Sky Surveys; the fourth and penultimate from the fourth phase (SDSS-IV). This is the first release of data from the southern hemisphere survey of the Apache Point Observatory Galactic Evolution Experiment 2 (APOGEE-2); new data from APOGEE-2 North are also included. DR16 is also notable as the final data release for the main cosmological program of the Extended Baryon Oscillation Spectroscopic Survey (eBOSS), and all raw and reduced spectra from that project are released here. DR16 also includes all the data from the Time Domain Spectroscopic Survey (TDSS) and new data from the SPectroscopic IDentification of ERosita Survey (SPIDERS) programs, both of which were co-observed on eBOSS plates. DR16 has no new data from the Mapping Nearby Galaxies at Apache Point Observatory (MaNGA) survey (or the MaNGA Stellar Library \"MaStar\"). We also preview future SDSS-V operations (due to start in 2020), and summarize plans for the final SDSS-IV data release (DR17). △ Less",
      "url": "https://arxiv.org/abs/1912.02905"
    },
    {
      "title": "The Fifteenth Data Release of the Sloan Digital Sky Surveys: First Release of MaNGA Derived Quantities, Data Visualization Tools and Stellar Library",
      "abstract": "Twenty years have passed since first light for the Sloan Digital Sky Survey (SDSS). Here, we release data taken by the fourth phase of SDSS (SDSS-IV) across its first three years of operation (July 2014-July 2017). This is the third data release for SDSS-IV, and the fifteenth from SDSS (Data Release Fifteen; DR15). New data come from MaNGA - we release 4824 datacubes, as well as the first stellar spectra in the MaNGA Stellar Library (MaStar), the first set of survey-supported analysis products (e.g. stellar and gas kinematics, emission line, and other maps) from the MaNGA Data Analysis Pipeline (DAP), and a new data visualisation and access tool we call \"Marvin\". The next data release, DR16, will include new data from both APOGEE-2 and eBOSS; those surveys release no new data here, but we document updates and corrections to their data processing pipelines. The release is cumulative; it also includes the most recent reductions and calibrations of all data taken by SDSS since first light. In this paper we describe the location and format of the data and tools and cite technical references describing how it was obtained and processed. The SDSS website (www.sdss.org) has also been updated, providing links to data downloads, tutorials and examples of data use. While SDSS-IV will continue to collect astronomical data until 2020, and will be followed by SDSS-V (2020-2025), we end this paper by describing plans to ensure the sustainability of the SDSS data archive for many years beyond the collection of data. △ Less",
      "url": "https://arxiv.org/abs/1812.02759"
    },
    {
      "title": "A Roadmap for HEP Software and Computing R&D for the 2020s",
      "abstract": "Particle physics has an ambitious and broad experimental programme for the coming decades. This programme requires large investments in detector hardware, either to build new facilities and experiments, or to upgrade existing ones. Similarly, it requires commensurate investment in the R&D of software to acquire, manage, process, and analyse the shear amounts of data to be recorded. In planning for the HL-LHC in particular, it is critical that all of the collaborating stakeholders agree on the software goals and priorities, and that the efforts complement each other. In this spirit, this white paper describes the R&D activities required to prepare for this software upgrade. △ Less",
      "url": "https://arxiv.org/abs/1712.06982"
    },
    {
      "title": "The Fourteenth Data Release of the Sloan Digital Sky Survey: First Spectroscopic Data from the extended Baryon Oscillation Spectroscopic Survey and from the second phase of the Apache Point Observatory Galactic Evolution Experiment",
      "abstract": "The fourth generation of the Sloan Digital Sky Survey (SDSS-IV) has been in operation since July 2014. This paper describes the second data release from this phase, and the fourteenth from SDSS overall (making this, Data Release Fourteen or DR14). This release makes public data taken by SDSS-IV in its first two years of operation (July 2014-2016). Like all previous SDSS releases, DR14 is cumulative, including the most recent reductions and calibrations of all data taken by SDSS since the first phase began operations in 2000. New in DR14 is the first public release of data from the extended Baryon Oscillation Spectroscopic Survey (eBOSS); the first data from the second phase of the Apache Point Observatory (APO) Galactic Evolution Experiment (APOGEE-2), including stellar parameter estimates from an innovative data driven machine learning algorithm known as \"The Cannon\"; and almost twice as many data cubes from the Mapping Nearby Galaxies at APO (MaNGA) survey as were in the previous release (N = 2812 in total). This paper describes the location and format of the publicly available data from SDSS-IV surveys. We provide references to the important technical papers describing how these data have been taken (both targeting and observation details) and processed for scientific use. The SDSS website (www.sdss.org) has been updated for this release, and provides links to data downloads, as well as tutorials and examples of data use. SDSS-IV is planning to continue to collect astronomical data until 2020, and will be followed by SDSS-V. △ Less",
      "url": "https://arxiv.org/abs/1707.09322"
    },
    {
      "title": "Sloan Digital Sky Survey IV: Mapping the Milky Way, Nearby Galaxies, and the Distant Universe",
      "abstract": "We describe the Sloan Digital Sky Survey IV (SDSS-IV), a project encompassing three major spectroscopic programs. The Apache Point Observatory Galactic Evolution Experiment 2 (APOGEE-2) is observing hundreds of thousands of Milky Way stars at high resolution and high signal-to-noise ratio in the near-infrared. The Mapping Nearby Galaxies at Apache Point Observatory (MaNGA) survey is obtaining spatially-resolved spectroscopy for thousands of nearby galaxies (median redshift of z = 0.03). The extended Baryon Oscillation Spectroscopic Survey (eBOSS) is mapping the galaxy, quasar, and neutral gas distributions between redshifts z = 0.6 and 3.5 to constrain cosmology using baryon acoustic oscillations, redshift space distortions, and the shape of the power spectrum. Within eBOSS, we are conducting two major subprograms: the SPectroscopic IDentification of eROSITA Sources (SPIDERS), investigating X-ray AGN and galaxies in X-ray clusters, and the Time Domain Spectroscopic Survey (TDSS), obtaining spectra of variable sources. All programs use the 2.5-meter Sloan Foundation Telescope at Apache Point Observatory; observations there began in Summer 2014. APOGEE-2 also operates a second near-infrared spectrograph at the 2.5-meter du Pont Telescope at Las Campanas Observatory, with observations beginning in early 2017. Observations at both facilities are scheduled to continue through 2020. In keeping with previous SDSS policy, SDSS-IV provides regularly scheduled public data releases; the first one, Data Release 13, was made available in July 2016. △ Less",
      "url": "https://arxiv.org/abs/1703.00052"
    },
    {
      "title": "The Thirteenth Data Release of the Sloan Digital Sky Survey: First Spectroscopic Data from the SDSS-IV Survey MApping Nearby Galaxies at Apache Point Observatory",
      "abstract": "The fourth generation of the Sloan Digital Sky Survey (SDSS-IV) began observations in July 2014. It pursues three core programs: APOGEE-2, MaNGA, and eBOSS. In addition, eBOSS contains two major subprograms: TDSS and SPIDERS. This paper describes the first data release from SDSS-IV, Data Release 13 (DR13), which contains new data, reanalysis of existing data sets and, like all SDSS data releases, is inclusive of previously released data. DR13 makes publicly available 1390 spatially resolved integral field unit observations of nearby galaxies from MaNGA, the first data released from this survey. It includes new observations from eBOSS, completing SEQUELS. In addition to targeting galaxies and quasars, SEQUELS also targeted variability-selected objects from TDSS and X-ray selected objects from SPIDERS. DR13 includes new reductions of the SDSS-III BOSS data, improving the spectrophotometric calibration and redshift classification. DR13 releases new reductions of the APOGEE-1 data from SDSS-III, with abundances of elements not previously included and improved stellar parameters for dwarf stars and cooler stars. For the SDSS imaging data, DR13 provides new, more robust and precise photometric calibrations. Several value-added catalogs are being released in tandem with DR13, in particular target catalogs relevant for eBOSS, TDSS, and SPIDERS, and an updated red-clump catalog for APOGEE. This paper describes the location and format of the data now publicly available, as well as providing references to the important technical papers that describe the targeting, observing, and data reduction. The SDSS website, http://www.sdss.org, provides links to the data, tutorials and examples of data access, and extensive documentation of the reduction and analysis procedures. DR13 is the first of a scheduled set that will contain new data and analyses from the planned ~6-year operations of SDSS-IV. △ Less",
      "url": "https://arxiv.org/abs/1608.02013"
    },
    {
      "title": "Very Long Baseline Interferometry with the SKA",
      "abstract": "Adding VLBI capability to the SKA arrays will greatly broaden the science of the SKA, and is feasible within the current specifications. SKA-VLBI can be initially implemented by providing phased-array outputs for SKA1-MID and SKA1-SUR and using these extremely sensitive stations with other radio telescopes, and in SKA2 by realising a distributed configuration providing baselines up to thousands of km, merging it with existing VLBI networks. The motivation for and the possible realization of SKA-VLBI is described in this paper. △ Less",
      "url": "https://arxiv.org/abs/1412.5971"
    }
  ]
}