{
  "author": "Ken Brown",
  "results": [
    {
      "title": "XRISM/Resolve View of Abell 2319: Turbulence, Sloshing, and ICM Dynamics",
      "abstract": "We present results from XRISM/Resolve observations of the core of the galaxy cluster Abell 2319, focusing on its kinematic properties. The intracluster medium (ICM) exhibits temperatures of approximately 8 keV across the core, with a prominent cold front and a high-temperature region ($\\sim$11 keV) in the northwest. The average gas velocity in the 3 arcmin $\\times$ 4 arcmin region around the brightest cluster galaxy (BCG) covered by two Resolve pointings is consistent with that of the BCG to within 40 km s$^{-1}$ and we found modest average velocity dispersion of 230-250 km s$^{-1}$. On the other hand, spatially-resolved spectroscopy reveals interesting variations. A blueshift of up to $\\sim$230 km s$^{-1}$ is observed around the east edge of the cold front, where the gas with the lowest specific entropy is found. The region further south inside the cold front shows only a small velocity difference from the BCG; however, its velocity dispersion is enhanced to 400 km s$^{-1}$, implying the development of turbulence. These characteristics indicate that we are observing sloshing motion with some inclination angle following BCG and that gas phases with different specific entropy participate in sloshing with their own velocities, as expected from simulations. No significant evidence for a high-redshift ICM component associated with the subcluster Abell 2319B was found in the region covered by the current Resolve pointings. These results highlight the importance of sloshing and turbulence in shaping the internal structure of Abell 2319. Further deep observations are necessary to better understand the mixing and turbulent processes within the cluster. △ Less",
      "url": "https://arxiv.org/abs/2508.05067"
    },
    {
      "title": "Pointed Hopf algebras, the Dixmier-Moeglin Equivalence and Noetherian group algebras",
      "abstract": "This paper addresses the interactions between three properties that a group algebra or more generally a pointed Hopf algebra may possess: being noetherian, having finite Gelfand-Kirillov dimension, and satisfying the Dixmier-Moeglin equivalence. First it is shown that the second and third of these properties are equivalent for group algebras $kG$ of polycyclic-by-finite groups, and are, in turn, equivalent to $G$ being nilpotent-by-finite. In characteristic 0, this enables us to extend this equivalence to certain cocommutative Hopf algebras. In the second and third parts of the paper finiteness conditions for group algebras are studied. In the second section we examine when a group algebra satisfies the Goldie conditions, while in the final section we discuss what can be said about a minimal counterexample to the conjecture that if $kG$ is noetherian then G is polycyclic-by-finite. △ Less",
      "url": "https://arxiv.org/abs/2507.23730"
    },
    {
      "title": "Double-offset Cassegrain telescopes for the Ultraviolet Type Ia (UVIa) mission concept",
      "abstract": "Our understanding of cosmology is shaped by Type Ia supernovae (SNe Ia), the runaway thermonuclear detonations of white dwarfs via accretion from a companion star. The nature of this companion star is highly debated, with disparate models explaining currently available SNe Ia data. Critical ultraviolet (UV) signatures of SNe Ia progenitors are only observable within the first few days post-detonation. We present the instrument design of UVIa, a proposed SmallSat to make early UV observations of SNe Ia. UVIa conducts simultaneous observations in three photometric channels: far-UV (1500 - 1800 Å), near-UV (1800 - 2400 Å), and Sloan $u$-band (3000 - 4200 Å). UVIa employs two 80 mm double-offset Cassegrain UV telescopes and a similar 50 mm $u$-band telescope, imaging onto three Teledyne e2v CIS120-10-LN CMOS detectors. The UV detectors are delta-doped for enhanced sensitivity, with custom metal-dielectric filters providing further in-band efficiency and red light rejection. The UV optics utilize multi-layer coatings, defining the UV bandpasses and providing additional red light rejection. The instrument design achieves high UV sensitivity (21.5 mag AB) and superior red light rejection ($<$ 10$^{-5}$ throughput), allowing UVIa to make early observations of SNe Ia while serving as a pathfinder for future UV transient telescopes. △ Less",
      "url": "https://arxiv.org/abs/2507.16006"
    },
    {
      "title": "Gemini 2.5: Pushing the Frontier with Advanced Reasoning, Multimodality, Long Context, and Next Generation Agentic Capabilities",
      "abstract": "In this report, we introduce the Gemini 2.X model family: Gemini 2.5 Pro and Gemini 2.5 Flash, as well as our earlier Gemini 2.0 Flash and Flash-Lite models. Gemini 2.5 Pro is our most capable model yet, achieving SoTA performance on frontier coding and reasoning benchmarks. In addition to its incredible coding and reasoning skills, Gemini 2.5 Pro is a thinking model that excels at multimodal understanding and it is now able to process up to 3 hours of video content. Its unique combination of long context, multimodal and reasoning capabilities can be combined to unlock new agentic workflows. Gemini 2.5 Flash provides excellent reasoning abilities at a fraction of the compute and latency requirements and Gemini 2.0 Flash and Flash-Lite provide high performance at low latency and cost. Taken together, the Gemini 2.X model generation spans the full Pareto frontier of model capability vs cost, allowing users to explore the boundaries of what is possible with complex agentic problem solving. △ Less",
      "url": "https://arxiv.org/abs/2507.06261"
    },
    {
      "title": "Constraining gas motion and non-thermal pressure beyond the core of the Abell 2029 galaxy cluster with XRISM",
      "abstract": "We report a detailed spectroscopic study of the gas dynamics and hydrostatic mass bias of the galaxy cluster Abell 2029, utilizing high-resolution observations from XRISM Resolve. Abell 2029, known for its cool core and relaxed X-ray morphology, provides an excellent opportunity to investigate the influence of gas motions beyond the central region. Expanding upon prior studies that revealed low turbulence and bulk motions within the core, our analysis covers regions out to the scale radius $R_{2500}$ (670~kpc) based on three radial pointings extending from the cluster center toward the northern side. We obtain accurate measurements of bulk and turbulent velocities along the line of sight. The results indicate that non-thermal pressure accounts for no more than 2% of the total pressure at all radii, with a gradual decrease outward. The observed radial trend differs from many numerical simulations, which often predict an increase in non-thermal pressure fraction at larger radii. These findings suggest that deviations from hydrostatic equilibrium are small, leading to a hydrostatic mass bias of around 2% across the observed area. △ Less",
      "url": "https://arxiv.org/abs/2505.06533"
    },
    {
      "title": "Development of Reduced Feeder and Load Models Using Practical Topological and Loading Data",
      "abstract": "Distribution feeder and load model reduction methods are essential for maintaining a good tradeoff between accurate representation of grid behavior and reduced computational complexity in power system studies. An effective algorithm to obtain a reduced order representation of the practical feeders using utility topological and loading data has been presented in this paper. Simulations conducted in this work show that the reduced feeder and load model of a utility feeder, obtained using the proposed method, can accurately capture contactor and motor stalling behaviors for critical events such as fault induced delayed voltage recovery. △ Less",
      "url": "https://arxiv.org/abs/2505.06439"
    },
    {
      "title": "XRISM forecast for the Coma cluster: stormy, with a steep power spectrum",
      "abstract": "The XRISM Resolve microcalorimeter array measured the velocities of hot intracluster gas at two positions in the Coma galaxy cluster: 3'x3' squares at the center and at 6' (170 kpc) to the south. We find the line-of-sight velocity dispersions in those regions to be sigma_z=208+-12 km/s and 202+-24 km/s, respectively. The central value corresponds to a 3D Mach number of M=0.24+-0.015 and the ratio of the kinetic pressure of small-scale motions to thermal pressure in the intracluster plasma of only 3.1+-0.4%, at the lower end of predictions from cosmological simulations for merging clusters like Coma, and similar to that observed in the cool core of the relaxed cluster A2029. Meanwhile, the gas in both regions exhibits high line-of-sight velocity differences from the mean velocity of the cluster galaxies, Delta v_z=450+-15 km/s and 730+-30 km/s, respectively. A small contribution from an additional gas velocity component, consistent with the cluster optical mean, is detected along a sightline near the cluster center. The combination of the observed velocity dispersions and bulk velocities is not described by a Kolmogorov velocity power spectrum of steady-state turbulence; instead, the data imply a much steeper effective slope (i.e., relatively more power at larger linear scales). This may indicate either a very large dissipation scale resulting in the suppression of small-scale motions, or a transient dynamic state of the cluster, where large-scale gas flows generated by an ongoing merger have not yet cascaded down to small scales. △ Less",
      "url": "https://arxiv.org/abs/2504.20928"
    },
    {
      "title": "Intent Tagging: Exploring Micro-Prompting Interactions for Supporting Granular Human-GenAI Co-Creation Workflows",
      "abstract": "Despite Generative AI (GenAI) systems' potential for enhancing content creation, users often struggle to effectively integrate GenAI into their creative workflows. Core challenges include misalignment of AI-generated content with user intentions (intent elicitation and alignment), user uncertainty around how to best communicate their intents to the AI system (prompt formulation), and insufficient flexibility of AI systems to support diverse creative workflows (workflow flexibility). Motivated by these challenges, we created IntentTagger: a system for slide creation based on the notion of Intent Tags - small, atomic conceptual units that encapsulate user intent - for exploring granular and non-linear micro-prompting interactions for Human-GenAI co-creation workflows. Our user study with 12 participants provides insights into the value of flexibly expressing intent across varying levels of ambiguity, meta-intent elicitation, and the benefits and challenges of intent tag-driven workflows. We conclude by discussing the broader implications of our findings and design considerations for GenAI-supported content creation workflows. △ Less",
      "url": "https://arxiv.org/abs/2502.18737"
    },
    {
      "title": "AI-Instruments: Embodying Prompts as Instruments to Abstract & Reflect Graphical Interface Commands as General-Purpose Tools",
      "abstract": "Chat-based prompts respond with verbose linear-sequential texts, making it difficult to explore and refine ambiguous intents, back up and reinterpret, or shift directions in creative AI-assisted design work. AI-Instruments instead embody \"prompts\" as interface objects via three key principles: (1) Reification of user-intent as reusable direct-manipulation instruments; (2) Reflection of multiple interpretations of ambiguous user-intents (Reflection-in-intent) as well as the range of AI-model responses (Reflection-in-response) to inform design \"moves\" towards a desired result; and (3) Grounding to instantiate an instrument from an example, result, or extrapolation directly from another instrument. Further, AI-Instruments leverage LLM's to suggest, vary, and refine new instruments, enabling a system that goes beyond hard-coded functionality by generating its own instrumental controls from content. We demonstrate four technology probes, applied to image generation, and qualitative insights from twelve participants, showing how AI-Instruments address challenges of intent formulation, steering via direct manipulation, and non-linear iterative workflows to reflect and resolve ambiguous intents. △ Less",
      "url": "https://arxiv.org/abs/2502.18736"
    },
    {
      "title": "Roadmap to fault tolerant quantum computation using topological qubit arrays",
      "abstract": "We describe a concrete device roadmap towards a fault-tolerant quantum computing architecture based on noise-resilient, topologically protected Majorana-based qubits. Our roadmap encompasses four generations of devices: a single-qubit device that enables a measurement-based qubit benchmarking protocol; a two-qubit device that uses measurement-based braiding to perform single-qubit Clifford operations; an eight-qubit device that can be used to show an improvement of a two-qubit operation when performed on logical qubits rather than directly on physical qubits; and a topological qubit array supporting lattice surgery demonstrations on two logical qubits. Devices that enable this path require a superconductor-semiconductor heterostructure that supports a topological phase, quantum dots and coupling between those quantum dots that can create the appropriate loops for interferometric measurements, and a microwave readout system that can perform fast, low-error single-shot measurements. We describe the key design components of these qubit devices, along with the associated protocols for demonstrations of single-qubit benchmarking, Clifford gate execution, quantum error detection, and quantum error correction, which differ greatly from those in more conventional qubits. Finally, we comment on implications and advantages of this architecture for utility-scale quantum computation. △ Less",
      "url": "https://arxiv.org/abs/2502.12252"
    },
    {
      "title": "The Ultraviolet Type Ia Supernova CubeSat (UVIa): Science Motivation & Mission Concept",
      "abstract": "The Ultraviolet (UV) Type Ia Supernova CubeSat (UVIa) is a CubeSat/SmallSat mission concept that stands to test critical space-borne UV technology for future missions like the Habitable Worlds Observatory (HWO) while elucidating long-standing questions about the explosion mechanisms of Type Ia supernovae (SNe Ia). UVIa will observe whether any SNe Ia emit excess UV light shortly after explosion to test progenitor/explosion models and provide follow-up over many days to characterize their UV and optical flux variations over time, assembling a comprehensive multi-band UV and optical low-redshift anchor sample for upcoming high-redshift SNe Ia surveys (e.g., Euclid, Vera Rubin Observatory, Nancy Roman Space Telescope). UVIa's mission profile requires it to perform rapid and frequent visits to newly discovered SNe Ia, simultaneously observing each SNe Ia in two UV bands (FUV: 1500-1800A and NUV: 1800-2400A) and one optical band (u-band: 3000-4200A). In this study, we describe the UVIa mission concept science motivation, mission design, and key technology development. △ Less",
      "url": "https://arxiv.org/abs/2502.11957"
    },
    {
      "title": "The Simons Observatory: Validation of reconstructed power spectra from simulated filtered maps for the Small Aperture Telescope survey",
      "abstract": "We present a transfer function-based method to estimate angular power spectra from filtered maps for cosmic microwave background (CMB) surveys. This is especially relevant for experiments targeting the faint primordial gravitational wave signatures in CMB polarisation at large scales, such as the Simons Observatory (SO) small aperture telescopes. While timestreams can be filtered to mitigate the contamination from low-frequency noise, usual methods that calculate the mode coupling at individual multipoles can be challenging for experiments covering large sky areas or reaching few-arcminute resolution. The method we present here, although approximate, is more practical and faster for larger data volumes. We validate it through the use of simulated observations approximating the first year of SO data, going from half-wave plate-modulated timestreams to maps, and using simulations to estimate the mixing of polarisation modes induced by an example of time-domain filtering. We show its performance through an example null test and with an end-to-end pipeline that performs inference on cosmological parameters, including the tensor-to-scalar ratio $r$. The performance demonstration uses simulated observations at multiple frequency bands. We find that the method can recover unbiased parameters for our simulated noise levels. △ Less",
      "url": "https://arxiv.org/abs/2502.00946"
    },
    {
      "title": "A gravitational wave detectable candidate Type Ia supernova progenitor",
      "abstract": "Type Ia supernovae, critical for studying cosmic expansion, arise from thermonuclear explosions of white dwarfs, but their precise progenitor pathways remain unclear. Growing evidence supports the ``double-degenerate'' scenario, where two white dwarfs interact. The absence of other companion types capable of explaining the observed Ia rate, along with observations of hyper-velocity white dwarfs interpreted as surviving companions of such systems provide compelling evidence in favor of this scenario. Upcoming millihertz gravitational wave observatories like the Laser Interferometer Space Antenna (LISA) are expected to detect thousands of double-degenerate systems, though the most compact known candidate Ia progenitors produce only marginally detectable gravitational wave signals. Here, we report observations of ATLAS J1138-5139, a binary white dwarf system with an orbital period of 28 minutes. Our analysis reveals a 1 solar mass carbon-oxygen white dwarf accreting from a helium-core white dwarf. Given its mass, the accreting carbon-oxygen white dwarf is poised to trigger a typical-luminosity Type Ia supernova within a few million years, or to evolve into a stably mass-transferring AM CVn system. ATLAS J1138-5139 provides a rare opportunity to calibrate binary evolution models by directly comparing observed orbital parameters and mass transfer rates closer to merger than any previously identified candidate Type Ia progenitor. Its compact orbit ensures detectability by LISA, demonstrating the potential of millihertz gravitational wave observatories to reveal a population of Type Ia progenitors on a Galactic scale, paving the way for multi-messenger studies offering insights into the origins of these cosmologically significant explosions. △ Less",
      "url": "https://arxiv.org/abs/2411.19916"
    },
    {
      "title": "Twisted unipotent groups",
      "abstract": "We study the algebraic structure and representation theory of the Hopf algebras ${}_J\\mathcal{O}(G)_J$ when $G$ is an affine algebraic unipotent group over $\\mathbb{C}$ with $\\mathrm{dim}(G) = n$ and $J$ is a Hopf $2$-cocycle for $G$. The cotriangular Hopf algebras ${}_J\\mathcal{O}(G)_J$ have the same coalgebra structure as $\\mathcal{O}(G)$ but a deformed multiplication. We show that they are involutive $n$-step iterated Hopf Ore extensions of derivation type. The 2-cocycle $J$ has as support a closed subgroup $T$ of $G$, and ${}_J\\mathcal{O}(G)_J$ is a crossed product $S \\#_σU(\\mathfrak{t})$, where $\\mathfrak{t}$ is the Lie algebra of $T$ and $S$ is a deformed coideal subalgebra. The simple ${}_J\\mathcal{O}(G)_J$-modules are stratified by a family of factor algebras ${}_J\\mathcal{O}(Z_g)_J$, parametrised by the double cosets $TgT$ of $T$ in $G$. The finite dimensional simple ${}_J\\mathcal{O}(G)_J$-modules are all 1-dimensional, so form a group $Γ$, which we prove to be an explicitly determined closed subgroup of $G$. A selection of examples illustrate our results. △ Less",
      "url": "https://arxiv.org/abs/2407.07005"
    },
    {
      "title": "The PLATO Mission",
      "abstract": "PLATO (PLAnetary Transits and Oscillations of stars) is ESA's M3 mission designed to detect and characterise extrasolar planets and perform asteroseismic monitoring of a large number of stars. PLATO will detect small planets (down to <2 R_(Earth)) around bright stars (<11 mag), including terrestrial planets in the habitable zone of solar-like stars. With the complement of radial velocity observations from the ground, planets will be characterised for their radius, mass, and age with high accuracy (5 %, 10 %, 10 % for an Earth-Sun combination respectively). PLATO will provide us with a large-scale catalogue of well-characterised small planets up to intermediate orbital periods, relevant for a meaningful comparison to planet formation theories and to better understand planet evolution. It will make possible comparative exoplanetology to place our Solar System planets in a broader context. In parallel, PLATO will study (host) stars using asteroseismology, allowing us to determine the stellar properties with high accuracy, substantially enhancing our knowledge of stellar structure and evolution. The payload instrument consists of 26 cameras with 12cm aperture each. For at least four years, the mission will perform high-precision photometric measurements. Here we review the science objectives, present PLATO's target samples and fields, provide an overview of expected core science performance as well as a description of the instrument and the mission profile at the beginning of the serial production of the flight cameras. PLATO is scheduled for a launch date end 2026. This overview therefore provides a summary of the mission to the community in preparation of the upcoming operational phases. △ Less",
      "url": "https://arxiv.org/abs/2406.05447"
    },
    {
      "title": "On the bosonization of the enveloping algebra of a finite dimensional Lie superalgebra",
      "abstract": "We exhibit a PI Hopf algebra that is not a finite module over its center. We survey some ring-theoretical properties of the bosonizations of enveloping algebras of Lie superalgebras. △ Less",
      "url": "https://arxiv.org/abs/2404.18641"
    },
    {
      "title": "The NANOGrav 15 yr Data Set: Looking for Signs of Discreteness in the Gravitational-wave Background",
      "abstract": "The cosmic merger history of supermassive black hole binaries (SMBHBs) is expected to produce a low-frequency gravitational wave background (GWB). Here we investigate how signs of the discrete nature of this GWB can manifest in pulsar timing arrays through excursions from, and breaks in, the expected $f_{\\mathrm{GW}}^{-2/3}$ power-law of the GWB strain spectrum. To do this, we create a semi-analytic SMBHB population model, fit to NANOGrav's 15 yr GWB amplitude, and with 1,000 realizations we study the populations' characteristic strain and residual spectra. Comparing our models to the NANOGrav 15 yr spectrum, we find two interesting excursions from the power-law. The first, at $2 \\; \\mathrm{nHz}$, is below our GWB realizations with $p$-value significance $p = 0.05$ to $0.06$ ($\\approx 1.8 σ- 1.9 σ$). The second, at $16 \\; \\mathrm{nHz}$, is above our GWB realizations with $p = 0.04$ to $0.15$ ($\\approx 1.4 σ- 2.1 σ$). We explore the properties of a loud SMBHB which could cause such an excursion. Our simulations also show that the expected number of SMBHBs decreases by three orders of magnitude, from $\\sim 10^6$ to $\\sim 10^3$, between $2\\; \\mathrm{nHz}$ and $20 \\; \\mathrm{nHz}$. This causes a break in the strain spectrum as the stochasticity of the background breaks down at $26^{+28}_{-19} \\; \\mathrm{nHz}$, consistent with predictions pre-dating GWB measurements. The diminished GWB signal from SMBHBs at frequencies above the $26~\\mathrm{nHz}$ break opens a window for PTAs to detect continuous GWs from individual SMBHBs or GWs from the early universe. △ Less",
      "url": "https://arxiv.org/abs/2404.07020"
    },
    {
      "title": "Property $(\\diamond)$ for Ore extensions of small Krull dimension",
      "abstract": "This paper is a continuation of a project to determine which skew polynomial algebras $S = R[θ; α]$ satisfy property $(\\diamond)$, namely that the injective hull of every simple $S$-module is locally artinian, where $k$ is a field, $R$ is a commutative noetherian $k$-algebra, and $α$ is a $k$-algebra automorphism of $R$. Earlier work (which we review) and further analysis done here leads us to focus on the case where $S$ is a primitive domain and $R$ has Krull dimension 1 and contains an uncountable field. Then we show first that if $|\\mathrm{Spec}(R)|$ is infinite then $S$ does not satisfy $(\\diamond)$. Secondly we show that when $R = k[X]_{<X>}$ and $α(X) = qX$ where $q \\in k \\setminus \\{0\\}$ is not a root of unity then $S$ does not satisfy $(\\diamond)$. This is in complete contrast to our earlier result that, when $R = k[[X]]$ and $α$ is an arbitrary $k$-algebra automorphism of infinite order, $S$ satisfies $(\\diamond)$. A number of open questions are stated. △ Less",
      "url": "https://arxiv.org/abs/2403.09239"
    },
    {
      "title": "Gemini 1.5: Unlocking multimodal understanding across millions of tokens of context",
      "abstract": "In this report, we introduce the Gemini 1.5 family of models, representing the next generation of highly compute-efficient multimodal models capable of recalling and reasoning over fine-grained information from millions of tokens of context, including multiple long documents and hours of video and audio. The family includes two new models: (1) an updated Gemini 1.5 Pro, which exceeds the February version on the great majority of capabilities and benchmarks; (2) Gemini 1.5 Flash, a more lightweight variant designed for efficiency with minimal regression in quality. Gemini 1.5 models achieve near-perfect recall on long-context retrieval tasks across modalities, improve the state-of-the-art in long-document QA, long-video QA and long-context ASR, and match or surpass Gemini 1.0 Ultra's state-of-the-art performance across a broad set of benchmarks. Studying the limits of Gemini 1.5's long-context ability, we find continued improvement in next-token prediction and near-perfect retrieval (>99%) up to at least 10M tokens, a generational leap over existing models such as Claude 3.0 (200k) and GPT-4 Turbo (128k). Finally, we highlight real-world use cases, such as Gemini 1.5 collaborating with professionals on completing their tasks achieving 26 to 75% time savings across 10 different job categories, as well as surprising new capabilities of large language models at the frontier; when given a grammar manual for Kalamang, a language with fewer than 200 speakers worldwide, the model learns to translate English to Kalamang at a similar level to a person who learned from the same content. △ Less",
      "url": "https://arxiv.org/abs/2403.05530"
    },
    {
      "title": "Gemini: A Family of Highly Capable Multimodal Models",
      "abstract": "This report introduces a new family of multimodal models, Gemini, that exhibit remarkable capabilities across image, audio, video, and text understanding. The Gemini family consists of Ultra, Pro, and Nano sizes, suitable for applications ranging from complex reasoning tasks to on-device memory-constrained use-cases. Evaluation on a broad range of benchmarks shows that our most-capable Gemini Ultra model advances the state of the art in 30 of 32 of these benchmarks - notably being the first model to achieve human-expert performance on the well-studied exam benchmark MMLU, and improving the state of the art in every one of the 20 multimodal benchmarks we examined. We believe that the new capabilities of the Gemini family in cross-modal reasoning and language understanding will enable a wide variety of use cases. We discuss our approach toward post-training and deploying Gemini models responsibly to users through services including Gemini, Gemini Advanced, Google AI Studio, and Cloud Vertex AI. △ Less",
      "url": "https://arxiv.org/abs/2312.11805"
    },
    {
      "title": "Towards Establishing Systematic Classification Requirements for Automated Driving",
      "abstract": "Despite the presence of the classification task in many different benchmark datasets for perception in the automotive domain, few efforts have been undertaken to define consistent classification requirements. This work addresses the topic by proposing a structured method to generate a classification structure. First, legal categories are identified based on behavioral requirements for the vehicle. This structure is further substantiated by considering the two aspects of collision safety for objects as well as perceptual categories. A classification hierarchy is obtained by applying the method to an exemplary legal text. A comparison of the results with benchmark dataset categories shows limited agreement. This indicates the necessity for explicit consideration of legal requirements regarding perception. △ Less",
      "url": "https://arxiv.org/abs/2307.14058"
    },
    {
      "title": "The prime spectrum of the Drinfeld double of the Jordan plane",
      "abstract": "The Hopf algebra $\\mathcal{D}$ which is the subject of this paper can be viewed as a Drinfeld double of the bosonisation of the Jordan plane. Its prime and primitive spectra are completely determined. As a corollary of this analysis it is shown that $\\mathcal{D}$ satisfies the Dixmier-Moeglin Equivalence, leading to the formulation of a conjecture on the validity of this equivalence for pointed Noetherian Hopf algebras. △ Less",
      "url": "https://arxiv.org/abs/2301.04428"
    },
    {
      "title": "The James Webb Space Telescope Mission: Optical Telescope Element Design, Development, and Performance",
      "abstract": "The James Webb Space Telescope (JWST) is a large, infrared space telescope that has recently started its science program which will enable breakthroughs in astrophysics and planetary science. Notably, JWST will provide the very first observations of the earliest luminous objects in the Universe and start a new era of exoplanet atmospheric characterization. This transformative science is enabled by a 6.6 m telescope that is passively cooled with a 5-layer sunshield. The primary mirror is comprised of 18 controllable, low areal density hexagonal segments, that were aligned and phased relative to each other in orbit using innovative image-based wavefront sensing and control algorithms. This revolutionary telescope took more than two decades to develop with a widely distributed team across engineering disciplines. We present an overview of the telescope requirements, architecture, development, superb on-orbit performance, and lessons learned. JWST successfully demonstrates a segmented aperture space telescope and establishes a path to building even larger space telescopes. △ Less",
      "url": "https://arxiv.org/abs/2301.01779"
    },
    {
      "title": "Monte Carlo Augmented Actor-Critic for Sparse Reward Deep Reinforcement Learning from Suboptimal Demonstrations",
      "abstract": "Providing densely shaped reward functions for RL algorithms is often exceedingly challenging, motivating the development of RL algorithms that can learn from easier-to-specify sparse reward functions. This sparsity poses new exploration challenges. One common way to address this problem is using demonstrations to provide initial signal about regions of the state space with high rewards. However, prior RL from demonstrations algorithms introduce significant complexity and many hyperparameters, making them hard to implement and tune. We introduce Monte Carlo Augmented Actor Critic (MCAC), a parameter free modification to standard actor-critic algorithms which initializes the replay buffer with demonstrations and computes a modified $Q$-value by taking the maximum of the standard temporal distance (TD) target and a Monte Carlo estimate of the reward-to-go. This encourages exploration in the neighborhood of high-performing trajectories by encouraging high $Q$-values in corresponding regions of the state space. Experiments across $5$ continuous control domains suggest that MCAC can be used to significantly increase learning efficiency across $6$ commonly used RL and RL-from-demonstrations algorithms. See https://sites.google.com/view/mcac-rl for code and supplementary material. △ Less",
      "url": "https://arxiv.org/abs/2210.07432"
    },
    {
      "title": "Learning Switching Criteria for Sim2Real Transfer of Robotic Fabric Manipulation Policies",
      "abstract": "Simulation-to-reality transfer has emerged as a popular and highly successful method to train robotic control policies for a wide variety of tasks. However, it is often challenging to determine when policies trained in simulation are ready to be transferred to the physical world. Deploying policies that have been trained with very little simulation data can result in unreliable and dangerous behaviors on physical hardware. On the other hand, excessive training in simulation can cause policies to overfit to the visual appearance and dynamics of the simulator. In this work, we study strategies to automatically determine when policies trained in simulation can be reliably transferred to a physical robot. We specifically study these ideas in the context of robotic fabric manipulation, in which successful sim2real transfer is especially challenging due to the difficulties of precisely modeling the dynamics and visual appearance of fabric. Results in a fabric smoothing task suggest that our switching criteria correlate well with performance in real. In particular, our confidence-based switching criteria achieve average final fabric coverage of 87.2-93.7% within 55-60% of the total training budget. See https://tinyurl.com/lsc-case for code and supplemental materials. △ Less",
      "url": "https://arxiv.org/abs/2207.00911"
    },
    {
      "title": "Critical and injective modules over skew polynomial rings",
      "abstract": "Let $R$ be a commutative local $k$-algebra of Krull dimension one, where $k$ is a field. Let $α$ be a $k$-algebra automorphism of $R$, and define $S$ to be the skew polynomial algebra $R[θ; α]$. We offer, under some additional assumptions on $R$, a criterion for $S$ to have injective hulls of all simple $S$-modules locally Artinian - that is, for $S$ to satisfy property $(\\diamond)$. It is easy and well known that if $α$ is of finite order, then $S$ has this property, but in order to get the criterion when $α$ has infinite order we found it necessary to classify all cyclic (Krull) critical $S$-modules in this case, a result which may be of independent interest. With the help of the above we show that $\\hat{S}=k[[X]][θ, α]$ satisfies $(\\diamond)$ for all $k$-algebra automorphisms $α$ of $k[[X]]$. △ Less",
      "url": "https://arxiv.org/abs/2206.10872"
    },
    {
      "title": "On noncommutative bounded factorization domains and prime rings",
      "abstract": "A ring has bounded factorizations if every cancellative nonunit $a \\in R$ can be written as a product of atoms and there is a bound $λ(a)$ on the lengths of such factorizations. The bounded factorization property is one of the most basic finiteness properties in the study of non-unique factorizations. Every commutative noetherian domain has bounded factorizations, but it is open whether such a result holds in the noncommutative setting. We provide sufficient conditions for a noncommutative noetherian prime ring to have bounded factorizations. Moreover, we construct a (noncommutative) finitely presented semigroup algebra that is an atomic domain but does not satisfy the ascending chain condition on principal right or left ideals (ACCP), whence it does not have bounded factorizations. △ Less",
      "url": "https://arxiv.org/abs/2206.10115"
    },
    {
      "title": "Snowmass 2021 CMB-S4 White Paper",
      "abstract": "This Snowmass 2021 White Paper describes the Cosmic Microwave Background Stage 4 project CMB-S4, which is designed to cross critical thresholds in our understanding of the origin and evolution of the Universe, from the highest energies at the dawn of time through the growth of structure to the present day. We provide an overview of the science case, the technical design, and project plan. △ Less",
      "url": "https://arxiv.org/abs/2203.08024"
    },
    {
      "title": "The Pantheon+ Analysis: Cosmological Constraints",
      "abstract": "We present constraints on cosmological parameters from the Pantheon+ analysis of 1701 light curves of 1550 distinct Type Ia supernovae (SNe Ia) ranging in redshift from $z=0.001$ to 2.26. This work features an increased sample size, increased redshift span, and improved treatment of systematic uncertainties in comparison to the original Pantheon analysis and results in a factor of two improvement in cosmological constraining power. For a Flat$Λ$CDM model, we find $Ω_M=0.334\\pm0.018$ from SNe Ia alone. For a Flat$w_0$CDM model, we measure $w_0=-0.90\\pm0.14$ from SNe Ia alone, H$_0=73.5\\pm1.1$ km s$^{-1}$ Mpc$^{-1}$ when including the Cepheid host distances and covariance (SH0ES), and $w_0=-0.978^{+0.024}_{-0.031}$ when combining the SN likelihood with constraints from the cosmic microwave background (CMB) and baryon acoustic oscillations (BAO); both $w_0$ values are consistent with a cosmological constant. We also present the most precise measurements to date on the evolution of dark energy in a Flat$w_0w_a$CDM universe, and measure $w_a=-0.1^{+0.9}_{-2.0}$ from Pantheon+ alone, H$_0=73.3\\pm1.1$ km s$^{-1}$ Mpc$^{-1}$ when including SH0ES, and $w_a=-0.65^{+0.28}_{-0.32}$ when combining Pantheon+ with CMB and BAO data. Finally, we find that systematic uncertainties in the use of SNe Ia along the distance ladder comprise less than one third of the total uncertainty in the measurement of H$_0$ and cannot explain the present \"Hubble tension\" between local measurements and early-Universe predictions from the cosmological model. △ Less",
      "url": "https://arxiv.org/abs/2202.04077"
    },
    {
      "title": "The Pantheon+ Analysis: The Full Dataset and Light-Curve Release",
      "abstract": "Here we present 1701 light curves of 1550 spectroscopically confirmed Type Ia supernovae (SNe Ia) that will be used to infer cosmological parameters as part of the Pantheon+ SN analysis and the SH0ES (Supernovae and H0 for the Equation of State of dark energy) distance-ladder analysis. This effort is one part of a series of works that perform an extensive review of redshifts, peculiar velocities, photometric calibration, and intrinsic-scatter models of SNe Ia. The total number of light curves, which are compiled across 18 different surveys, is a significant increase from the first Pantheon analysis (1048 SNe), particularly at low redshift ($z$). Furthermore, unlike in the Pantheon analysis, we include light curves for SNe with $z<0.01$ such that SN systematic covariance can be included in a joint measurement of the Hubble constant (H$_0$) and the dark energy equation-of-state parameter ($w$). We use the large sample to compare properties of 151 SNe Ia observed by multiple surveys and 12 pairs/triplets of \"SN siblings\" - SNe found in the same host galaxy. Distance measurements, application of bias corrections, and inference of cosmological parameters are discussed in the companion paper by Brout et al. (2022b), and the determination of H$_0$ is discussed by Riess et al. (2022). These analyses will measure w with $\\sim3\\%$ precision and H$_0$ with 1 km/s/Mpc precision. △ Less",
      "url": "https://arxiv.org/abs/2112.03863"
    },
    {
      "title": "Adversarial Attacks against a Satellite-borne Multispectral Cloud Detector",
      "abstract": "Data collected by Earth-observing (EO) satellites are often afflicted by cloud cover. Detecting the presence of clouds -- which is increasingly done using deep learning -- is crucial preprocessing in EO applications. In fact, advanced EO satellites perform deep learning-based cloud detection on board the satellites and downlink only clear-sky data to save precious bandwidth. In this paper, we highlight the vulnerability of deep learning-based cloud detection towards adversarial attacks. By optimising an adversarial pattern and superimposing it into a cloudless scene, we bias the neural network into detecting clouds in the scene. Since the input spectra of cloud detectors include the non-visible bands, we generated our attacks in the multispectral domain. This opens up the potential of multi-objective attacks, specifically, adversarial biasing in the cloud-sensitive bands and visual camouflage in the visible bands. We also investigated mitigation strategies against the adversarial attacks. We hope our work further builds awareness of the potential of adversarial attacks in the EO community. △ Less",
      "url": "https://arxiv.org/abs/2112.01723"
    },
    {
      "title": "LEGS: Learning Efficient Grasp Sets for Exploratory Grasping",
      "abstract": "While deep learning has enabled significant progress in designing general purpose robot grasping systems, there remain objects which still pose challenges for these systems. Recent work on Exploratory Grasping has formalized the problem of systematically exploring grasps on these adversarial objects and explored a multi-armed bandit model for identifying high-quality grasps on each object stable pose. However, these systems are still limited to exploring a small number or grasps on each object. We present Learned Efficient Grasp Sets (LEGS), an algorithm that efficiently explores thousands of possible grasps by maintaining small active sets of promising grasps and determining when it can stop exploring the object with high confidence. Experiments suggest that LEGS can identify a high-quality grasp more efficiently than prior algorithms which do not use active sets. In simulation experiments, we measure the gap between the success probability of the best grasp identified by LEGS, baselines, and the most-robust grasp (verified ground truth). After 3000 exploration steps, LEGS outperforms baseline algorithms on 10/14 and 25/39 objects on the Dex-Net Adversarial and EGAD! datasets respectively. We then evaluate LEGS in physical experiments; trials on 3 challenging objects suggest that LEGS converges to high-performing grasps significantly faster than baselines. See https://sites.google.com/view/legs-exp-grasping for supplemental material and videos. △ Less",
      "url": "https://arxiv.org/abs/2111.15002"
    },
    {
      "title": "Learning from learning machines: a new generation of AI technology to meet the needs of science",
      "abstract": "We outline emerging opportunities and challenges to enhance the utility of AI for scientific discovery. The distinct goals of AI for industry versus the goals of AI for science create tension between identifying patterns in data versus discovering patterns in the world from data. If we address the fundamental challenges associated with \"bridging the gap\" between domain-driven scientific models and data-driven AI learning machines, then we expect that these AI models can transform hypothesis generation, scientific discovery, and the scientific process itself. △ Less",
      "url": "https://arxiv.org/abs/2111.13786"
    },
    {
      "title": "A Horizon Study for Cosmic Explorer: Science, Observatories, and Community",
      "abstract": "This Horizon Study describes a next-generation ground-based gravitational-wave observatory: Cosmic Explorer. With ten times the sensitivity of Advanced LIGO, Cosmic Explorer will push gravitational-wave astronomy towards the edge of the observable universe ($z \\sim 100$). The goals of this Horizon Study are to describe and evaluate design concepts for Cosmic Explorer; to plan for the United States' leadership in gravitational-wave astronomy; and to envisage the role of Cosmic Explorer in the international effort to build a \"Third-Generation\" (3G) observatory network that will make discoveries transformative across astronomy, physics, and cosmology. △ Less",
      "url": "https://arxiv.org/abs/2109.09882"
    },
    {
      "title": "ThriftyDAgger: Budget-Aware Novelty and Risk Gating for Interactive Imitation Learning",
      "abstract": "Effective robot learning often requires online human feedback and interventions that can cost significant human time, giving rise to the central challenge in interactive imitation learning: is it possible to control the timing and length of interventions to both facilitate learning and limit burden on the human supervisor? This paper presents ThriftyDAgger, an algorithm for actively querying a human supervisor given a desired budget of human interventions. ThriftyDAgger uses a learned switching policy to solicit interventions only at states that are sufficiently (1) novel, where the robot policy has no reference behavior to imitate, or (2) risky, where the robot has low confidence in task completion. To detect the latter, we introduce a novel metric for estimating risk under the current robot policy. Experiments in simulation and on a physical cable routing experiment suggest that ThriftyDAgger's intervention criteria balances task performance and supervisor burden more effectively than prior algorithms. ThriftyDAgger can also be applied at execution time, where it achieves a 100% success rate on both the simulation and physical tasks. A user study (N=10) in which users control a three-robot fleet while also performing a concentration task suggests that ThriftyDAgger increases human and robot performance by 58% and 80% respectively compared to the next best algorithm while reducing supervisor burden. △ Less",
      "url": "https://arxiv.org/abs/2109.08273"
    },
    {
      "title": "Kit-Net: Self-Supervised Learning to Kit Novel 3D Objects into Novel 3D Cavities",
      "abstract": "In industrial part kitting, 3D objects are inserted into cavities for transportation or subsequent assembly. Kitting is a critical step as it can decrease downstream processing and handling times and enable lower storage and shipping costs. We present Kit-Net, a framework for kitting previously unseen 3D objects into cavities given depth images of both the target cavity and an object held by a gripper in an unknown initial orientation. Kit-Net uses self-supervised deep learning and data augmentation to train a convolutional neural network (CNN) to robustly estimate 3D rotations between objects and matching concave or convex cavities using a large training dataset of simulated depth images pairs. Kit-Net then uses the trained CNN to implement a controller to orient and position novel objects for insertion into novel prismatic and conformal 3D cavities. Experiments in simulation suggest that Kit-Net can orient objects to have a 98.9% average intersection volume between the object mesh and that of the target cavity. Physical experiments with industrial objects succeed in 18% of trials using a baseline method and in 63% of trials with Kit-Net. Video, code, and data are available at https://github.com/BerkeleyAutomation/Kit-Net. △ Less",
      "url": "https://arxiv.org/abs/2107.05789"
    },
    {
      "title": "Policy Gradient Bayesian Robust Optimization for Imitation Learning",
      "abstract": "The difficulty in specifying rewards for many real-world problems has led to an increased focus on learning rewards from human feedback, such as demonstrations. However, there are often many different reward functions that explain the human feedback, leaving agents with uncertainty over what the true reward function is. While most policy optimization approaches handle this uncertainty by optimizing for expected performance, many applications demand risk-averse behavior. We derive a novel policy gradient-style robust optimization approach, PG-BROIL, that optimizes a soft-robust objective that balances expected performance and risk. To the best of our knowledge, PG-BROIL is the first policy optimization algorithm robust to a distribution of reward hypotheses which can scale to continuous MDPs. Results suggest that PG-BROIL can produce a family of behaviors ranging from risk-neutral to risk-averse and outperforms state-of-the-art imitation learning algorithms when learning from ambiguous demonstrations by hedging against uncertainty, rather than seeking to uniquely identify the demonstrator's reward function. △ Less",
      "url": "https://arxiv.org/abs/2106.06499"
    },
    {
      "title": "The finite dual of commutative-by-finite Hopf algebras",
      "abstract": "The finite dual $H^{\\circ}$ of an affine commutative-by-finite Hopf algebra $H$ is studied. Such a Hopf algebra $H$ is an extension of an affine commutative Hopf algebra $A$ by a finite dimensional Hopf algebra $F$. The main theorem gives natural conditions under which $H^{\\circ}$ decomposes as a crossed or smash product of $F^{\\ast}$ by the finite dual of $A$. This decomposition is then further analysed using the Cartier- Gabriel-Kostant theorem to obtain component Hopf subalgebras of $H^{\\circ}$ mapping onto the classical components of $A^{\\circ}$. The detailed consequences for a number of families of examples are then studied. △ Less",
      "url": "https://arxiv.org/abs/2105.13874"
    },
    {
      "title": "LazyDAgger: Reducing Context Switching in Interactive Imitation Learning",
      "abstract": "Corrective interventions while a robot is learning to automate a task provide an intuitive method for a human supervisor to assist the robot and convey information about desired behavior. However, these interventions can impose significant burden on a human supervisor, as each intervention interrupts other work the human is doing, incurs latency with each context switch between supervisor and autonomous control, and requires time to perform. We present LazyDAgger, which extends the interactive imitation learning (IL) algorithm SafeDAgger to reduce context switches between supervisor and autonomous control. We find that LazyDAgger improves the performance and robustness of the learned policy during both learning and execution while limiting burden on the supervisor. Simulation experiments suggest that LazyDAgger can reduce context switches by an average of 60% over SafeDAgger on 3 continuous control tasks while maintaining state-of-the-art policy performance. In physical fabric manipulation experiments with an ABB YuMi robot, LazyDAgger reduces context switches by 60% while achieving a 60% higher success rate than SafeDAgger at execution time. △ Less",
      "url": "https://arxiv.org/abs/2104.00053"
    },
    {
      "title": "Point absorbers in Advanced LIGO",
      "abstract": "Small, highly absorbing points are randomly present on the surfaces of the main interferometer optics in Advanced LIGO. The resulting nano-meter scale thermo-elastic deformations and substrate lenses from these micron-scale absorbers significantly reduces the sensitivity of the interferometer directly though a reduction in the power-recycling gain and indirect interactions with the feedback control system. We review the expected surface deformation from point absorbers and provide a pedagogical description of the impact on power build-up in second generation gravitational wave detectors (dual-recycled Fabry-Perot Michelson interferometers). This analysis predicts that the power-dependent reduction in interferometer performance will significantly degrade maximum stored power by up to 50% and hence, limit GW sensitivity, but suggests system wide corrections that can be implemented in current and future GW detectors. This is particularly pressing given that future GW detectors call for an order of magnitude more stored power than currently used in Advanced LIGO in Observing Run 3. We briefly review strategies to mitigate the effects of point absorbers in current and future GW wave detectors to maximize the success of these enterprises. △ Less",
      "url": "https://arxiv.org/abs/2101.05828"
    },
    {
      "title": "Comparison of $pp$ and $p \\bar{p}$ differential elastic cross sections and observation of the exchange of a colorless $C$-odd gluonic compound",
      "abstract": "We describe an analysis comparing the $p\\bar{p}$ elastic cross section as measured by the D0 Collaboration at a center-of-mass energy of 1.96 TeV to that in $pp$ collisions as measured by the TOTEM Collaboration at 2.76, 7, 8, and 13 TeV using a model-independent approach. The TOTEM cross sections extrapolated to a center-of-mass energy of $\\sqrt{s} =$ 1.96 TeV are compared with the D0 measurement in the region of the diffractive minimum and the second maximum of the $pp$ cross section. The two data sets disagree at the 3.4$σ$ level and thus provide evidence for the $t$-channel exchange of a colorless, $C$-odd gluonic compound, also known as the odderon. We combine these results with a TOTEM analysis of the same $C$-odd exchange based on the total cross section and the ratio of the real to imaginary parts of the forward elastic scattering amplitude in $pp$ scattering. The combined significance of these results is larger than 5$σ$ and is interpreted as the first observation of the exchange of a colorless, $C$-odd gluonic compound. △ Less",
      "url": "https://arxiv.org/abs/2012.03981"
    },
    {
      "title": "Exploratory Grasping: Asymptotically Optimal Algorithms for Grasping Challenging Polyhedral Objects",
      "abstract": "There has been significant recent work on data-driven algorithms for learning general-purpose grasping policies. However, these policies can consistently fail to grasp challenging objects which are significantly out of the distribution of objects in the training data or which have very few high quality grasps. Motivated by such objects, we propose a novel problem setting, Exploratory Grasping, for efficiently discovering reliable grasps on an unknown polyhedral object via sequential grasping, releasing, and toppling. We formalize Exploratory Grasping as a Markov Decision Process, study the theoretical complexity of Exploratory Grasping in the context of reinforcement learning and present an efficient bandit-style algorithm, Bandits for Online Rapid Grasp Exploration Strategy (BORGES), which leverages the structure of the problem to efficiently discover high performing grasps for each object stable pose. BORGES can be used to complement any general-purpose grasping algorithm with any grasp modality (parallel-jaw, suction, multi-fingered, etc) to learn policies for objects in which they exhibit persistent failures. Simulation experiments suggest that BORGES can significantly outperform both general-purpose grasping pipelines and two other online learning algorithms and achieves performance within 5% of the optimal policy within 1000 and 8000 timesteps on average across 46 challenging objects from the Dex-Net adversarial and EGAD! object datasets, respectively. Initial physical experiments suggest that BORGES can improve grasp success rate by 45% over a Dex-Net baseline with just 200 grasp attempts in the real world. See https://tinyurl.com/exp-grasping for supplementary material and videos. △ Less",
      "url": "https://arxiv.org/abs/2011.05632"
    },
    {
      "title": "CMB-S4: Forecasting Constraints on Primordial Gravitational Waves",
      "abstract": "CMB-S4---the next-generation ground-based cosmic microwave background (CMB) experiment---is set to significantly advance the sensitivity of CMB measurements and enhance our understanding of the origin and evolution of the Universe, from the highest energies at the dawn of time through the growth of structure to the present day. Among the science cases pursued with CMB-S4, the quest for detecting primordial gravitational waves is a central driver of the experimental design. This work details the development of a forecasting framework that includes a power-spectrum-based semi-analytic projection tool, targeted explicitly towards optimizing constraints on the tensor-to-scalar ratio, $r$, in the presence of Galactic foregrounds and gravitational lensing of the CMB. This framework is unique in its direct use of information from the achieved performance of current Stage 2--3 CMB experiments to robustly forecast the science reach of upcoming CMB-polarization endeavors. The methodology allows for rapid iteration over experimental configurations and offers a flexible way to optimize the design of future experiments given a desired scientific goal. To form a closed-loop process, we couple this semi-analytic tool with map-based validation studies, which allow for the injection of additional complexity and verification of our forecasts with several independent analysis methods. We document multiple rounds of forecasts for CMB-S4 using this process and the resulting establishment of the current reference design of the primordial gravitational-wave component of the Stage-4 experiment, optimized to achieve our science goals of detecting primordial gravitational waves for $r > 0.003$ at greater than $5σ$, or, in the absence of a detection, of reaching an upper limit of $r < 0.001$ at $95\\%$ CL. △ Less",
      "url": "https://arxiv.org/abs/2008.12619"
    },
    {
      "title": "SN 2019ehk: A Double-Peaked Ca-rich Transient with Luminous X-ray Emission and Shock-Ionized Spectral Features",
      "abstract": "We present panchromatic observations and modeling of the Calcium-rich supernova 2019ehk in the star-forming galaxy M100 (d$\\approx$16.2 Mpc) starting 10 hours after explosion and continuing for ~300 days. SN 2019ehk shows a double-peaked optical light curve peaking at $t = 3$ and $15$ days. The first peak is coincident with luminous, rapidly decaying $\\textit{Swift}$-XRT discovered X-ray emission ($L_x\\approx10^{41}~\\rm{erg~s^{-1}}$ at 3 days; $L_x \\propto t^{-3}$), and a Shane/Kast spectral detection of narrow H$α$ and He II emission lines ($v \\approx 500$ km/s) originating from pre-existent circumstellar material. We attribute this phenomenology to radiation from shock interaction with extended, dense material surrounding the progenitor star at $r<10^{15}$ cm and the resulting cooling emission. We calculate a total CSM mass of $\\sim$ $7\\times10^{-3}$ $\\rm{M_{\\odot}}$ with particle density $n\\approx10^{9}\\,\\rm{cm^{-3}}$. Radio observations indicate a significantly lower density $n < 10^{4}\\,\\rm{cm^{-3}}$ at larger radii. The photometric and spectroscopic properties during the second light curve peak are consistent with those of Ca-rich transients (rise-time of $t_r =13.4\\pm0.210$ days and a peak B-band magnitude of $M_B =-15.1\\pm0.200$ mag). We find that SN 2019ehk synthesized $(3.1\\pm0.11)\\times10^{-2} ~ \\rm{M_{\\odot}}$ of ${}^{56}\\textrm{Ni}$ and ejected $M_{\\rm ej} = (0.72\\pm 0.040)~\\rm{M_{\\odot}}$ total with a kinetic energy $E_{\\rm k}=(1.8\\pm0.10)\\times10^{50}~\\rm{erg}$. Finally, deep $\\textit{HST}$ pre-explosion imaging at the SN site constrains the parameter space of viable stellar progenitors to massive stars in the lowest mass bin (~10 $\\rm{M_{\\odot}}$) in binaries that lost most of their He envelope or white dwarfs. The explosion and environment properties of SN 2019ehk further restrict the potential WD progenitor systems to low-mass hybrid HeCO WD + CO WD binaries. △ Less",
      "url": "https://arxiv.org/abs/2005.01782"
    },
    {
      "title": "Iterated Hopf Ore extensions in positive characteristic",
      "abstract": "Iterated Hopf Ore extensions (IHOEs) over an algebraically closed base field k of positive characteristic p are studied. We show that every IHOE over k satisfies a polynomial identity, with PI-degree a power of p, and that it is a filtered deformation of a commutative polynomial ring. We classify all 2-step IHOEs over k, thus generalising the classification of 2-dimensional connected unipotent algebraic groups over k. Further properties of 2-step IHOEs are described: for example their simple modules are classified, and every 2-step IHOE is shown to possess a large Hopf center and hence an analog of the restricted enveloping algebra of a Lie k-algebra. As one of a number of questions listed, we propose that such a restricted Hopf algebra may exist for every IHOE over k. △ Less",
      "url": "https://arxiv.org/abs/2004.14702"
    },
    {
      "title": "Direct evidence for shock-powered optical emission in a nova",
      "abstract": "Classical novae are thermonuclear explosions that occur on the surfaces of white dwarf stars in interacting binary systems (Bode & Evans 2008). It has long been thought that the luminosity of classical novae is powered by continued nuclear burning on the surface of the white dwarf after the initial runaway (Gallaher & Starrfield 1978). However, recent observations of GeV $γ$-rays from classical novae have hinted that shocks internal to the nova ejecta may dominate the nova emission. Shocks have also been suggested to power the luminosity of events as diverse as stellar mergers (Metzger & Pejcha 2017), supernovae (Moriya et al. 2018), and tidal disruption events (Roth et al. 2016), but observational confirmation has been lacking. Here we report simultaneous space-based optical and $γ$-ray observations of the 2018 nova V906 Carinae (ASASSN-18fv), revealing a remarkable series of distinct correlated flares in both bands. The optical and $γ$-ray flares occur simultaneously, implying a common origin in shocks. During the flares, the nova luminosity doubles, implying that the bulk of the luminosity is shock-powered. Furthermore, we detect concurrent but weak X-ray emission from deeply embedded shocks, confirming that the shock power does not appear in the X-ray band and supporting its emergence at longer wavelengths. Our data, spanning the spectrum from radio to $γ$-ray, provide direct evidence that shocks can power substantial luminosity in classical novae and other optical transients. △ Less",
      "url": "https://arxiv.org/abs/2004.05562"
    },
    {
      "title": "Survey on Hopf algebras of GK-dimension 1 and 2",
      "abstract": "This is a brief survey on the current state of play on the programs to classify infinite dimensional Hopf algebras of Gel'fand-Kirillov dimension one or two. We list a number of open questions and suggest directions for future work. △ Less",
      "url": "https://arxiv.org/abs/2003.14251"
    },
    {
      "title": "A Cryogenic Silicon Interferometer for Gravitational-wave Detection",
      "abstract": "The detection of gravitational waves from compact binary mergers by LIGO has opened the era of gravitational wave astronomy, revealing a previously hidden side of the cosmos. To maximize the reach of the existing LIGO observatory facilities, we have designed a new instrument that will have 5 times the range of Advanced LIGO, or greater than 100 times the event rate. Observations with this new instrument will make possible dramatic steps toward understanding the physics of the nearby universe, as well as observing the universe out to cosmological distances by the detection of binary black hole coalescences. This article presents the instrument design and a quantitative analysis of the anticipated noise floor. △ Less",
      "url": "https://arxiv.org/abs/2001.11173"
    },
    {
      "title": "CMB-S4 Decadal Survey APC White Paper",
      "abstract": "We provide an overview of the science case, instrument configuration and project plan for the next-generation ground-based cosmic microwave background experiment CMB-S4, for consideration by the 2020 Decadal Survey. △ Less",
      "url": "https://arxiv.org/abs/1908.01062"
    },
    {
      "title": "CMB-S4 Science Case, Reference Design, and Project Plan",
      "abstract": "We present the science case, reference design, and project plan for the Stage-4 ground-based cosmic microwave background experiment CMB-S4. △ Less",
      "url": "https://arxiv.org/abs/1907.04473"
    }
  ]
}