{
  "author": "Mikko Koivisto",
  "results": [
    {
      "title": "Crack propagation by activated avalanches during creep and fatigue from elastic interface theory",
      "abstract": "The growth of cracks combines materials science, fracture mechanics, and statistical physics. The importance of fluctuations in the crack velocity is fundamental since it signals that the crack overcomes local barriers such as tough spots by avalanches. In ductile materials the omnipresent plasticity close to the crack tip influences the growth by history effects, which we here study in polymethylmetacrylate by various fatigue and creep protocols. We show how the crack tip local history may be encompassed in a time- and protocol dependent lengthscale, that allows to apply a statistical fracture description to the time-dependent crack growth rate, resolving the well-known paradox why fatigue cracks grow faster if the stress during a cycle is let to relax more from the peak value. The results open up novel directions for understanding fracture by statistical physics. △ Less",
      "url": "https://arxiv.org/abs/2503.07280"
    },
    {
      "title": "Bayesian optimization to infer parameters in viscoelasticity",
      "abstract": "Inferring viscoelasticity parameters is a key challenge that often leads to non-unique solutions when fitting rheological data. In this context, we propose a machine learning approach that utilizes Bayesian optimization for parameter inference during curve-fitting processes. To fit a viscoelastic model to rheological data, the Bayesian optimization maps the parameter values to a given error function. It then exploits the mapped space to identify parameter combinations that minimize the error. We compare the Bayesian optimization results to traditional fitting routines and demonstrate that our approach finds the fitting parameters in a less or similar number of iterations. Furthermore, it also creates a \"white-box\" and supervised framework for parameter estimation in linear viscoelasticity modeling. △ Less",
      "url": "https://arxiv.org/abs/2502.19132"
    },
    {
      "title": "pyRheo: An open-source Python package for complex rheology",
      "abstract": "Mathematical modeling is a powerful tool in rheology, and we present pyRheo, an open-source package for Python designed to streamline the analysis of creep, stress relaxation, oscillation, and rotation tests. pyRheo contains a comprehensive selection of viscoelastic models, including fractional order approaches. It integrates model selection and fitting features and employs machine intelligence to suggest a model to describe a given dataset. The package fits the suggested model or one chosen by the user. An advantage of using pyRheo is that it addresses challenges associated with sensitivity to initial guesses in parameter optimization. It allows the user to iteratively search for the best initial guesses, avoiding convergence to local minima. We discuss the capabilities of pyRheo and compare them to other tools for rheological modeling of biological matter. We demonstrate that pyRheo significantly reduces the computation time required to fit high-performance viscoelastic models. △ Less",
      "url": "https://arxiv.org/abs/2412.15941"
    },
    {
      "title": "Quantum Speedups for Bayesian Network Structure Learning",
      "abstract": "The Bayesian network structure learning (BNSL) problem asks for a directed acyclic graph that maximizes a given score function. For networks with $n$ nodes, the fastest known algorithms run in time $O(2^n n^2)$ in the worst case, with no improvement in the asymptotic bound for two decades. Inspired by recent advances in quantum computing, we ask whether BNSL admits a polynomial quantum speedup, that is, whether the problem can be solved by a quantum algorithm in time $O(c^n)$ for some constant $c$ less than $2$. We answer the question in the affirmative by giving two algorithms achieving $c \\le 1.817$ and $c \\le 1.982$ assuming the number of potential parent sets is, respectively, subexponential and $O(1.453^n)$. Both algorithms assume the availability of a quantum random access memory. We also prove that one presumably cannot lower the base $2$ for any classical algorithm, as that would refute the strong exponential time hypothesis. △ Less",
      "url": "https://arxiv.org/abs/2305.19673"
    },
    {
      "title": "Striation lines in intermittent fatigue crack growth in an Al alloy",
      "abstract": "Fatigue failure of crystalline materials is a difficult problem in science and engineering, and recent results have shown that fatigue crack growth can occur in intermittent jumps which have fat-tailed distributions. As fatigue crack propagation is known to leave markings -- called striations -- on the fracture surface, the distances between these should also have fat-tailed distributions, if the crack propagation is intermittent. Here, we combine macroscale crack tip tracking in fatigue crack growth measurements of aluminum 5005 samples with \\emph{post-mortem} scanning electron microscopy imaging of the striation lines. We introduce two different methods for extracting the striation line spacing from the images. What we find is a similar distribution of striation spacings as jump sizes using one of our methods, but the average striation spacing does not correlate with the crack growth rate. We conclude that we observe avalanche-like crack propagation, reflected in both the macroscale crack tip tracking as well as the analysis of the fracture surfaces. Our results show that the fracture surfaces can be used to study the intermittency of fatigue crack propagation and in development of crack-resistant materials. The advantages and disadvantages of the two methods introduced are discussed. △ Less",
      "url": "https://arxiv.org/abs/2305.07460"
    },
    {
      "title": "Wood compression in four-dimensional in situ tomography",
      "abstract": "Wood deformation, in particular when subject to compression, exhibits scale-free avalanche-like behavior as well as structure-dependent localization of deformation. We have taken three-dimensional (3D) x-ray tomographs during compression with constant stress rate loading. Using digital volume correlation, we obtain the local total strain during the experiment and compare it to the global strain and acoustic emission. The wood cells collapse layer by layer throughout the sample starting from the softest parts, i.e., the spring wood. As the damage progresses, more and more of the softwood layers throughout the sample collapse, which indicates damage spreading instead of localization. In 3D, one can see a fat-tailed local strain rate distribution, indicating that inside the softwood layers, the damage occurs in localized spots. The observed log-normal strain distribution is in agreement with this view of the development of independent local collapses or irreversible deformation events. A key feature in the mechanical behavior of wood is then in the complex interaction of localized deformation between or among the annual rings. △ Less",
      "url": "https://arxiv.org/abs/2211.04787"
    },
    {
      "title": "Approximating the Permanent with Deep Rejection Sampling",
      "abstract": "We present a randomized approximation scheme for the permanent of a matrix with nonnegative entries. Our scheme extends a recursive rejection sampling method of Huber and Law (SODA 2008) by replacing the upper bound for the permanent with a linear combination of the subproblem bounds at a moderately large depth of the recursion tree. This method, we call deep rejection sampling, is empirically shown to outperform the basic, depth-zero variant, as well as a related method by Kuck et al. (NeurIPS 2019). We analyze the expected running time of the scheme on random $(0, 1)$-matrices where each entry is independently $1$ with probability $p$. Our bound is superior to a previous one for $p$ less than $1/5$, matching another bound that was known to hold when every row and column has density exactly $p$. △ Less",
      "url": "https://arxiv.org/abs/2108.07359"
    },
    {
      "title": "Joint Positioning and Tracking via NR Sidelink in 5G-Empowered Industrial IoT: Releasing the Potential of V2X Technology",
      "abstract": "The fifth generation (5G) mobile networks with enhanced connectivity and positioning capabilities play an increasingly important role in the development of automated vehicle-to-everything (V2X) and other advanced industrial Internet of Things (IoT) systems. In this article, we address the prospects of 5G New Radio (NR) sidelink based V2X networks and their applicability for increasing the situational awareness, in terms of continuous tracking of moving connected machines and vehicles, in industrial systems. For increased system flexibility and fast deployments, we assume that the locations of the so-called anchor nodes are unknown, and describe an extended Kalman filter-based joint positioning and tracking framework in which the locations of both the anchor nodes and the target nodes can be estimated simultaneously. We assess and demonstrate the achievable 3D positioning and tracking performance in the context of a realistic industrial warehouse facility, through extensive ray-tracing based evaluations at the 26 GHz NR band. Our findings show that when both angle-based and time-based measurements are utilized, reaching sub-1 meter accuracy is realistic and that the system is also relatively robust against different node geometries. Finally, several research challenges towards achieving robust, high-performance and cost-efficient positioning solutions are outlined and discussed, identifying various potential directions for future work. △ Less",
      "url": "https://arxiv.org/abs/2101.06003"
    },
    {
      "title": "Towards Scalable Bayesian Learning of Causal DAGs",
      "abstract": "We give methods for Bayesian inference of directed acyclic graphs, DAGs, and the induced causal effects from passively observed complete data. Our methods build on a recent Markov chain Monte Carlo scheme for learning Bayesian networks, which enables efficient approximate sampling from the graph posterior, provided that each node is assigned a small number $K$ of candidate parents. We present algorithmic techniques to significantly reduce the space and time requirements, which make the use of substantially larger values of $K$ feasible. Furthermore, we investigate the problem of selecting the candidate parents per node so as to maximize the covered posterior mass. Finally, we combine our sampling method with a novel Bayesian approach for estimating causal effects in linear Gaussian DAG models. Numerical experiments demonstrate the performance of our methods in detecting ancestor-descendant relations, and in causal effect estimation our Bayesian method is shown to outperform previous approaches. △ Less",
      "url": "https://arxiv.org/abs/2010.00684"
    },
    {
      "title": "Machine learning and predicting the time dependent dynamics of local yielding in dry foams",
      "abstract": "The yielding of dry foams is enabled by small elementary yield events on the bubble scale, \"T1\"s. We study the large scale detection of these in an expanding 2D flow geometry using artificial intelligence (AI) and nearest neighbour analysis. A good level of accuracy is reached by the AI approach using only a single frame, with the maximum score for vertex centered images highlighting the important role the vertices play in the local yielding of foams. We study the predictability of T1s ahead of time and show that this is possible on a timescale related to the waiting time statistics of T1s in local neighborhoods. The local T1 event predictability development is asymmetric in time, and measures the variation of the local property to yielding and similarly the existence of a relaxation timescale post local yielding. △ Less",
      "url": "https://arxiv.org/abs/2005.13265"
    },
    {
      "title": "Fast Multi-Subset Transform and Weighted Sums Over Acyclic Digraphs",
      "abstract": "The zeta and Moebius transforms over the subset lattice of $n$ elements and the so-called subset convolution are examples of unary and binary operations on set functions. While their direct computation requires $O(3^n)$ arithmetic operations, less naive algorithms only use $2^n \\mathrm{poly}(n)$ operations, nearly linear in the input size. Here, we investigate a related $n$-ary operation that takes $n$ set functions as input and maps them to a new set function. This operation, we call multi-subset transform, is the core ingredient in the known inclusion--exclusion recurrence for weighted sums over acyclic digraphs, which extends Robinson's recurrence for the number of labelled acyclic digraphs. Prior to this work the best known complexity bound was the direct $O(3^n)$. By reducing the task to multiple instances of rectangular matrix multiplication, we improve the complexity to $O(2.985^n)$. △ Less",
      "url": "https://arxiv.org/abs/2002.08475"
    },
    {
      "title": "Positioning and Location-Aware Communications for Modern Railways with 5G New Radio",
      "abstract": "Providing high-capacity radio connectivity for high-speed trains (HSTs) is one of the most important use cases of emerging 5G New Radio (NR) networks. In this article, we show that 5G NR technology can also facilitate high-accuracy continuous localization and tracking of HSTs. Furthermore, we describe and demonstrate how the NR network can utilize the continuous location information for efficient beam-management and beamforming, as well as for downlink Doppler precompensation in the single-frequency network context. Additionally, with particular focus on millimeter wave networks, novel concepts for low-latency intercarrier interference (ICI) estimation and compensation, due to residual Doppler and oscillator phase noise, are described and demonstrated. The provided numerical results at 30 GHz operating band show that sub-meter positioning and sub-degree beam-direction accuracies can be obtained with very high probabilities in the order of 95-99%. The results also show that the described Doppler precompensation and ICI estimation and cancellation methods substantially improve the throughput of the single-frequency HST network. △ Less",
      "url": "https://arxiv.org/abs/1905.01154"
    },
    {
      "title": "Benefits of Positioning-Aided Communication Technology in High-Frequency Industrial IoT",
      "abstract": "The future of industrial applications is shaped by intelligent moving IoT devices, such as flying drones, advanced factory robots, and connected vehicles, which may operate (semi-)autonomously. In these challenging scenarios, dynamic radio connectivity at high frequencies -- augmented with timely positioning-related information -- becomes instrumental to improve communication performance and facilitate efficient computation offloading. Our work reviews the main research challenges and reveals open implementation gaps in Industrial IoT (IIoT) applications that rely on location awareness and multi-connectivity in super high and extremely high frequency bands. It further conducts a rigorous numerical investigation to confirm the potential of precise device localization in the emerging IIoT systems. We focus on positioning-aided benefits made available to multi-connectivity IIoT device operation at 28 GHz, which notably improve data transfer rates, communication latency, and extent of control overhead. △ Less",
      "url": "https://arxiv.org/abs/1809.03583"
    },
    {
      "title": "Positioning of High-speed Trains using 5G New Radio Synchronization Signals",
      "abstract": "We study positioning of high-speed trains in 5G new radio (NR) networks by utilizing specific NR synchronization signals. The studies are based on simulations with 3GPP-specified radio channel models including path loss, shadowing and fast fading effects. The considered positioning approach exploits measurement of Time-Of-Arrival (TOA) and Angle-Of-Departure (AOD), which are estimated from beamformed NR synchronization signals. Based on the given measurements and the assumed train movement model, the train position is tracked by using an Extended Kalman Filter (EKF), which is able to handle the non-linear relationship between the TOA and AOD measurements, and the estimated train position parameters. It is shown that in the considered scenario the TOA measurements are able to achieve better accuracy compared to the AOD measurements. However, as shown by the results, the best tracking performance is achieved, when both of the measurements are considered. In this case, a very high, sub-meter, tracking accuracy can be achieved for most (>75%) of the tracking time, thus achieving the positioning accuracy requirements envisioned for the 5G NR. The pursued high-accuracy and high-availability positioning technology is considered to be in a key role in several envisioned HST use cases, such as mission-critical autonomous train systems. △ Less",
      "url": "https://arxiv.org/abs/1805.01830"
    },
    {
      "title": "User Positioning in mmW 5G Networks using Beam-RSRP Measurements and Kalman Filtering",
      "abstract": "In this paper, we exploit the 3D-beamforming features of multiantenna equipment employed in fifth generation (5G) networks, operating in the millimeter wave (mmW) band, for accurate positioning and tracking of users. We consider sequential estimation of users' positions, and propose a two-stage extended Kalman filter (EKF) that is based on reference signal received power (RSRP) measurements. In particular, beamformed downlink (DL) reference signals (RS) are transmitted by multiple base stations (BSs) and measured by user equipmentn(UE) employing receive beamforming. The so-obtained BRSRP measurements are fed back to the BS where the corresponding direction-of-departure are sequentially estimated by a novel EKF. Such angle estimates from multiple BSs are subsequently fused on a central entity into 3D position estimates of UE by means of an angle-based EKF. The proposed positioning scheme is scalable since the computational burden is shared among different network entities, namely transmission/reception points (TRPs) and 5G-NR Node B (gNB), and may be accomplished with the signalling currently specified for 5G. We assess the performance of the proposed algorithm on a realistic outdoor 5G deployment with a detailed ray tracing propagation model based on the METIS Madrid map. Numerical results with a system operating at 39 GHz show that sub-meter 3D positioning accuracy is achievable in future mmW 5G networks. △ Less",
      "url": "https://arxiv.org/abs/1803.09478"
    },
    {
      "title": "Friction controls submerged granular flows",
      "abstract": "We investigate the coupling between interstitial medium and granular particles by studying the hopper flow of dry and submerged system experimentally and numerically. In accordance with earlier studies, we find, that the dry hopper empties at a constant rate. However, in the submerged system we observe the surging of the flow rate. We model both systems using the discrete element method, which we couple with computational fluid dynamics in the case of a submerged hopper. We are able to match the simulations and the experiments with good accuracy. To do that, we fit the particle-particle contact friction for each system separately, finding that submerging the hopper changes the particle-particle contact friction from $μ_{vacuum}=0.15$ to $μ_{sub}=0.13$, while all the other simulation parameters remain the same. Furthermore, our experiments find a particle size dependence to the flow rate, which is comprehended based on arguments on the terminal velocity and drag. These results jointly allow us to conclude that at the large particle limit, the interstitial medium does not matter, in contrast to small particles. The particle size limit, where this occurs depends on the viscosity of the interstitial fluid. △ Less",
      "url": "https://arxiv.org/abs/1703.09584"
    },
    {
      "title": "High-Efficiency Device Positioning and Location-Aware Communications in Dense 5G Networks",
      "abstract": "In this article, the prospects and enabling technologies for high-efficiency device positioning and location-aware communications in emerging 5G networks are reviewed. We will first describe some key technical enablers and demonstrate by means of realistic ray-tracing and map based evaluations that positioning accuracies below one meter can be achieved by properly fusing direction and delay related measurements on the network side, even when tracking moving devices. We will then discuss the possibilities and opportunities that such high-efficiency positioning capabilities can offer, not only for location-based services in general, but also for the radio access network itself. In particular, we will demonstrate that geometric location-based beamforming schemes become technically feasible, which can offer substantially reduced reference symbol overhead compared to classical full channel state information (CSI)-based beamforming. At the same time, substantial power savings can be realized in future wideband 5G networks where acquiring full CSI calls for wideband reference signals while location estimation and tracking can, in turn, be accomplished with narrowband pilots. △ Less",
      "url": "https://arxiv.org/abs/1608.03775"
    },
    {
      "title": "Joint 3D Positioning and Network Synchronization in 5G Ultra-Dense Networks Using UKF and EKF",
      "abstract": "It is commonly expected that future fifth generation (5G) networks will be deployed with a high spatial density of access nodes (ANs) in order to meet the envisioned capacity requirements of the upcoming wireless networks. Densification is beneficial not only for communications but it also creates a convenient infrastructure for highly accurate user node (UN) positioning. Despite the fact that positioning will play an important role in future networks, thus enabling a huge amount of location-based applications and services, this great opportunity has not been widely explored in the existing literature. Therefore, this paper proposes an unscented Kalman filter (UKF)-based method for estimating directions of arrival (DoAs) and times of arrival (ToA) at ANs as well as performing joint 3D positioning and network synchronization in a network-centric manner. In addition to the proposed UKF-based solution, the existing 2D extended Kalman filter (EKF)-based solution is extended to cover also realistic 3D positioning scenarios. Building on the premises of 5G ultra-dense networks (UDNs), the performance of both methods is evaluated and analysed in terms of DoA and ToA estimation as well as positioning and clock offset estimation accuracy, using the METIS map-based ray-tracing channel model and 3D trajectories for vehicles and unmanned aerial vehicles (UAVs) through the Madrid grid. Based on the comprehensive numerical evaluations, both proposed methods can provide the envisioned one meter 3D positioning accuracy even in the case of unsynchronized 5G network while simultaneously tracking the clock offsets of network elements with a nanosecond-scale accuracy. △ Less",
      "url": "https://arxiv.org/abs/1608.03710"
    },
    {
      "title": "Sharper Upper Bounds for Unbalanced Uniquely Decodable Code Pairs",
      "abstract": "Two sets $A, B \\subseteq \\{0, 1\\}^n$ form a Uniquely Decodable Code Pair (UDCP) if every pair $a \\in A$, $b \\in B$ yields a distinct sum $a+b$, where the addition is over $\\mathbb{Z}^n$. We show that every UDCP $A, B$, with $|A| = 2^{(1-ε)n}$ and $|B| = 2^{βn}$, satisfies $β\\leq 0.4228 +\\sqrtε$. For sufficiently small $ε$, this bound significantly improves previous bounds by Urbanke and Li~[Information Theory Workshop '98] and Ordentlich and Shayevitz~[2014, arXiv:1412.8415], which upper bound $β$ by $0.4921$ and $0.4798$, respectively, as $ε$ approaches $0$. △ Less",
      "url": "https://arxiv.org/abs/1605.00462"
    },
    {
      "title": "Joint Device Positioning and Clock Synchronization in 5G Ultra-Dense Networks",
      "abstract": "In this article, we address the prospects and key enabling technologies for highly efficient and accurate device positioning and tracking in 5G radio access networks. Building on the premises of ultra-dense networks as well as on the adoption of multicarrier waveforms and antenna arrays in the access nodes (ANs), we first formulate extended Kalman filter (EKF)-based solutions for computationally efficient joint estimation and tracking of the time of arrival (ToA) and direction of arrival (DoA) of the user nodes (UNs) using uplink reference signals. Then, a second EKF stage is proposed in order to fuse the individual DoA/ToA estimates from one or several ANs into a UN position estimate. Since all the processing takes place at the network side, the computing complexity and energy consumption at the UN side are kept to a minimum. The cascaded EKFs proposed in this article also take into account the unavoidable relative clock offsets between UNs and ANs, such that reliable clock synchronization of the access-link is obtained as a valuable by-product. The proposed cascaded EKF scheme is then revised and extended to more general and challenging scenarios where not only the UNs have clock offsets against the network time, but also the ANs themselves are not mutually synchronized in time. Finally, comprehensive performance evaluations of the proposed solutions on a realistic 5G network setup, building on the METIS project based outdoor Madrid map model together with complete ray tracing based propagation modeling, are provided. The obtained results clearly demonstrate that by using the developed methods, sub-meter scale positioning and tracking accuracy of moving devices is indeed technically feasible in future 5G radio access networks operating at sub-6GHz frequencies, despite the realistic assumptions related to clock offsets and potentially even under unsynchronized network elements. △ Less",
      "url": "https://arxiv.org/abs/1604.03322"
    },
    {
      "title": "Dense Subset Sum may be the hardest",
      "abstract": "The Subset Sum problem asks whether a given set of $n$ positive integers contains a subset of elements that sum up to a given target $t$. It is an outstanding open question whether the $O^*(2^{n/2})$-time algorithm for Subset Sum by Horowitz and Sahni [J. ACM 1974] can be beaten in the worst-case setting by a \"truly faster\", $O^*(2^{(0.5-δ)n})$-time algorithm, with some constant $δ> 0$. Continuing an earlier work [STACS 2015], we study Subset Sum parameterized by the maximum bin size $β$, defined as the largest number of subsets of the $n$ input integers that yield the same sum. For every $ε> 0$ we give a truly faster algorithm for instances with $β\\leq 2^{(0.5-ε)n}$, as well as instances with $β\\geq 2^{0.661n}$. Consequently, we also obtain a characterization in terms of the popular density parameter $n/\\log_2 t$: if all instances of density at least $1.003$ admit a truly faster algorithm, then so does every instance. This goes against the current intuition that instances of density 1 are the hardest, and therefore is a step toward answering the open question in the affirmative. Our results stem from novel combinations of earlier algorithms for Subset Sum and a study of an extremal question in additive combinatorics connected to the problem of Uniquely Decodable Code Pairs in information theory. △ Less",
      "url": "https://arxiv.org/abs/1508.06019"
    },
    {
      "title": "Treedy: A Heuristic for Counting and Sampling Subsets",
      "abstract": "Consider a collection of weighted subsets of a ground set N. Given a query subset Q of N, how fast can one (1) find the weighted sum over all subsets of Q, and (2) sample a subset of Q proportionally to the weights? We present a tree-based greedy heuristic, Treedy, that for a given positive tolerance d answers such counting and sampling queries to within a guaranteed relative error d and total variation distance d, respectively. Experimental results on artificial instances and in application to Bayesian structure discovery in Bayesian networks show that approximations yield dramatic savings in running time compared to exact computation, and that Treedy typically outperforms a previously proposed sorting-based heuristic. △ Less",
      "url": "https://arxiv.org/abs/1309.6851"
    },
    {
      "title": "Separating OR, SUM, and XOR Circuits",
      "abstract": "Given a boolean n by n matrix A we consider arithmetic circuits for computing the transformation x->Ax over different semirings. Namely, we study three circuit models: monotone OR-circuits, monotone SUM-circuits (addition of non-negative integers), and non-monotone XOR-circuits (addition modulo 2). Our focus is on \\emph{separating} these models in terms of their circuit complexities. We give three results towards this goal: (1) We prove a direct sum type theorem on the monotone complexity of tensor product matrices. As a corollary, we obtain matrices that admit OR-circuits of size O(n), but require SUM-circuits of size Ω(n^{3/2}/\\log^2n). (2) We construct so-called \\emph{k-uniform} matrices that admit XOR-circuits of size O(n), but require OR-circuits of size Ω(n^2/\\log^2n). (3) We consider the task of \\emph{rewriting} a given OR-circuit as a XOR-circuit and prove that any subquadratic-time algorithm for this task violates the strong exponential time hypothesis. △ Less",
      "url": "https://arxiv.org/abs/1304.0513"
    },
    {
      "title": "Space--Time Tradeoffs for Subset Sum: An Improved Worst Case Algorithm",
      "abstract": "The technique of Schroeppel and Shamir (SICOMP, 1981) has long been the most efficient way to trade space against time for the SUBSET SUM problem. In the random-instance setting, however, improved tradeoffs exist. In particular, the recently discovered dissection method of Dinur et al. (CRYPTO 2012) yields a significantly improved space--time tradeoff curve for instances with strong randomness properties. Our main result is that these strong randomness assumptions can be removed, obtaining the same space--time tradeoffs in the worst case. We also show that for small space usage the dissection algorithm can be almost fully parallelized. Our strategy for dealing with arbitrary instances is to instead inject the randomness into the dissection process itself by working over a carefully selected but random composite modulus, and to introduce explicit space--time controls into the algorithm by means of a \"bailout mechanism\". △ Less",
      "url": "https://arxiv.org/abs/1303.0609"
    },
    {
      "title": "On Finding Optimal Polytrees",
      "abstract": "Inferring probabilistic networks from data is a notoriously difficult task. Under various goodness-of-fit measures, finding an optimal network is NP-hard, even if restricted to polytrees of bounded in-degree. Polynomial-time algorithms are known only for rare special cases, perhaps most notably for branchings, that is, polytrees in which the in-degree of every node is at most one. Here, we study the complexity of finding an optimal polytree that can be turned into a branching by deleting some number of arcs or nodes, treated as a parameter. We show that the problem can be solved via a matroid intersection formulation in polynomial time if the number of deleted arcs is bounded by a constant. The order of the polynomial time bound depends on this constant, hence the algorithm does not establish fixed-parameter tractability when parameterized by the number of deleted arcs. We show that a restricted version of the problem allows fixed-parameter tractability and hence scales well with the parameter. We contrast this positive result by showing that if we parameterize by the number of deleted nodes, a somewhat more powerful parameter, the problem is not fixed-parameter tractable, subject to a complexity-theoretic assumption. △ Less",
      "url": "https://arxiv.org/abs/1208.1692"
    },
    {
      "title": "Fast Monotone Summation over Disjoint Sets",
      "abstract": "We study the problem of computing an ensemble of multiple sums where the summands in each sum are indexed by subsets of size $p$ of an $n$-element ground set. More precisely, the task is to compute, for each subset of size $q$ of the ground set, the sum over the values of all subsets of size $p$ that are disjoint from the subset of size $q$. We present an arithmetic circuit that, without subtraction, solves the problem using $O((n^p+n^q)\\log n)$ arithmetic gates, all monotone; for constant $p$, $q$ this is within the factor $\\log n$ of the optimal. The circuit design is based on viewing the summation as a \"set nucleation\" task and using a tree-projection approach to implement the nucleation. Applications include improved algorithms for counting heaviest $k$-paths in a weighted graph, computing permanents of rectangular matrices, and dynamic feature selection in machine learning. △ Less",
      "url": "https://arxiv.org/abs/1208.0554"
    },
    {
      "title": "Advances in exact Bayesian structure discovery in Bayesian networks",
      "abstract": "We consider a Bayesian method for learning the Bayesian network structure from complete data. Recently, Koivisto and Sood (2004) presented an algorithm that for any single edge computes its marginal posterior probability in O(n 2^n) time, where n is the number of attributes; the number of parents per attribute is bounded by a constant. In this paper we show that the posterior probabilities for all the n (n - 1) potential edges can be computed in O(n 2^n) total time. This result is achieved by a forward-backward technique and fast Moebius transform algorithms, which are of independent interest. The resulting speedup by a factor of about n^2 allows us to experimentally study the statistical power of learning moderate-size networks. We report results from a simulation study that covers data sets with 20 to 10,000 records over 5 to 25 discrete attributes △ Less",
      "url": "https://arxiv.org/abs/1206.6828"
    },
    {
      "title": "Exact Structure Discovery in Bayesian Networks with Less Space",
      "abstract": "The fastest known exact algorithms for scorebased structure discovery in Bayesian networks on n nodes run in time and space 2nnO(1). The usage of these algorithms is limited to networks on at most around 25 nodes mainly due to the space requirement. Here, we study space-time tradeoffs for finding an optimal network structure. When little space is available, we apply the Gurevich-Shelah recurrence-originally proposed for the Hamiltonian path problem-and obtain time 22n-snO(1) in space 2snO(1) for any s = n/2, n/4, n/8, . . .; we assume the indegree of each node is bounded by a constant. For the more practical setting with moderate amounts of space, we present a novel scheme. It yields running time 2n(3/2)pnO(1) in space 2n(3/4)pnO(1) for any p = 0, 1, . . ., n/2; these bounds hold as long as the indegrees are at most 0.238n. Furthermore, the latter scheme allows easy and efficient parallelization beyond previous algorithms. We also explore empirically the potential of the presented techniques. △ Less",
      "url": "https://arxiv.org/abs/1205.2620"
    },
    {
      "title": "Homomorphic Hashing for Sparse Coefficient Extraction",
      "abstract": "We study classes of Dynamic Programming (DP) algorithms which, due to their algebraic definitions, are closely related to coefficient extraction methods. DP algorithms can easily be modified to exploit sparseness in the DP table through memorization. Coefficient extraction techniques on the other hand are both space-efficient and parallelisable, but no tools have been available to exploit sparseness. We investigate the systematic use of homomorphic hash functions to combine the best of these methods and obtain improved space-efficient algorithms for problems including LINEAR SAT, SET PARTITION, and SUBSET SUM. Our algorithms run in time proportional to the number of nonzero entries of the last segment of the DP table, which presents a strict improvement over sparse DP. The last property also gives an improved algorithm for CNF SAT with sparse projections. △ Less",
      "url": "https://arxiv.org/abs/1203.4063"
    },
    {
      "title": "Partial Order MCMC for Structure Discovery in Bayesian Networks",
      "abstract": "We present a new Markov chain Monte Carlo method for estimating posterior probabilities of structural features in Bayesian networks. The method draws samples from the posterior distribution of partial orders on the nodes; for each sampled partial order, the conditional probabilities of interest are computed exactly. We give both analytical and empirical results that suggest the superiority of the new method compared to previous methods, which sample either directed acyclic graphs or linear orders on the nodes. △ Less",
      "url": "https://arxiv.org/abs/1202.3753"
    },
    {
      "title": "Spatial fluctuations in transient creep deformation",
      "abstract": "We study the spatial fluctuations of transient creep deformation of materials as a function of time, both by Digital Image Correlation (DIC) measurements of paper samples and by numerical simulations of a crystal plasticity or discrete dislocation dynamics model. This model has a jamming or yielding phase transition, around which power-law or Andrade creep is found. During primary creep, the relative strength of the strain rate fluctuations increases with time in both cases - the spatially averaged creep rate obeys the Andrade law $ε_t \\sim t^{-0.7}$, while the time dependence of the spatial fluctuations of the local creep rates is given by $Δε_t \\sim t^{-0.5}$. A similar scaling for the fluctuations is found in the logarithmic creep regime that is typically observed for lower applied stresses. We review briefly some classical theories of Andrade creep from the point of view of such spatial fluctuations. We consider these phenomenological, time-dependent creep laws in terms of a description based on a non-equilibrium phase transition separating evolving and frozen states of the system when the externally applied load is varied. Such an interpretation is discussed further by the data collapse of the local deformations in the spirit of absorbing state/depinning phase transitions, as well as deformation-deformation correlations and the width of the cumulative strain distributions. The results are also compared with the order parameter fluctuations observed close to the depinning transition of the 2$d$ Linear Interface Model or the quenched Edwards-Wilkinson equation. △ Less",
      "url": "https://arxiv.org/abs/1105.0317"
    },
    {
      "title": "Fluctuations and scaling in creep deformation",
      "abstract": "The spatial fluctuations of deformation are studied in creep in the Andrade's power-law and the logarithmic phases, using paper samples. Measurements by the Digital Image Correlation technique show that the relative strength of the strain rate fluctuations increases with time, in both creep regimes. In the Andrade creep phase characterized by a power law decay of the strain rate $ε_t \\sim t^{-θ}$, with $θ\\approx 0.7$, the fluctuations obey $Δε_t \\sim t^{-γ}$, with $γ\\approx 0.5$. The local deformation follows a data collapse appropriate for an absorbing state/depinning transition. Similar behavior is found in a crystal plasticity model, with a jamming or yielding phase transition. △ Less",
      "url": "https://arxiv.org/abs/1007.4688"
    },
    {
      "title": "Narrow sieves for parameterized paths and packings",
      "abstract": "We present randomized algorithms for some well-studied, hard combinatorial problems: the k-path problem, the p-packing of q-sets problem, and the q-dimensional p-matching problem. Our algorithms solve these problems with high probability in time exponential only in the parameter (k, p, q) and using polynomial space; the constant bases of the exponentials are significantly smaller than in previous works. For example, for the k-path problem the improvement is from 2 to 1.66. We also show how to detect if a d-regular graph admits an edge coloring with $d$ colors in time within a polynomial factor of O(2^{(d-1)n/2}). Our techniques build upon and generalize some recently published ideas by I. Koutis (ICALP 2009), R. Williams (IPL 2009), and A. Björklund (STACS 2010, FOCS 2010). △ Less",
      "url": "https://arxiv.org/abs/1007.1161"
    },
    {
      "title": "Geodesic diameter of a polygonal domain in O(n^4 log n) time",
      "abstract": "We show that the geodesic diameter of a polygonal domain with n vertices can be computed in O(n^4 log n) time by considering O(n^3) candidate diameter endpoints; the endpoints are a subset of vertices of the overlay of shortest path maps from vertices of the domain. △ Less",
      "url": "https://arxiv.org/abs/1006.1998"
    },
    {
      "title": "On evaluation of permanents",
      "abstract": "We study the time and space complexity of matrix permanents over rings and semirings. △ Less",
      "url": "https://arxiv.org/abs/0904.3251"
    },
    {
      "title": "Counting Paths and Packings in Halves",
      "abstract": "It is shown that one can count $k$-edge paths in an $n$-vertex graph and $m$-set $k$-packings on an $n$-element universe, respectively, in time ${n \\choose k/2}$ and ${n \\choose mk/2}$, up to a factor polynomial in $n$, $k$, and $m$; in polynomial space, the bounds hold if multiplied by $3^{k/2}$ or $5^{mk/2}$, respectively. These are implications of a more general result: given two set families on an $n$-element universe, one can count the disjoint pairs of sets in the Cartesian product of the two families with $\\nO(n \\ell)$ basic operations, where $\\ell$ is the number of members in the two families and their subsets. △ Less",
      "url": "https://arxiv.org/abs/0904.3093"
    },
    {
      "title": "The fast intersection transform with applications to counting paths",
      "abstract": "We present an algorithm for evaluating a linear ``intersection transform'' of a function defined on the lattice of subsets of an $n$-element set. In particular, the algorithm constructs an arithmetic circuit for evaluating the transform in ``down-closure time'' relative to the support of the function and the evaluation domain. As an application, we develop an algorithm that, given as input a digraph with $n$ vertices and bounded integer weights at the edges, counts paths by weight and given length $0\\leq\\ell\\leq n-1$ in time $O^*(\\exp(n\\cdot H(\\ell/(2n))))$, where $H(p)=-p\\log p-(1-p)\\log(1-p)$, and the notation $O^*(\\cdot)$ suppresses a factor polynomial in $n$. △ Less",
      "url": "https://arxiv.org/abs/0809.2489"
    },
    {
      "title": "Line creep in paper peeling",
      "abstract": "The dynamics of a \"peeling front\" or an elastic line is studied under creep (constant load) conditions. Our experiments show an exponential dependence of the creep velocity on the inverse force (mass) applied. In particular, the dynamical correlations of the avalanche activity are discussed here. We compare various avalanche statistics to those of a line depinning model with non-local elasticity, and study various measures of the experimental avalanche-avalanche and temporal correlations such as the autocorrelation function of the released energy and aftershock activity. From all these we conclude, that internal avalanche dynamics seems to follow \"line depinning\" -like behavior, in rough agreement with the depinning model. Meanwhile, the correlations reveal subtle complications not implied by depinning theory. Moreover, we also show how these results can be understood from a geophysical point of view. △ Less",
      "url": "https://arxiv.org/abs/0805.3284"
    },
    {
      "title": "Trimmed Moebius Inversion and Graphs of Bounded Degree",
      "abstract": "We study ways to expedite Yates's algorithm for computing the zeta and Moebius transforms of a function defined on the subset lattice. We develop a trimmed variant of Moebius inversion that proceeds point by point, finishing the calculation at a subset before considering its supersets. For an $n$-element universe $U$ and a family $\\scr F$ of its subsets, trimmed Moebius inversion allows us to compute the number of packings, coverings, and partitions of $U$ with $k$ sets from $\\scr F$ in time within a polynomial factor (in $n$) of the number of supersets of the members of $\\scr F$. Relying on an intersection theorem of Chung et al. (1986) to bound the sizes of set families, we apply these ideas to well-studied combinatorial optimisation problems on graphs of maximum degree $Δ$. In particular, we show how to compute the Domatic Number in time within a polynomial factor of $(2^{Δ+1-2)^{n/(Δ+1)$ and the Chromatic Number in time within a polynomial factor of $(2^{Δ+1-Δ-1)^{n/(Δ+1)$. For any constant $Δ$, these bounds are $O\\bigl((2-ε)^n\\bigr)$ for $ε>0$ independent of the number of vertices $n$. △ Less",
      "url": "https://arxiv.org/abs/0802.2834"
    },
    {
      "title": "Computing the Tutte polynomial in vertex-exponential time",
      "abstract": "The deletion--contraction algorithm is perhaps the most popular method for computing a host of fundamental graph invariants such as the chromatic, flow, and reliability polynomials in graph theory, the Jones polynomial of an alternating link in knot theory, and the partition functions of the models of Ising, Potts, and Fortuin--Kasteleyn in statistical physics. Prior to this work, deletion--contraction was also the fastest known general-purpose algorithm for these invariants, running in time roughly proportional to the number of spanning trees in the input graph. Here, we give a substantially faster algorithm that computes the Tutte polynomial--and hence, all the aforementioned invariants and more--of an arbitrary graph in time within a polynomial factor of the number of connected vertex sets. The algorithm actually evaluates a multivariate generalization of the Tutte polynomial by making use of an identity due to Fortuin and Kasteleyn. We also provide a polynomial-space variant of the algorithm and give an analogous result for Chung and Graham's cover polynomial. An implementation of the algorithm outperforms deletion--contraction also in practice. △ Less",
      "url": "https://arxiv.org/abs/0711.2585"
    },
    {
      "title": "Creep of a fracture line in paper peeling",
      "abstract": "The slow motion of a crack line is studied via an experiment in which sheets of paper are split into two halves in a ``peel-in-nip'' (PIN) geometry under a constant load, in creep. The velocity-force relation is exponential. The dynamics of the fracture line exhibits intermittency, or avalanches, which are studied using acoustic emission. The energy statistics is a power-law, with the exponent $β\\sim 1.8 \\pm 0.1$. Both the waiting times between subsequent events and the displacement of the fracture line imply complicated stick-slip dynamics. We discuss the correspondence to tensile PIN tests and other similar experiments on in-plane fracture and the theory of creep for elastic manifolds. △ Less",
      "url": "https://arxiv.org/abs/cond-mat/0701562"
    },
    {
      "title": "Fourier meets Möbius: fast subset convolution",
      "abstract": "We present a fast algorithm for the subset convolution problem: given functions f and g defined on the lattice of subsets of an n-element set N, compute their subset convolution f*g, defined for all S\\subseteq N by (f * g)(S) = \\sum_{T \\subseteq S}f(T) g(S\\setminus T), where addition and multiplication is carried out in an arbitrary ring. Via Möbius transform and inversion, our algorithm evaluates the subset convolution in O(n^2 2^n) additions and multiplications, substantially improving upon the straightforward O(3^n) algorithm. Specifically, if the input functions have an integer range {-M,-M+1,...,M}, their subset convolution over the ordinary sum-product ring can be computed in O^*(2^n log M) time; the notation O^* suppresses polylogarithmic factors. Furthermore, using a standard embedding technique we can compute the subset convolution over the max-sum or min-sum semiring in O^*(2^n M) time. To demonstrate the applicability of fast subset convolution, we present the first O^*(2^k n^2 + n m) algorithm for the minimum Steiner tree problem in graphs with n vertices, k terminals, and m edges with bounded integer weights, improving upon the O^*(3^k n + 2^k n^2 + n m) time bound of the classical Dreyfus-Wagner algorithm. We also discuss extensions to recent O^*(2^n)-time algorithms for covering and partitioning problems (Björklund and Husfeldt, FOCS 2006; Koivisto, FOCS 2006). △ Less",
      "url": "https://arxiv.org/abs/cs/0611101"
    }
  ]
}