{
  "author": "Paolo Turrini",
  "results": [
    {
      "title": "Measuring the co-evolution of online engagement with (mis)information and its visibility at scale",
      "abstract": "Online attention is an increasingly valuable resource in the digital age, with extraordinary events such as the COVID-19 pandemic fuelling fierce competition around it. As misinformation pervades online platforms, users seek credible sources, while news outlets compete to attract and retain their attention. Here we measure the co-evolution of online \"engagement\" with (mis)information and its \"visibility\", where engagement corresponds to user interactions on social media, and visibility to fluctuations in user follower counts. Using a scalable temporal network modelling framework applied to over 100 million COVID-related retweets spanning 3 years, we find that highly engaged sources experience sharp spikes in follower growth during major events (e.g., vaccine rollouts, epidemic severity), whereas sources with more questionable credibility tend to sustain faster growth outside of these periods. Our framework lends itself to studying other large-scale events where online attention is at stake, such as climate and political debates. △ Less",
      "url": "https://arxiv.org/abs/2506.06106"
    },
    {
      "title": "Enabling the Digital Democratic Revival: A Research Program for Digital Democracy",
      "abstract": "This white paper outlines a long-term scientific vision for the development of digital-democracy technology. We contend that if digital democracy is to meet the ambition of enabling a participatory renewal in our societies, then a comprehensive multi-methods research effort is required that could, over the years, support its development in a democratically principled, empirically and computationally informed way. The paper is co-authored by an international and interdisciplinary team of researchers and arose from the Lorentz Center Workshop on ``Algorithmic Technology for Democracy'' (Leiden, October 2022). △ Less",
      "url": "https://arxiv.org/abs/2401.16863"
    },
    {
      "title": "Modelling and Predicting Online Vaccination Views using Bow-tie Decomposition",
      "abstract": "Social media has become increasingly important in shaping public vaccination views, especially since the COVID-19 outbreak. This paper uses bow-tie structure to analyse a temporal dataset of directed online social networks that represent the information exchange among anti-vaccination, pro-vaccination, and neutral Facebook pages. Bow-tie structure decomposes a network into seven components, with two components \"SCC\" and \"OUT\" emphasised in this paper: SCC is the largest strongly connected component, acting as an \"information magnifier\", and OUT contains all nodes with a directed path from a node in SCC, acting as an \"information creator\". We consistently observe statistically significant bow-tie structures with different dominant components for each vaccination group over time. In particular, the anti-vaccination group has a large OUT, and the pro-vaccination group has a large SCC. We further investigate changes in opinions over time, as measured by fan count variations, using agent-based simulations and machine learning models. Across both methods, accounting for bow-tie decomposition better reflects information flow differences among vaccination groups and improves our opinion dynamics prediction results. The modelling frameworks we consider can be applied to any multi-stance temporal network and could form a basis for exploring opinion dynamics using bow-tie structure in a wide range of applications. △ Less",
      "url": "https://arxiv.org/abs/2401.06255"
    },
    {
      "title": "Safe Opponent Exploitation For Epsilon Equilibrium Strategies",
      "abstract": "In safe opponent exploitation players hope to exploit their opponents' potentially sub-optimal strategies while guaranteeing at least the value of the game in expectation for themselves. Safe opponent exploitation algorithms have been successfully applied to small instances of two-player zero-sum imperfect information games, where Nash equilibrium strategies are typically known in advance. Current methods available to compute these strategies are however not scalable to desirable large domains of imperfect information such as No-Limit Texas Hold 'em (NLHE) poker, where successful agents rely on game abstractions in order to compute an equilibrium strategy approximation. This paper will extend the concept of safe opponent exploitation by introducing prime-safe opponent exploitation, in which we redefine the value of the game of a player to be the worst-case payoff their strategy could be susceptible to. This allows weaker epsilon equilibrium strategies to benefit from utilising a form of opponent exploitation with our revised value of the game, still allowing for a practical game-theoretical guaranteed lower-bound. We demonstrate the empirical advantages of our generalisation when applied to the main safe opponent exploitation algorithms. △ Less",
      "url": "https://arxiv.org/abs/2307.12338"
    },
    {
      "title": "Quantifying Consistency and Information Loss for Causal Abstraction Learning",
      "abstract": "Structural causal models provide a formalism to express causal relations between variables of interest. Models and variables can represent a system at different levels of abstraction, whereby relations may be coarsened and refined according to the need of a modeller. However, switching between different levels of abstraction requires evaluating a trade-off between the consistency and the information loss among different models. In this paper we introduce a family of interventional measures that an agent may use to evaluate such a trade-off. We consider four measures suited for different tasks, analyze their properties, and propose algorithms to evaluate and learn causal abstractions. Finally, we illustrate the flexibility of our setup by empirically showing how different measures and algorithmic choices may lead to different abstractions. △ Less",
      "url": "https://arxiv.org/abs/2305.04357"
    },
    {
      "title": "Towards Computing an Optimal Abstraction for Structural Causal Models",
      "abstract": "Working with causal models at different levels of abstraction is an important feature of science. Existing work has already considered the problem of expressing formally the relation of abstraction between causal models. In this paper, we focus on the problem of learning abstractions. We start by defining the learning problem formally in terms of the optimization of a standard measure of consistency. We then point out the limitation of this approach, and we suggest extending the objective function with a term accounting for information loss. We suggest a concrete measure of information loss, and we illustrate its contribution to learning new abstractions. △ Less",
      "url": "https://arxiv.org/abs/2208.00894"
    },
    {
      "title": "The GAPS Programme at TNG XXXIX -- Multiple molecular species in the atmosphere of the warm giant planet WASP-80 b unveiled at high resolution with GIANO-B",
      "abstract": "Detections of molecules in the atmosphere of gas giant exoplanets allow us to investigate the physico-chemical properties of the atmospheres. Their inferred chemical composition is used as tracer of planet formation and evolution mechanisms. Currently, an increasing number of detections is showing a possible rich chemistry of the hotter gaseous planets, but whether this extends to cooler giants is still unknown. We observed four transits of WASP-80 b, a warm transiting giant planet orbiting a late-K dwarf star with the near-infrared GIANO-B spectrograph installed at the Telescopio Nazionale Galileo and performed high resolution transmission spectroscopy analysis. We report the detection of several molecular species in its atmosphere. Combining the four nights and comparing our transmission spectrum to planetary atmosphere models containing the signature of individual molecules within the cross-correlation framework, we find the presence of H2O, CH4, NH3 and HCN with high significance, tentative detection of CO2, and inconclusive results for C2H2 and CO. A qualitative interpretation of these results, using physically motivated models, suggests an atmosphere consistent with solar composition and the presence of disequilibrium chemistry and we therefore recommend the inclusion of the latter in future modelling of sub-1000K planets. △ Less",
      "url": "https://arxiv.org/abs/2207.09761"
    },
    {
      "title": "On the Complexity of Majority Illusion in Social Networks",
      "abstract": "Majority illusion occurs in a social network when the majority of the network nodes belong to a certain type but each node's neighbours mostly belong to a different type, therefore creating the wrong perception, i.e., the illusion, that the majority type is different from the actual one. From a system engineering point of view, we want to devise algorithms to detect and, crucially, correct this undesirable phenomenon. In this paper we initiate the computational study of majority illusion in social networks, providing complexity results for its occurrence and avoidance. Namely, we show that identifying whether a network can be labelled such that majority illusion is present, as well as the problem of removing an illusion by adding or deleting edges of the network, are NP-complete problems. △ Less",
      "url": "https://arxiv.org/abs/2205.02056"
    },
    {
      "title": "Enabling Imitation-Based Cooperation in Dynamic Social Networks",
      "abstract": "The emergence of cooperation among self-interested agents has been a key concern of the multi-agent systems community for decades. With the increased importance of network-mediated interaction, researchers have shifted the attention on the impact of social networks and their dynamics in promoting or hindering cooperation, drawing various context-dependent conclusions. For example, some lines of research, theoretical and experimental, suggest the existence of a threshold effect in the ratio of timescales of network evolution, after which cooperation will emerge, whereas other lines dispute this, suggesting instead a Goldilocks zone. In this paper we provide an evolutionary game theory framework to understand coevolutionary processes from a bottom up perspective - in particular the emergence of a cooperator-core and defector-periphery - clarifying the impact of partner selection and imitation strategies in promoting cooperative behaviour, without assuming underlying communication or reputation mechanisms. In doing so we provide a unifying framework to study imitation-based cooperation in dynamic social networks and show that disputes in the literature can in fact coexist in so far as the results stem from different equally valid assumptions. △ Less",
      "url": "https://arxiv.org/abs/2202.03972"
    },
    {
      "title": "Predicting Voting Outcomes in the Presence of Communities, Echo Chambers and Multiple Parties",
      "abstract": "A recently proposed graph-theoretic metric, the influence gap, has shown to be a reliable predictor of the effect of social influence in two-party elections, albeit only tested on regular and scale-free graphs. Here, we investigate whether the influence gap is able to predict the outcome of multi-party elections on networks exhibiting community structure, i.e., made of highly interconnected components, and therefore more resembling of real-world interaction. To encode communities we build on the classical model of caveman graphs, which we extend to a richer graph family that displays different levels of homophily, i.e., how much connections and opinions are intertwined. First, we study the predictive power of the influence gap in the presence of communities. We show that when there is no clear initial majority the influence gap is not a good predictor of the election outcome. When we instead allow for varying majorities, although the influence gap improves as a predictor, counting the initial partisan majority does consistently better, across all levels of homophily. Second, we study the combined effect of the more predictive metrics, as function of the homophily levels. Using regression models, we demonstrate that the influence gap combined with the initial votes count does increase the overall predictive power for some levels of homophily. Third, we study elections with more than two parties. Specifically, we extend the definition of the influence gap to any number of parties, considering various generalisations, and show that the initial votes count has an even higher predictive power when compared to influence gap than it did in the two-party case. △ Less",
      "url": "https://arxiv.org/abs/2202.03961"
    },
    {
      "title": "Peer Selection with Noisy Assessments",
      "abstract": "In the peer selection problem a group of agents must select a subset of themselves as winners for, e.g., peer-reviewed grants or prizes. Here, we take a Condorcet view of this aggregation problem, i.e., that there is a ground-truth ordering over the agents and we wish to select the best set of agents, subject to the noisy assessments of the peers. Given this model, some agents may be unreliable, while others might be self-interested, attempting to influence the outcome in their favour. In this paper we extend PeerNomination, the most accurate peer reviewing algorithm to date, into WeightedPeerNomination, which is able to handle noisy and inaccurate agents. To do this, we explicitly formulate assessors' reliability weights in a way that does not violate strategyproofness, and use this information to reweight their scores. We show analytically that a weighting scheme can improve the overall accuracy of the selection significantly. Finally, we implement several instances of reweighting methods and show empirically that our methods are robust in the face of noisy assessments. △ Less",
      "url": "https://arxiv.org/abs/2107.10121"
    },
    {
      "title": "Ariel: Enabling planetary science across light-years",
      "abstract": "Ariel, the Atmospheric Remote-sensing Infrared Exoplanet Large-survey, was adopted as the fourth medium-class mission in ESA's Cosmic Vision programme to be launched in 2029. During its 4-year mission, Ariel will study what exoplanets are made of, how they formed and how they evolve, by surveying a diverse sample of about 1000 extrasolar planets, simultaneously in visible and infrared wavelengths. It is the first mission dedicated to measuring the chemical composition and thermal structures of hundreds of transiting exoplanets, enabling planetary science far beyond the boundaries of the Solar System. The payload consists of an off-axis Cassegrain telescope (primary mirror 1100 mm x 730 mm ellipse) and two separate instruments (FGS and AIRS) covering simultaneously 0.5-7.8 micron spectral range. The satellite is best placed into an L2 orbit to maximise the thermal stability and the field of regard. The payload module is passively cooled via a series of V-Groove radiators; the detectors for the AIRS are the only items that require active cooling via an active Ne JT cooler. The Ariel payload is developed by a consortium of more than 50 institutes from 16 ESA countries, which include the UK, France, Italy, Belgium, Poland, Spain, Austria, Denmark, Ireland, Portugal, Czech Republic, Hungary, the Netherlands, Sweden, Norway, Estonia, and a NASA contribution. △ Less",
      "url": "https://arxiv.org/abs/2104.04824"
    },
    {
      "title": "Bounding the Inefficiency of Route Control in Intelligent Transport Systems",
      "abstract": "Route controlled autonomous vehicles could have a significant impact in reducing congestion in the future. Before applying multi-agent reinforcement learning algorithms to route control, we can model the system using a congestion game to predict and mitigate potential issues. We consider the problem of distributed operating systems in a transportation network that control the routing choices of their assigned vehicles. We formulate an associated network control game, consisting of multiple actors seeking to optimise the social welfare of their assigned subpopulations in an underlying nonatomic congestion game. Then we find the inefficiency of the routing equilibria by calculating the Price of Anarchy for polynomial cost functions. Finally, we extend the analysis to allow vehicles to choose their operating system. △ Less",
      "url": "https://arxiv.org/abs/2104.00357"
    },
    {
      "title": "The GAPS Programme at TNG XXVIII -- A pair of hot-Neptunes orbiting the young star TOI-942",
      "abstract": "Both young stars and multi-planet systems are primary objects that allow us to study, understand and constrain planetary formation and evolution theories. We validate the physical nature of two Neptune-type planets transiting TOI-942 (TYC 5909-319-1), a previously unacknowledged young star (50+30-20 Myr) observed by the TESS space mission in Sector 5. Thanks to a comprehensive stellar characterization, TESS light curve modelling and precise radial-velocity measurements, we validated the planetary nature of the TESS candidate and detect an additional transiting planet in the system on a larger orbit. From photometric and spectroscopic observations we performed an exhaustive stellar characterization and derived the main stellar parameters. TOI-942 is a relatively active K2.5V star (logR'hk = -4.17+-0.01) with rotation period Prot = 3.39+-0.01 days, a projected rotation velocity vsini=13.8+-0.5 km/s and a radius of ~0.9 Rsun. We found that the inner planet, TOI-942b, has an orbital period Pb=4.3263+-0.0011 days, a radius Rb=4.242-0.313+0.376 Rearth and a mass upper limit of 16 Mearth at 1-sigma confidence level. The outer planet, TOI-942c, has an orbital period Pc=10.1605-0.0053+0.0056 days, a radius Rc=4.793-0.351+0.410 Rearth and a mass upper limit of 37 Mearth at 1-sigma confidence level. △ Less",
      "url": "https://arxiv.org/abs/2011.13795"
    },
    {
      "title": "PeerNomination: Relaxing Exactness for Increased Accuracy in Peer Selection",
      "abstract": "In peer selection agents must choose a subset of themselves for an award or a prize. As agents are self-interested, we want to design algorithms that are impartial, so that an individual agent cannot affect their own chance of being selected. This problem has broad application in resource allocation and mechanism design and has received substantial attention in the artificial intelligence literature. Here, we present a novel algorithm for impartial peer selection, PeerNomination, and provide a theoretical analysis of its accuracy. Our algorithm possesses various desirable features. In particular, it does not require an explicit partitioning of the agents, as previous algorithms in the literature. We show empirically that it achieves higher accuracy than the exiting algorithms over several metrics. △ Less",
      "url": "https://arxiv.org/abs/2004.14939"
    },
    {
      "title": "Convergence of Opinion Diffusion is PSPACE-complete",
      "abstract": "We analyse opinion diffusion in social networks, where a finite set of individuals is connected in a directed graph and each simultaneously changes their opinion to that of the majority of their influencers. We study the algorithmic properties of the fixed-point behaviour of such networks, showing that the problem of establishing whether individuals converge to stable opinions is PSPACE-complete. △ Less",
      "url": "https://arxiv.org/abs/1912.09864"
    },
    {
      "title": "Reducing selfish routing inefficiencies using traffic lights",
      "abstract": "Traffic congestion games abstract away from the costs of junctions in transport networks, yet, in urban environments, these often impact journey times significantly. In this paper we equip congestion games with traffic lights, modelled as junction-based waiting cycles, therefore enabling more realistic route planning strategies. Using the SUMO simulator, we show that our modelling choices coincide with realistic routing behaviours, in particular, that drivers' decisions about route choices are based on the proportion of red light time for their direction of travel. Drawing upon the experimental results, we show that the effects of the notorious Braess' paradox can be avoided in theory and significantly reduced in practice, by allocating the appropriate traffic light cycles along a transport network. △ Less",
      "url": "https://arxiv.org/abs/1912.06513"
    },
    {
      "title": "Ice Giant Systems: The Scientific Potential of Orbital Missions to Uranus and Neptune",
      "abstract": "Uranus and Neptune, and their diverse satellite and ring systems, represent the least explored environments of our Solar System, and yet may provide the archetype for the most common outcome of planetary formation throughout our galaxy. Ice Giants will be the last remaining class of Solar System planet to have a dedicated orbital explorer, and international efforts are under way to realise such an ambitious mission in the coming decades. In 2019, the European Space Agency released a call for scientific themes for its strategic science planning process for the 2030s and 2040s, known as Voyage 2050. We used this opportunity to review our present-day knowledge of the Uranus and Neptune systems, producing a revised and updated set of scientific questions and motivations for their exploration. This review article describes how such a mission could explore their origins, ice-rich interiors, dynamic atmospheres, unique magnetospheres, and myriad icy satellites, to address questions at the heart of modern planetary science. These two worlds are superb examples of how planets with shared origins can exhibit remarkably different evolutionary paths: Neptune as the archetype for Ice Giants, whereas Uranus may be atypical. Exploring Uranus' natural satellites and Neptune's captured moon Triton could reveal how Ocean Worlds form and remain active, redefining the extent of the habitable zone in our Solar System. For these reasons and more, we advocate that an Ice Giant System explorer should become a strategic cornerstone mission within ESA's Voyage 2050 programme, in partnership with international collaborators, and targeting launch opportunities in the early 2030s. △ Less",
      "url": "https://arxiv.org/abs/1907.02963"
    },
    {
      "title": "Similarity Measures based on Local Game Trees",
      "abstract": "We study strategic similarity of game positions in two-player extensive games of perfect information, by looking at the structure of their local game trees, with the aim of improving the performance of game playing agents in detecting forcing continuations. We present a range of measures over the induced game trees and compare them against benchmark problems in chess, observing a promising level of accuracy in matching up trap states. △ Less",
      "url": "https://arxiv.org/abs/1902.09335"
    },
    {
      "title": "How does information affect asymmetric congestion games?",
      "abstract": "We study traffic networks with multiple origin-destination pairs, relaxing the simplifying assumption of agents having complete knowledge of the network structure. We identify a ubiquitous class of networks, i.e., rings, for which we can safely increase the agents' knowledge without affecting their own overall performance -- known as immunity to Informational Braess' Paradox -- closing a gap in the literature. We also extend our performance measure to include the welfare of all agents, showing that under this measure IBP is a widespread phenomenon and no network is immune to it. △ Less",
      "url": "https://arxiv.org/abs/1902.07083"
    },
    {
      "title": "A network-based rating system and its resistance to bribery",
      "abstract": "We study a rating system in which a set of individuals (e.g., the customers of a restaurant) evaluate a given service (e.g, the restaurant), with their aggregated opinion determining the probability of all individuals to use the service and thus its generated revenue. We explicitly model the influence relation by a social network, with individuals being influenced by the evaluation of their trusted peers. On top of that we allow a malicious service provider (e.g., the restaurant owner) to bribe some individuals, i.e., to invest a part of his or her expected income to modify their opinion, therefore influencing his or her final gain. We analyse the effect of bribing strategies under various constraints, and we show under what conditions the system is bribery-proof, i.e., no bribing strategy yields a strictly positive expected gain to the service provider. △ Less",
      "url": "https://arxiv.org/abs/1602.01258"
    },
    {
      "title": "The EChO science case",
      "abstract": "The discovery of almost 2000 exoplanets has revealed an unexpectedly diverse planet population. Observations to date have shown that our Solar System is certainly not representative of the general population of planets in our Milky Way. The key science questions that urgently need addressing are therefore: What are exoplanets made of? Why are planets as they are? What causes the exceptional diversity observed as compared to the Solar System? EChO (Exoplanet Characterisation Observatory) has been designed as a dedicated survey mission for transit and eclipse spectroscopy capable of observing a large and diverse planet sample within its four-year mission lifetime. EChO can target the atmospheres of super-Earths, Neptune-like, and Jupiter-like planets, in the very hot to temperate zones (planet temperatures of 300K-3000K) of F to M-type host stars. Over the next ten years, several new ground- and space-based transit surveys will come on-line (e.g. NGTS, CHEOPS, TESS, PLATO), which will specifically focus on finding bright, nearby systems. The current rapid rate of discovery would allow the target list to be further optimised in the years prior to EChO's launch and enable the atmospheric characterisation of hundreds of planets. Placing the satellite at L2 provides a cold and stable thermal environment, as well as a large field of regard to allow efficient time-critical observation of targets randomly distributed over the sky. A 1m class telescope is sufficiently large to achieve the necessary spectro-photometric precision. The spectral coverage (0.5-11 micron, goal 16 micron) and SNR to be achieved by EChO, thanks to its high stability and dedicated design, would enable a very accurate measurement of the atmospheric composition and structure of hundreds of exoplanets. △ Less",
      "url": "https://arxiv.org/abs/1502.05747"
    },
    {
      "title": "Computing rational decisions in extensive games with limited foresight",
      "abstract": "We introduce a class of extensive form games where players might not be able to foresee the possible consequences of their decisions and form a model of their opponents which they exploit to achieve a more profitable outcome. We improve upon existing models of games with limited foresight, endowing players with the ability of higher-order reasoning and proposing a novel solution concept to address intuitions coming from real game play. We analyse the resulting equilibria, devising an effective procedure to compute them. △ Less",
      "url": "https://arxiv.org/abs/1502.03683"
    },
    {
      "title": "Equilibrium Refinement through Negotiation in Binary Voting",
      "abstract": "We study voting games on binary issues, where voters hold an objective over the outcome of the collective decision and are allowed, before the vote takes place, to negotiate their voting strategy with the other participants. We analyse the voters' rational behaviour in the resulting two-phase game, showing under what conditions undesirable equilibria can be removed and desirable ones sustained as a consequence of the pre-vote phase. △ Less",
      "url": "https://arxiv.org/abs/1404.5433"
    },
    {
      "title": "Endogenous games with goals: side-payments among goal-directed artificial agents",
      "abstract": "Artificial agents are typically oriented to the realization of an externally assigned task and try to optimize over secondary aspects of plan execution such time lapse or power consumption, technically displaying a quasi-dichotomous preference relation. Boolean games have been developed as a paradigm for modelling societies of agents with this type of preference. In boolean games agents exercise control over propositional variables and strive to achieve a goal formula whose realization might require the opponents' cooperation. Recently, a theory of incentive engineering for such games has been devised, where an external authority steers the outcome of the game towards certain desirable properties consistent with players' goals, by imposing a taxation mechanism on the players that makes the outcomes that do not comply with those properties less appealing to them. The present contribution stems from a complementary perspective and studies, instead, how games with quasi-dichotomous preferences can be transformed from inside, rather than from outside, by endowing players with the possibility of sacrificing a part of their payoff received at a certain outcome in order to convince other players to play a certain strategy. Concretely we explore the properties of endogenous games with goals, obtained coupling strategic games with goals, a generalization of boolean games, with the machinery of endogenous games coming from game theory. We analyze equilibria in those structures, showing the preconditions needed for desirable outcomes to be achieved without external intervention. What our results show is that endogenous games with goals display specific irreducible features - with respect to what already known for endogenous games - which makes them worth studying in their own sake. △ Less",
      "url": "https://arxiv.org/abs/1311.3088"
    },
    {
      "title": "Two-player preplay negotiation games with conditional offers",
      "abstract": "We consider an extension of strategic normal form games with a phase before the actual play of the game, where players can make binding offers for transfer of utilities to other players after the play of the game, contingent on the recipient playing the strategy indicated in the offer. Such offers transform the payoff matrix of the original game but preserve its non-cooperative nature. The type of offers we focus on here are conditional on a suggested 'matching offer' of the same kind made in return by the receiver. Players can exchange a series of such offers, thus engaging in a bargaining process before a strategic normal form game is played. In this paper we study and analyze solution concepts for two-player normal form games with such preplay negotiation phase, under several assumptions for the bargaining power of the players, such as the possibility of withdrawing previously made offers and opting out from the negotiation process, as well as the value of time for the players in such negotiations. We obtain results describing the possible solutions of such bargaining games and analyze the degrees of efficiency and fairness that can be achieved in such negotiation process. △ Less",
      "url": "https://arxiv.org/abs/1304.2161"
    },
    {
      "title": "Non-cooperative games with preplay negotiations",
      "abstract": "We consider an extension of strategic normal form games with a phase of negotiations before the actual play of the game, where players can make binding offers for transfer of utilities to other players after the play of the game, in order to provide additional incentives for each other to play designated strategies. Such offers are conditional on the recipients playing the specified strategies and they effect transformations of the payoff matrix of the game by accordingly transferring payoffs between players. We introduce and analyze solution concepts for 2-player normal form games with such preplay offers under various assumptions for the preplay negotiation phase and obtain results for existence of efficient negotiation strategies of the players. Then we extend the framework to coalitional preplay offers in N-player games, as well as to extensive form games with inter-play offers for side payments. △ Less",
      "url": "https://arxiv.org/abs/1208.1718"
    }
  ]
}