{
  "author": "Piotr Skowron",
  "results": [
    {
      "title": "Drawing a Map of Elections",
      "abstract": "Our main contribution is the introduction of the map of elections framework. A map of elections consists of three main elements: (1) a dataset of elections (i.e., collections of ordinal votes over given sets of candidates), (2) a way of measuring similarities between these elections, and (3) a representation of the elections in the 2D Euclidean space as points, so that the more similar two elections are, the closer are their points. In our maps, we mostly focus on datasets of synthetic elections, but we also show an example of a map over real-life ones. To measure similarities, we would have preferred to use, e.g., the isomorphic swap distance, but this is infeasible due to its high computational complexity. Hence, we propose polynomial-time computable positionwise distance and use it instead. Regarding the representations in 2D Euclidean space, we mostly use the Kamada-Kawai algorithm, but we also show two alternatives. We develop the necessary theoretical results to form our maps and argue experimentally that they are accurate and credible. Further, we show how coloring the elections in a map according to various criteria helps in analyzing results of a number of experiments. In particular, we show colorings according to the scores of winning candidates or committees, running times of ILP-based winner determination algorithms, and approximation ratios achieved by particular algorithms. △ Less",
      "url": "https://arxiv.org/abs/2504.03809"
    },
    {
      "title": "Proportionality in Thumbs Up and Down Voting",
      "abstract": "Consider the decision-making setting where agents elect a panel by expressing both positive and negative preferences. Prominently, in constitutional AI, citizens democratically select a slate of ethical preferences on which a foundation model is to be trained. There, in practice, agents may both approve and disapprove of different ethical principles. Proportionality has been well-studied in computational social choice for approval ballots, but its meaning remains unclear when negative sentiments are also considered. In this work, we propose two conceptually distinct approaches to interpret proportionality in the presence of up and down votes. The first approach treats the satisfaction from electing candidates and the impact of vetoing them as comparable, leading to combined proportionality guarantees. The second approach considers veto power separately, introducing guarantees distinct from traditional proportionality. We formalize axioms for each perspective and examine their satisfiability by suitable adaptations of Phragmén's rule, Proportional Approval Voting rule and the Method of Equal Shares. △ Less",
      "url": "https://arxiv.org/abs/2503.01985"
    },
    {
      "title": "Proportional Selection in Networks",
      "abstract": "We address the problem of selecting $k$ representative nodes from a network, aiming to achieve two objectives: identifying the most influential nodes and ensuring the selection proportionally reflects the network's diversity. We propose two approaches to accomplish this, analyze them theoretically, and demonstrate their effectiveness through a series of experiments. △ Less",
      "url": "https://arxiv.org/abs/2502.03545"
    },
    {
      "title": "Method of Equal Shares with Bounded Overspending",
      "abstract": "In participatory budgeting (PB), voters decide through voting which subset of projects to fund within a given budget. Proportionality in the context of PB is crucial to ensure equal treatment of all groups of voters. However, pure proportional rules can sometimes lead to suboptimal outcomes. We introduce the Method of Equal Shares with Bounded Overspending (BOS Equal Shares), a robust variant of Equal Shares that balances proportionality and efficiency. BOS Equal Shares addresses inefficiencies implied by strict proportionality axioms, yet the rule still provides fairness guarantees, similar to the original Method of Equal Shares. Our extensive empirical analysis on real-world PB instances shows excellent performance of BOS Equal Shares across several metrics. In the course of the analysis, we also present and examine a fractional variant of the Method of Equal Shares which allows for partial funding of projects. △ Less",
      "url": "https://arxiv.org/abs/2409.15005"
    },
    {
      "title": "Strategic Cost Selection in Participatory Budgeting",
      "abstract": "We study strategic behavior of project proposers in the context of approval-based participatory budgeting (PB). In our model we assume that the votes are fixed and known and the proposers want to set as high project prices as possible, provided that their projects get selected and the prices are not below the minimum costs of their delivery. We study the existence of pure Nash equilibria (NE) in such games, focusing on the AV/Cost, Phragmén, and Method of Equal Shares rules. Furthermore, we report an experimental study of strategic cost selection on real-life PB election data. △ Less",
      "url": "https://arxiv.org/abs/2407.18092"
    },
    {
      "title": "Evaluation of Project Performance in Participatory Budgeting",
      "abstract": "We study ways of evaluating the performance of losing projects in participatory budgeting (PB) elections by seeking actions that would have led to their victory. We focus on lowering the projects' costs, obtaining additional approvals for them, and asking supporters to refrain from approving other projects: The larger a change is needed, the less successful is the given project. We seek efficient algorithms for computing our measures and we analyze and compare them experimentally. We focus on the greedyAV, Phragmén, and Equal-Shares PB rules. △ Less",
      "url": "https://arxiv.org/abs/2312.14723"
    },
    {
      "title": "A Generalised Theory of Proportionality in Collective Decision Making",
      "abstract": "We consider a voting model, where a number of candidates need to be selected subject to certain feasibility constraints. The model generalises committee elections (where there is a single constraint on the number of candidates that need to be selected), various elections with diversity constraints, the model of public decisions (where decisions needs to be taken on a number of independent issues), and the model of collective scheduling. A critical property of voting is that it should be fair -- not only to individuals but also to groups of voters with similar opinions on the subject of the vote; in other words, the outcome of an election should proportionally reflect the voters' preferences. We formulate axioms of proportionality in this general model. Our axioms do not require predefining groups of voters; to the contrary, we ensure that the opinion of every subset of voters whose preferences are cohesive-enough are taken into account to the extent that is proportional to the size of the subset. Our axioms generalise the strongest known satisfiable axioms for the more specific models. We explain how to adapt two prominent committee election rules, Proportional Approval Voting (PAV) and Phragmén Sequential Rule, as well as the concept of stable-priceability to our general model. The two rules satisfy our proportionality axioms if and only if the feasibility constraints are matroids. △ Less",
      "url": "https://arxiv.org/abs/2307.06077"
    },
    {
      "title": "Participatory Budgeting: Data, Tools, and Analysis",
      "abstract": "We provide a library of participatory budgeting data (Pabulib) and open source tools (Pabutools and Pabustats) for analysing this data. We analyse how the results of participatory budgeting elections would change if a different selection rule was applied. We provide evidence that the outcomes of the Method of Equal Shares would be considerably fairer than those of the Utilitarian Greedy rule that is currently in use. We also show that the division of the projects into districts and/or categories can in many cases be avoided when using proportional rules. We find that this would increase the overall utility of the voters. △ Less",
      "url": "https://arxiv.org/abs/2305.11035"
    },
    {
      "title": "Online Approval Committee Elections",
      "abstract": "Assume $k$ candidates need to be selected. The candidates appear over time. Each time one appears, it must be immediately selected or rejected -- a decision that is made by a group of individuals through voting. Assume the voters use approval ballots, i.e., for each candidate they only specify whether they consider it acceptable or not. This setting can be seen as a voting variant of choosing $k$ secretaries. Our contribution is twofold. (1) We assess to what extent the committees that are computed online can proportionally represent the voters. (2) If a prior probability over candidate approvals is available, we show how to compute committees with maximal expected score. △ Less",
      "url": "https://arxiv.org/abs/2202.06830"
    },
    {
      "title": "Phragmén Rules for Degressive and Regressive Proportionality",
      "abstract": "We study two concepts of proportionality in the model of approval-based committee elections. In degressive proportionality small minorities of voters are favored in comparison with the standard linear proportionality. Regressive proportionality, on the other hand, requires that larger subdivisions of voters are privileged. We introduce a new family of rules that broadly generalize Phragmén's Sequential Rule spanning the spectrum between degressive and regressive proportionality. We analyze and compare the two principles of proportionality assuming the voters and the candidates can be represented as points in an Euclidean issue space. △ Less",
      "url": "https://arxiv.org/abs/2201.04248"
    },
    {
      "title": "Axiomatic characterizations of consistent approval-based committee choice rules",
      "abstract": "We prove axiomatic characterizations of several important multiwinner rules within the class of approval-based committee choice rules. These are voting rules that return a set of (fixed-size) committees. In particular, we provide axiomatic characterizations of Proportional Approval Voting, the Chamberlin--Courant rule, and other Thiele methods. These rules share the important property that they satisfy an axiom called consistency, which is crucial in our characterizations. △ Less",
      "url": "https://arxiv.org/abs/2112.10407"
    },
    {
      "title": "The OGLE Collection of Variable Stars. One Thousand Heartbeat Stars in the Galactic Bulge and Magellanic Clouds",
      "abstract": "We present a collection of 991 heartbeat star (HBS) candidates found in the Optical Gravitational Lensing Experiment (OGLE) project data archive. We discuss the selection process of the HBS candidates and the structure of the catalog itself. It consists of 512 stars located toward the Galactic bulge (GB), 439 stars located in the Large Magellanic Cloud (LMC), and 40 in the Small Magellanic Cloud (SMC). The collection contains two large groups of HBSs with different physical properties. The main distinction between the two groups is the evolutionary status of the primary star. The first group of about 100 systems contains a hot main-sequence (MS) or a Hertzsprung-gap primary star, while the second group of about 900 systems includes a red giant (RG). For each star, we provide two-decade-long time-series photometry, in the Cousins $I$- and Johnson $V$-band filters, obtained by the OGLE project. We also present basic observational information as well as orbital parameters derived from the light curve modeling. △ Less",
      "url": "https://arxiv.org/abs/2109.14616"
    },
    {
      "title": "Core-Stable Committees under Restricted Domains",
      "abstract": "We study the setting of committee elections, where a group of individuals needs to collectively select a given size subset of available objects. This model is relevant for a number of real-life scenarios including political elections, participatory budgeting, and facility-location. We focus on the core -- the classic notion of proportionality, stability and fairness. We show that for a number of restricted domains including voter-interval, candidate-interval, single-peaked, and single-crossing preferences the core is non-empty and can be found in polynomial time. We show that the core might be empty for strict top-monotonic preferences, yet we introduce a relaxation of this class, which guarantees non-emptiness of the core. Our algorithms work both in the randomized and discrete models. We also show that the classic known proportional rules do not return committees from the core even for the most restrictive domains among those we consider (in particular for 1D-Euclidean preferences). We additionally prove a number of structural results that give better insights into the nature of some of the restricted domains, and which in particular give a better intuitive understanding of the class of top-monotonic preferences. △ Less",
      "url": "https://arxiv.org/abs/2108.01987"
    },
    {
      "title": "Bribery as a Measure of Candidate Success: Complexity Results for Approval-Based Multiwinner Rules",
      "abstract": "We study the problem of bribery in multiwinner elections, for the case where the voters cast approval ballots (i.e., sets of candidates they approve) and the bribery actions are limited to: adding an approval to a vote, deleting an approval from a vote, or moving an approval within a vote from one candidate to the other. We consider a number of approval-based multiwinner rules (AV, SAV, GAV, RAV, approval-based Chamberlin--Courant, and PAV). We find the landscape of complexity results quite rich, going from polynomial-time algorithms through NP-hardness with constant-factor approximations, to outright inapproximability. Moreover, in general, our problems tend to be easier when we limit out bribery actions on increasing the number of approvals of the candidate that we want to be in a winning committee (i.e., adding approvals only for this preferred candidate, or moving approvals only to him or her). We also study parameterized complexity of our problems, with a focus on parameterizations by the numbers of voters or candidates. △ Less",
      "url": "https://arxiv.org/abs/2104.09130"
    },
    {
      "title": "Participatory Budgeting with Cumulative Votes",
      "abstract": "In participatory budgeting we are given a set of projects---each with a cost, an available budget, and a set of voters who in some form express their preferences over the projects. The goal is to select---based on voter preferences---a subset of projects whose total cost does not exceed the budget. We propose several aggregation methods based on the idea of cumulative votes, e.g., for the setting when each voter is given one coin and she specifies how this coin should be split among the projects. We compare our aggregation methods based on (1) axiomatic properties, and (2) computer simulations. We identify one method, Minimal Transfers over Costs, that demonstrates particularly desirable behavior. In particular, it significantly improves on existing methods, satisfies a strong notion of proportionality, and, thus, is promising to be used in practice. △ Less",
      "url": "https://arxiv.org/abs/2009.02690"
    },
    {
      "title": "Proportional Participatory Budgeting with Additive Utilities",
      "abstract": "We study voting rules for participatory budgeting, where a group of voters collectively decides which projects should be funded using a common budget. We allow the projects to have arbitrary costs, and the voters to have arbitrary additive valuations over the projects. We formulate an axiom (Extended Justified Representation, EJR) that guarantees proportional representation to groups of voters with common interests. We propose a simple and attractive voting rule called the Method of Equal Shares that satisfies this axiom for arbitrary costs and approval utilities, and that satisfies the axiom up to one project for arbitrary additive valuations. This method can be computed in polynomial time. In contrast, we show that the standard method for achieving proportionality in committee elections, Proportional Approval Voting (PAV), cannot be extended to work with arbitrary costs. Finally, we introduce a strengthened axiom (Full Justified Representation, FJR) and show that it is also satisfiable, though by a computationally more expensive and less natural voting rule. △ Less",
      "url": "https://arxiv.org/abs/2008.13276"
    },
    {
      "title": "Multi-Winner Voting with Approval Preferences",
      "abstract": "Multi-winner voting is the process of selecting a fixed-size set of representative candidates based on voters' preferences. It occurs in applications ranging from politics (parliamentary elections) to the design of modern computer applications (collaborative filtering, dynamic Q&A platforms, diversifying search results). All these applications share the problem of identifying a representative subset of alternatives -- and the study of multi-winner voting is the principled analysis of this task. This book provides a thorough and in-depth look at multi-winner voting based on approval preferences. One speaks of approval preferences if voters express their preferences by providing a set of candidates they approve. Approval preferences thus separate candidates in approved and disapproved ones, a simple, binary classification. The corresponding multi-winner voting rules are called approval-based committee (ABC) rules. Due to the simplicity of approval preferences, ABC rules are widely suitable for practical use. Recent years have seen a rising interest in ABC voting. While multi-winner voting has been originally a topic studied by economists and political scientists, a significant share of recent progress has occurred in the field of computational social choice. This discipline is situated in the intersection of artificial intelligence, computer science, economics, and (to a lesser degree) political science, combining insights and methods from these distinct fields. The goal of this book is to present fundamental concepts and results for ABC voting and to discuss the recent advances in computational social choice. The main focus is on axiomatic analysis, algorithmic results, and relevant applications. △ Less",
      "url": "https://arxiv.org/abs/2007.01795"
    },
    {
      "title": "Proportionality and the Limits of Welfarism",
      "abstract": "We study two influential voting rules proposed in the 1890s by Phragmén and Thiele, which elect a committee or parliament of k candidates which proportionally represents the voters. Voters provide their preferences by approving an arbitrary number of candidates. Previous work has proposed proportionality axioms satisfied by Thiele's rule (now known as Proportional Approval Voting, PAV) but not by Phragmén's rule. By proposing two new proportionality axioms (laminar proportionality and priceability) satisfied by Phragmén but not Thiele, we show that the two rules achieve two distinct forms of proportional representation. Phragmén's rule ensures that all voters have a similar amount of influence on the committee, and Thiele's rule ensures a fair utility distribution. Thiele's rule is a welfarist voting rule (one that maximizes a function of voter utilities). We show that no welfarist rule can satisfy our new axioms, and we prove that no such rule can satisfy the core. Conversely, some welfarist fairness properties cannot be guaranteed by Phragmén-type rules. This formalizes the difference between the two types of proportionality. We then introduce an attractive committee rule, the Method of Equal Shares, which satisfies a property intermediate between the core and extended justified representation (EJR). It satisfies laminar proportionality, priceability, and is computable in polynomial time. We show that our new rule provides a logarithmic approximation to the core. On the other hand, PAV provides a factor-2 approximation to the core, and this factor is optimal for rules that are fair in the sense of the Pigou--Dalton principle. △ Less",
      "url": "https://arxiv.org/abs/1911.11747"
    },
    {
      "title": "Matchings under Preferences: Strength of Stability and Trade-offs",
      "abstract": "We propose two solution concepts for matchings under preferences: robustness and near stability. The former strengthens while the latter relaxes the classic definition of stability by Gale and Shapley (1962). Informally speaking, robustness requires that a matching must be stable in the classic sense, even if the agents slightly change their preferences. Near stability, on the other hand, imposes that a matching must become stable (again, in the classic sense) provided the agents are willing to adjust their preferences a bit. Both of our concepts are quantitative; together they provide means for a fine-grained analysis of stability for matchings. Moreover, our concepts allow to explore the trade-offs between stability and other criteria of societal optimality, such as the egalitarian cost and the number of unmatched agents. We investigate the computational complexity of finding matchings that implement certain predefined trade-offs. We provide a polynomial-time algorithm that given agents' preferences returns a socially optimal robust matching, and we prove that finding a socially optimal and nearly stable matching is computationally hard. △ Less",
      "url": "https://arxiv.org/abs/1902.10535"
    },
    {
      "title": "Comparing Election Methods Where Each Voter Ranks Only Few Candidates",
      "abstract": "Election rules are formal processes that aggregate voters preferences, typically to select a single candidate, called the winner. Most of the election rules studied in the literature require the voters to rank the candidates from the most to the least preferred one. This method of eliciting preferences is impractical when the number of candidates to be ranked is large. We ask how well certain election rules (focusing on positional scoring rules and the Minimax rule) can be approximated from partial preferences collected through one of the following procedures: (i) randomized-we ask each voter to rank a random subset of $\\ell$ candidates, and (ii) deterministic-we ask each voter to provide a ranking of her $\\ell$ most preferred candidates (the $\\ell$-truncated ballot). We establish theoretical bounds on the approximation ratios and we complement our theoretical analysis with computer simulations. We find that mostly (apart from the cases when the preferences have no or very little structure) it is better to use the randomized approach. While we obtain fairly good approximation guarantees for the Borda rule already for $\\ell = 2$, for approximating the Minimax rule one needs to ask each voter to compare a larger set of candidates in order to obtain good guarantees. △ Less",
      "url": "https://arxiv.org/abs/1901.10848"
    },
    {
      "title": "What Do Multiwinner Voting Rules Do? An Experiment Over the Two-Dimensional Euclidean Domain",
      "abstract": "We visualize aggregate outputs of popular multiwinner voting rules--SNTV, STV, Bloc, k-Borda, Monroe, Chamberlin--Courant, and HarmonicBorda--for elections generated according to the two-dimensional Euclidean model. We consider three applications of multiwinner voting, namely, parliamentary elections, portfolio/movie selection, and shortlisting, and use our results to understand which of our rules seem to be best suited for each application. In particular, we show that STV (one of the few nontrivial rules used in real high-stake elections) exhibits excellent performance, whereas the Bloc rule (also often used in practice) performs poorly. △ Less",
      "url": "https://arxiv.org/abs/1901.09217"
    },
    {
      "title": "Approval-Based Elections and Distortion of Voting Rules",
      "abstract": "We consider elections where both voters and candidates can be associated with points in a metric space and voters prefer candidates that are closer to those that are farther away. It is often assumed that the optimal candidate is the one that minimizes the total distance to the voters. Yet, the voting rules often do not have access to the metric space $M$ and only see preference rankings induced by $M$.Consequently, they often are incapable of selecting the optimal candidate. The distortion of a voting rule measures the worst-case loss of the quality being the result of having access only to preference rankings. We extend the idea of distortion to approval-based preferences. First, we compute the distortion of Approval Voting. Second, we introduce the concept of acceptability-based distortion---the main idea behind is that the optimal candidate is the one that is acceptable to most voters. We determine acceptability-distortion for a number of rules, including Plurality, Borda, $k$-Approval, Veto, the Copeland's rule, Ranked Pairs, the Schulze's method, and STV. △ Less",
      "url": "https://arxiv.org/abs/1901.06709"
    },
    {
      "title": "Proportionality Degree of Multiwinner Rules",
      "abstract": "We study multiwinner elections with approval-based preferences. An instance of a multiwinner election consists of a set of alternatives, a population of voters---each voter approves a subset of alternatives, and the desired committee size $k$; the goal is to select a committee (a~subset) of $k$ alternatives according to the preferences of the voters. We investigate a number of election rules and ask whether the committees that they return represent the voters proportionally. In contrast to the classic literature, we employ quantitative techniques that allow to measure the extent to which the considered rules are proportional. This allows us to arrange the rules in a clear hierarchy. For example, we find that Proportional Approval Voting (PAV) has better proportionality guarantees than its sequential counterpart, and that Phragmén's Sequential Rule is worse than Sequential PAV. Yet, the loss of proportionality for the two sequential rules is moderate and in some contexts can be outweighed by their other appealing properties. Finally, we measure the tradeoff between proportionality and utilitarian efficiency for a broad subclass of committee election rules. △ Less",
      "url": "https://arxiv.org/abs/1810.08799"
    },
    {
      "title": "The late type eclipsing binaries in the Large Magellanic Cloud: catalogue of fundamental physical parameters",
      "abstract": "We present a determination of precise fundamental physical parameters of twenty detached, double- lined, eclipsing binary stars in the Large Magellanic Cloud (LMC) containing G- or early K-type giant stars. Eleven are new systems, the remaining nine are systems already analyzed by our team for which we present updated parameters. The catalogue results from our long-term survey of eclipsing binaries in the Magellanic Clouds suitable for high-precision determination of distances (the Araucaria project). The V-band brightnesses of the systems range from 15.4 mag to 17.7 mag and their orbital periods range from 49 days to 773 days. Six systems have favorable geometry showing total eclipses. The absolute dimensions of all eclipsing binary components are calculated with a precision of better than 3% and all systems are suitable for a precise distance determination. The measured stellar masses are in the range 1.4 to 4.6 M_sun and comparison with the MESA isochrones gives ages between 0.1 and 2.1 Gyr. The systems show some weak age-metallicity relation. Two systems have components with very different masses: OGLE LMC-ECL-05430 and OGLE LMC-ECL-18365. Neither system can be fitted by single stellar evolution isochrone, explained by a past mass transfer scenario in the case of ECL-18365 and a gravitational capture or a hierarchical binary merger scenario in the case of ECL-05430. The longest period system OGLE LMC SC9 230659 shows a surprising apsidal motion which shifts the apparent position of the eclipses. In one spectrum of OGLE LMC-ECL-12669 we noted a peculiar dimming of one of the components by 65% well outside of the eclipses. We interpret this observation as arising from an extremely rare occultation event as a foreground Galactic object covers only one component of an extragalactic eclipsing binary. △ Less",
      "url": "https://arxiv.org/abs/1805.04952"
    },
    {
      "title": "Collective Schedules: Scheduling Meets Computational Social Choice",
      "abstract": "When scheduling public works or events in a shared facility one needs to accommodate preferences of a population. We formalize this problem by introducing the notion of a collective schedule. We show how to extend fundamental tools from social choice theory---positional scoring rules, the Kemeny rule and the Condorcet principle---to collective scheduling. We study the computational complexity of finding collective schedules. We also experimentally demonstrate that optimal collective schedules can be found for instances with realistic sizes. △ Less",
      "url": "https://arxiv.org/abs/1803.07484"
    },
    {
      "title": "Committee Scoring Rules: Axiomatic Characterization and Hierarchy",
      "abstract": "Committee scoring voting rules are multiwinner analogues of positional scoring rules which constitute an important subclass of single-winner voting rules. We identify several natural subclasses of committee scoring rules, namely, weakly separable, representation-focused, top-$k$-counting, OWA-based, and decomposable rules. We characterize SNTV, Bloc, and $k$-Approval Chamberlin--Courant as the only nontrivial rules in pairwise intersections of these classes. We provide some axiomatic characterizations for these classes, where monotonicity properties appear to be especially useful. The class of decomposable rules is new to the literature. We show that it strictly contains the class of OWA-based rules and describe some of the applications of decomposable rules. △ Less",
      "url": "https://arxiv.org/abs/1802.06483"
    },
    {
      "title": "Stable Marriage with Multi-Modal Preferences",
      "abstract": "We introduce a generalized version of the famous Stable Marriage problem, now based on multi-modal preference lists. The central twist herein is to allow each agent to rank its potentially matching counterparts based on more than one \"evaluation mode\" (e.g., more than one criterion); thus, each agent is equipped with multiple preference lists, each ranking the counterparts in a possibly different way. We introduce and study three natural concepts of stability, investigate their mutual relations and focus on computational complexity aspects with respect to computing stable matchings in these new scenarios. Mostly encountering computational hardness (NP-hardness), we can also spot few islands of tractability and make a surprising connection to the \\textsc{Graph Isomorphism} problem. △ Less",
      "url": "https://arxiv.org/abs/1801.02693"
    },
    {
      "title": "Utilitarian Welfare and Representation Guarantees of Approval-Based Multiwinner Rules",
      "abstract": "To choose a suitable multiwinner voting rule is a hard and ambiguous task. Depending on the context, it varies widely what constitutes the choice of an ``optimal'' subset of alternatives. In this paper, we provide a quantitative analysis of multiwinner voting rules using methods from the theory of approximation algorithms---we estimate how well multiwinner rules approximate two extreme objectives: a representation criterion defined via the Approval Chamberlin--Courant rule and a utilitarian criterion defined via Multiwinner Approval Voting. With both theoretical and experimental methods, we classify multiwinner rules in terms of their quantitative alignment with these two opposing objectives. Our results provide fundamental information about the nature of multiwinner rules and, in particular, about the necessary tradeoffs when choosing such a rule. △ Less",
      "url": "https://arxiv.org/abs/1801.01527"
    },
    {
      "title": "Multiwinner Elections with Diversity Constraints",
      "abstract": "We develop a model of multiwinner elections that combines performance-based measures of the quality of the committee (such as, e.g., Borda scores of the committee members) with diversity constraints. Specifically, we assume that the candidates have certain attributes (such as being a male or a female, being junior or senior, etc.) and the goal is to elect a committee that, on the one hand, has as high a score regarding a given performance measure, but that, on the other hand, meets certain requirements (e.g., of the form \"at least $30\\%$ of the committee members are junior candidates and at least $40\\%$ are females\"). We analyze the computational complexity of computing winning committees in this model, obtaining polynomial-time algorithms (exact and approximate) and NP-hardness results. We focus on several natural classes of voting rules and diversity constraints. △ Less",
      "url": "https://arxiv.org/abs/1711.06527"
    },
    {
      "title": "Fair Knapsack",
      "abstract": "We study the following multiagent variant of the knapsack problem. We are given a set of items, a set of voters, and a value of the budget; each item is endowed with a cost and each voter assigns to each item a certain value. The goal is to select a subset of items with the total cost not exceeding the budget, in a way that is consistent with the voters' preferences. Since the preferences of the voters over the items can vary significantly, we need a way of aggregating these preferences, in order to select the socially best valid knapsack. We study three approaches to aggregating voters' preferences, which are motivated by the literature on multiwinner elections and fair allocation. This way we introduce the concepts of individually best, diverse, and fair knapsack. We study the computational complexity (including parameterized complexity, and complexity under restricted domains) of the aforementioned multiagent variants of knapsack. △ Less",
      "url": "https://arxiv.org/abs/1711.04520"
    },
    {
      "title": "Mixed Integer Programming with Convex/Concave Constraints: Fixed-Parameter Tractability and Applications to Multicovering and Voting",
      "abstract": "A classic result of Lenstra [Math.~Oper.~Res.~1983] says that an integer linear program can be solved in fixed-parameter tractable (FPT) time for the parameter being the number of variables. We extend this result by incorporating non-decreasing piecewise linear convex or concave functions to our (mixed) integer programs. This general technique allows us to establish parameterized complexity of a number of classic computational problems. In particular, we prove that Weighted Set Multicover is in FPT when parameterized by the number of elements to cover, and that there exists an FPT-time approximation scheme for Multiset Multicover for the same parameter. Further, we use our general technique to prove that a number of problems from computational social choice (e.g., problems related to bribery and control in elections) are in FPT when parameterized by the number of candidates. For bribery, this resolves a nearly 10-year old family of open problems, and for weighted electoral control of Approval voting, this improves some previously known XP-memberships to FPT-memberships. △ Less",
      "url": "https://arxiv.org/abs/1709.02850"
    },
    {
      "title": "Robustness Among Multiwinner Voting Rules",
      "abstract": "We investigate how robust the results of committee elections are to small changes in the input preference orders, depending on the voting rules used. We find that for typical rules the effect of making a single swap of adjacent candidates in a single preference order is either that (1) at most one committee member might be replaced, or (2) it is possible that the whole committee will be replaced. We also show that the problem of computing the smallest number of swaps that lead to changing the election outcome is typically NP-hard, but there are natural FPT algorithms. Finally, for a number of rules we assess experimentally the average number of random swaps necessary to change the election result. △ Less",
      "url": "https://arxiv.org/abs/1707.01417"
    },
    {
      "title": "Consistent Approval-Based Multi-Winner Rules",
      "abstract": "This paper is an axiomatic study of consistent approval-based multi-winner rules, i.e., voting rules that select a fixed-size group of candidates based on approval ballots. We introduce the class of counting rules and provide an axiomatic characterization of this class based on the consistency axiom. Building upon this result, we axiomatically characterize three important consistent multi-winner rules: Proportional Approval Voting, Multi-Winner Approval Voting and the Approval Chamberlin--Courant rule. Our results demonstrate the variety of multi-winner rules and illustrate three different, orthogonal principles that multi-winner voting rules may represent: individual excellence, diversity, and proportionality. △ Less",
      "url": "https://arxiv.org/abs/1704.02453"
    },
    {
      "title": "Proportional Approval Voting, Harmonic k-median, and Negative Association",
      "abstract": "We study a generic framework that provides a unified view on two important classes of problems: (i) extensions of the k-median problem where clients are interested in having multiple facilities in their vicinity (e.g., due to the fact that, with some small probability, the closest facility might be malfunctioning and so might not be available for using), and (ii) finding winners according to some appealing multiwinner election rules, i.e., election system aimed for choosing representatives bodies, such as parliaments, based on preferences of a population of voters over individual candidates. Each problem in our framework is associated with a vector of weights: we show that the approximability of the problem depends on structural properties of these vectors. We specifically focus on the harmonic sequence of weights for which the objective function interpreted in a multiwinner election setup reflects to the well-known Proportional Approval Voting (PAV) rule. Our main result is that, due to the specific (harmonic) structure of weights, the problem allows constant factor approximation. This is surprising since the problem can be interpreted as a variant of the k-median problem where we do not assume that the connection costs satisfy the triangle inequality. The algorithm we propose is based on dependent rounding [Srinivasan, FOCS'01] applied to the solution of a natural LP-relaxation of the problem. The rounding process is well known to produce distributions over integral solutions satisfying Negative Correlation (NC), which is usually sufficient for the analysis of approximation guarantees offered by rounding procedures. In our analysis, however, we need to use the fact that the carefully implemented rounding process satisfies a stronger property, called Negative Association (NA), which allows us to apply standard concentration bounds for conditional random variables. △ Less",
      "url": "https://arxiv.org/abs/1704.02183"
    },
    {
      "title": "Optimal Average Satisfaction and Extended Justified Representation in Polynomial Time",
      "abstract": "In this short note, we describe an approval-based committee selection rule that admits a polynomial-time algorithm and satisfies the Extended Justified Representation (EJR) axiom. This rule is based on approximately maximizing the PAV score, by means of local search. Our proof strategy is to show that this rule provides almost optimal average satisfaction to all cohesive groups of voters, and that high average satisfaction for cohesive groups implies extended justified representation. △ Less",
      "url": "https://arxiv.org/abs/1704.00293"
    },
    {
      "title": "The Condorcet Principle for Multiwinner Elections: From Shortlisting to Proportionality",
      "abstract": "We study two notions of stability in multiwinner elections that are based on the Condorcet criterion. The first notion was introduced by Gehrlein: A committee is stable if each committee member is preferred to each non-member by a (possibly weak) majority of voters. The second notion is called local stability (introduced in this paper): A size-$k$ committee is locally stable in an election with $n$ voters if there is no candidate $c$ and no group of more than $\\frac{n}{k+1}$ voters such that each voter in this group prefers $c$ to each committee member. We argue that Gehrlein-stable committees are appropriate for shortlisting tasks, and that locally stable committees are better suited for applications that require proportional representation. The goal of this paper is to analyze these notions in detail, explore their compatibility with notions of proportionality, and investigate the computational complexity of related algorithmic tasks. △ Less",
      "url": "https://arxiv.org/abs/1701.08023"
    },
    {
      "title": "Proportional Rankings",
      "abstract": "In this paper we extend the principle of proportional representation to rankings. We consider the setting where alternatives need to be ranked based on approval preferences. In this setting, proportional representation requires that cohesive groups of voters are represented proportionally in each initial segment of the ranking. Proportional rankings are desirable in situations where initial segments of different lengths may be relevant, e.g., hiring decisions (if it is unclear how many positions are to be filled), the presentation of competing proposals on a liquid democracy platform (if it is unclear how many proposals participants are taking into consideration), or recommender systems (if a ranking has to accommodate different user types). We study the proportional representation provided by several ranking methods and prove theoretical guarantees. Furthermore, we experimentally evaluate these methods and present preliminary evidence as to which methods are most suitable for producing proportional rankings. △ Less",
      "url": "https://arxiv.org/abs/1612.01434"
    },
    {
      "title": "Proportional Justified Representation",
      "abstract": "The goal of multi-winner elections is to choose a fixed-size committee based on voters' preferences. An important concern in this setting is representation: large groups of voters with cohesive preferences should be adequately represented by the election winners. Recently, Aziz et al. (2015a;2017) proposed two axioms that aim to capture this idea: justified representation (JR) and its strengthening extended justified representation (EJR). In this paper, we extend the work of Aziz et al. in several directions. First, we answer an open question of Aziz et al., by showing that Reweighted Approval Voting satisfies JR for $k=3, 4, 5$, but fails it for $k\\ge 6$. Second, we observe that EJR is incompatible with the Perfect Representation criterion, which is important for many applications of multi-winner voting, and propose a relaxation of EJR, which we call Proportional Justified Representation (PJR). PJR is more demanding than JR, but, unlike EJR, it is compatible with perfect representation, and a committee that provides PJR can be computed in polynomial time if the committee size divides the number of voters. Moreover, just like EJR, PJR can be used to characterize the classic PAV rule in the class of weighted PAV rules. On the other hand, we show that EJR provides stronger guarantees with respect to average voter satisfaction than PJR does. △ Less",
      "url": "https://arxiv.org/abs/1611.09928"
    },
    {
      "title": "Multiwinner Approval Rules as Apportionment Methods",
      "abstract": "We establish a link between multiwinner elections and apportionment problems by showing how approval-based multiwinner election rules can be interpreted as methods of apportionment. We consider several multiwinner rules and observe that they induce apportionment methods that are well-established in the literature on proportional representation. For instance, we show that Proportional Approval Voting induces the D'Hondt method and that Monroe's rule induces the largest reminder method. We also consider properties of apportionment methods and exhibit multiwinner rules that induce apportionment methods satisfying these properties. △ Less",
      "url": "https://arxiv.org/abs/1611.08691"
    },
    {
      "title": "What Do We Elect Committees For? A Voting Committee Model for Multi-Winner Rules",
      "abstract": "We present a new model that describes the process of electing a group of representatives (e.g., a parliament) for a group of voters. In this model, called the voting committee model, the elected group of representatives runs a number of ballots to make final decisions regarding various issues. The satisfaction of voters comes from the final decisions made by the elected committee. Our results suggest that depending on a decision system used by the committee to make these final decisions, different multi-winner election rules are most suitable for electing the committee. Furthermore, we show that if we allow not only a committee, but also an election rule used to make final decisions, to depend on the voters' preferences, we can obtain an even better representation of the voters. △ Less",
      "url": "https://arxiv.org/abs/1611.06858"
    },
    {
      "title": "Modeling Representation of Minorities Under Multiwinner Voting Rules",
      "abstract": "The goal of this paper is twofold. First and foremost, we aim to experimentally and quantitatively show that the choice of a multiwinner voting rule can play a crucial role on the way minorities are represented. We also test the possibility for some of these rules to achieve proportional representation. △ Less",
      "url": "https://arxiv.org/abs/1604.02364"
    },
    {
      "title": "Axiomatic Characterization of Committee Scoring Rules",
      "abstract": "Committee scoring rules form a rich class of aggregators of voters' preferences for the purpose of selecting subsets of objects with desired properties, e.g., a shortlist of candidates for an interview, a representative collective body such as a parliament, or a set of locations for a set of public facilities. In the spirit of celebrated Young's characterization result that axiomatizes single-winner scoring rules, we provide an axiomatic characterization of multiwinner committee scoring rules. We show that committee scoring rules---despite forming a remarkably general class of rules---are characterized by the set of four standard axioms, anonymity, neutrality, consistency and continuity, and by one axiom specific to multiwinner rules which we call committee dominance. In the course of our proof, we develop several new notions and techniques. In particular, we introduce and axiomatically characterize multiwinner decision scoring rules, a class of rules that broadly generalizes the well-known majority relation. △ Less",
      "url": "https://arxiv.org/abs/1604.01529"
    },
    {
      "title": "Multiwinner Analogues of Plurality Rule: Axiomatic and Algorithmic Perspectives",
      "abstract": "We characterize the class of committee scoring rules that satisfy the fixed-majority criterion. In some sense, the committee scoring rules in this class are multiwinner analogues of the single-winner Plurality rule, which is uniquely characterized as the only single-winner scoring rule that satisfies the simple majority criterion. We define top-$k$-counting committee scoring rules and show that the fixed majority consistent rules are a subclass of the top-$k$-counting rules. We give necessary and sufficient conditions for a top-$k$-counting rule to satisfy the fixed-majority criterion. We find that, for most of the rules in our new class, the complexity of winner determination is high (that is, the problem of computing the winners is NP-hard), but we also show examples of rules with polynomial-time winner determination procedures. For some of the computationally hard rules, we provide either exact FPT algorithms or approximate polynomial-time algorithms. △ Less",
      "url": "https://arxiv.org/abs/1602.08687"
    },
    {
      "title": "The Araucaria Project: A study of the classical Cepheid in the eclipsing binary system OGLE LMC562.05.9009 in the Large Magellanic Cloud",
      "abstract": "We present a detailed study of the classical Cepheid in the double-lined, highly eccentric eclipsing binary system OGLE-LMC562.05.9009. The Cepheid is a fundamental mode pulsator with a period of 2.988 days. The orbital period of the system is 1550 days. Using spectroscopic data from three 4-8-m telescopes and photometry spanning 22 years, we were able to derive the dynamical masses and radii of both stars with exquisite accuracy. Both stars in the system are very similar in mass, radius and color, but the companion is a stable, non-pulsating star. The Cepheid is slightly more massive and bigger (M_1 = 3.70 +/- 0.03M_sun, R_1 = 28.6 +/- 0.2R_sun) than its companion (M_2 = 3.60 +/- 0.03M_sun, R_2 = 26.6 +/- 0.2R_sun). Within the observational uncertainties both stars have the same effective temperature of 6030 +/- 150K. Evolutionary tracks place both stars inside the classical Cepheid instability strip, but it is likely that future improved temperature estimates will move the stable giant companion just beyond the red edge of the instability strip. Within current observational and theoretical uncertainties, both stars fit on a 205 Myr isochrone arguing for their common age. From our model, we determine a value of the projection factor of p = 1.37 +/- 0.07 for the Cepheid in the OGLE-LMC562.05.9009 system. This is the second Cepheid for which we could measure its p-factor with high precision directly from the analysis of an eclipsing binary system, which represents an important contribution towards a better calibration of Baade-Wesselink methods of distance determination for Cepheids. △ Less",
      "url": "https://arxiv.org/abs/1511.02826"
    },
    {
      "title": "FPT Approximation Schemes for Maximizing Submodular Functions",
      "abstract": "We investigate the existence of approximation algorithms for maximization of submodular functions, that run in fixed parameter tractable (FPT) time. Given a non-decreasing submodular set function $v: 2^X \\to \\mathbb{R}$ the goal is to select a subset $S$ of $K$ elements from $X$ such that $v(S)$ is maximized. We identify three properties of set functions, referred to as $p$-separability properties, and we argue that many real-life problems can be expressed as maximization of submodular, $p$-separable functions, with low values of the parameter $p$. We present FPT approximation schemes for the minimization and maximization variants of the problem, for several parameters that depend on characteristics of the optimized set function, such as $p$ and $K$. We confirm that our algorithms are applicable to a broad class of problems, in particular to problems from computational social choice, such as item selection or winner determination under several multiwinner election systems. △ Less",
      "url": "https://arxiv.org/abs/1510.00215"
    },
    {
      "title": "Multi-Attribute Proportional Representation",
      "abstract": "We consider the following problem in which a given number of items has to be chosen from a predefined set. Each item is described by a vector of attributes and for each attribute there is a desired distribution that the selected set should have. We look for a set that fits as much as possible the desired distributions on all attributes. Examples of applications include choosing members of a representative committee, where candidates are described by attributes such as sex, age and profession, and where we look for a committee that for each attribute offers a certain representation, i.e., a single committee that contains a certain number of young and old people, certain number of men and women, certain number of people with different professions, etc. With a single attribute the problem collapses to the apportionment problem for party-list proportional representation systems (in such case the value of the single attribute would be a political affiliation of a candidate). We study the properties of the associated subset selection rules, as well as their computation complexity. △ Less",
      "url": "https://arxiv.org/abs/1509.03389"
    },
    {
      "title": "Properties of Multiwinner Voting Rules",
      "abstract": "The goal of this paper is to propose and study properties of multiwinner voting rules which can be consider as generalisations of single-winner scoring voting rules. We consider SNTV, Bloc, k-Borda, STV, and several variants of Chamberlin--Courant's and Monroe's rules and their approximations. We identify two broad natural classes of multiwinner score-based rules, and show that many of the existing rules can be captured by one or both of these approaches. We then formulate a number of desirable properties of multiwinner rules, and evaluate the rules we consider with respect to these properties. △ Less",
      "url": "https://arxiv.org/abs/1506.02891"
    },
    {
      "title": "Spanning trees of the World Trade Web: real-world data and the gravity model of trade",
      "abstract": "In this paper, we investigate the statistical features of the weighted international-trade network. By finding the maximum weight spanning trees for this network we make the extraction of the truly relevant connections forming the network's backbone. We discuss the role of large-sized countries (strongest economies) in the tree. Finally, we compare the topological properties of this backbone to the maximum weight spanning trees obtained from the gravity model of trade. We show that the model correctly reproduces the backbone of the real-world economy. △ Less",
      "url": "https://arxiv.org/abs/1412.1618"
    },
    {
      "title": "Equilibria of Plurality Voting: Lazy and Truth-biased Voters",
      "abstract": "We present a systematic study of Plurality elections with strategic voters who, in addition to having preferences over election winners, have secondary preferences, which govern their behavior when their vote cannot affect the election outcome. Specifically, we study two models that have been recently considered in the literature: lazy voters, who prefer to abstain when they are not pivotal, and truth-biased voters, who prefer to vote truthfully when they are not pivotal. We extend prior work by investigating the behavior of both lazy and truth-biased voters under different tie-breaking rules (lexicographic rule, random voter rule, random candidate rule). Two of these six combinations of secondary preferences and a tie-breaking rule have been studied in prior work. In order to understand the impact of different secondary preferences and tie-breaking rules on the election outcomes, we study the remaining four combinations. We characterize pure Nash equilibria (PNE) of the resulting strategic games and study the complexity of related computational problems. Our results extend to settings where some of the voters may be non-strategic. △ Less",
      "url": "https://arxiv.org/abs/1409.4132"
    },
    {
      "title": "Finding a Collective Set of Items: From Proportional Multirepresentation to Group Recommendation",
      "abstract": "We consider the following problem: There is a set of items (e.g., movies) and a group of agents (e.g., passengers on a plane); each agent has some intrinsic utility for each of the items. Our goal is to pick a set of $K$ items that maximize the total derived utility of all the agents (i.e., in our example we are to pick $K$ movies that we put on the plane's entertainment system). However, the actual utility that an agent derives from a given item is only a fraction of its intrinsic one, and this fraction depends on how the agent ranks the item among the chosen, available, ones. We provide a formal specification of the model and provide concrete examples and settings where it is applicable. We show that the problem is hard in general, but we show a number of tractability results for its natural special cases. △ Less",
      "url": "https://arxiv.org/abs/1402.3044"
    }
  ]
}