{
  "author": "Reshef Meir",
  "results": [
    {
      "title": "To Stand on the Shoulders of Giants: Should We Protect Initial Discoveries in Multi-Agent Exploration?",
      "abstract": "Exploring new ideas is a fundamental aspect of research and development (R\\&D), which often occurs in competitive environments. Most ideas are subsequent, i.e. one idea today leads to more ideas tomorrow. According to one approach, the best way to encourage exploration is by granting protection on discoveries to the first innovator. Correspondingly, only the one who made the first discovery can use the new knowledge and benefit from subsequent discoveries, which in turn should increase the initial motivation to explore. An alternative approach to promote exploration favors the \\emph{sharing of knowledge} from discoveries among researchers allowing explorers to use each others' discoveries to develop further knowledge, as in the open-source community. With no protection, all explorers have access to all existing discoveries and new directions are explored faster. We present a game theoretic analysis of an abstract research-and-application game which clarifies the expected advantages and disadvantages of the two approaches under full information. We then compare the theoretical predictions with the observed behavior of actual players in the lab who operate under partial information conditions in both worlds. Our main experimental finding is that the no protection approach leads to \\emph{more} investment efforts overall, in contrast to theoretical prediction and common economic wisdom, but in line with a familiar cognitive bias known as `underweighting of rare events'. △ Less",
      "url": "https://arxiv.org/abs/2502.14112"
    },
    {
      "title": "Distribution Aggregation via Continuous Thiele's Rules",
      "abstract": "We introduce the class of \\textit{Continuous Thiele's Rules} that generalize the familiar \\textbf{Thiele's rules} \\cite{janson2018phragmens} of multi-winner voting to distribution aggregation problems. Each rule in that class maximizes $\\sum_if(π^i)$ where $π^i$ is an agent $i$'s satisfaction and $f$ could be any twice differentiable, increasing and concave real function. Based on a single quantity we call the \\textit{'Inequality Aversion'} of $f$ (elsewhere known as \"Relative Risk Aversion\"), we derive bounds on the Egalitarian loss, welfare loss and the approximation of \\textit{Average Fair Share}, leading to a quantifiable, continuous presentation of their inevitable trade-offs. In particular, we show that the Nash Product Rule satisfies\\textit{ Average Fair Share} in our setting. △ Less",
      "url": "https://arxiv.org/abs/2408.01054"
    },
    {
      "title": "Condorcet's Jury Theorem with Abstention",
      "abstract": "The well-known Condorcet's Jury theorem posits that the majority rule selects the best alternative among two available options with probability one, as the population size increases to infinity. We study this result under an asymmetric two-candidate setup, where supporters of both candidates may have different participation costs. When the decision to abstain is fully rational i.e., when the vote pivotality is the probability of a tie, the only equilibrium outcome is a trivial equilibrium where all voters except those with zero voting cost, abstain. We propose and analyze a more practical, boundedly rational model where voters overestimate their pivotality, and show that under this model, non-trivial equilibria emerge where the winning probability of both candidates is bounded away from one. We show that when the pivotality estimate strongly depends on the margin of victory, victory is not assured to any candidate in any non-trivial equilibrium, regardless of population size and in contrast to Condorcet's assertion. Whereas, under a weak dependence on margin, Condorcet's Jury theorem is restored. △ Less",
      "url": "https://arxiv.org/abs/2408.00317"
    },
    {
      "title": "Efficient Online Crowdsourcing with Complex Annotations",
      "abstract": "Crowdsourcing platforms use various truth discovery algorithms to aggregate annotations from multiple labelers. In an online setting, however, the main challenge is to decide whether to ask for more annotations for each item to efficiently trade off cost (i.e., the number of annotations) for quality of the aggregated annotations. In this paper, we propose a novel approach for general complex annotation (such as bounding boxes and taxonomy paths), that works in an online crowdsourcing setting. We prove that the expected average similarity of a labeler is linear in their accuracy \\emph{conditional on the reported label}. This enables us to infer reported label accuracy in a broad range of scenarios. We conduct extensive evaluations on real-world crowdsourcing data from Meta and show the effectiveness of our proposed online algorithms in improving the cost-quality trade-off. △ Less",
      "url": "https://arxiv.org/abs/2401.15116"
    },
    {
      "title": "Strategic Proxy Voting on the Line",
      "abstract": "This paper offers a framework for the study of strategic behavior in proxy voting, where non-active voters delegate their votes to active voters. We further study how proxy voting affects the strategic behavior of non-active voters and proxies (active voters) under complete and partial information. We focus on the median voting rule for single-peaked preferences. Our results show strategyproofness with respect to non-active voters. Furthermore, while strategyproofness does not extend to proxies, we show that the outcome is bounded and, under mild restrictions, strategic behavior leads to socially optimal outcomes. We further show that our results extend to partial information settings, and in particular for regret-averse agents. △ Less",
      "url": "https://arxiv.org/abs/2305.10969"
    },
    {
      "title": "Strategy-proof Budgeting via a VCG-like Mechanism",
      "abstract": "We present a strategy-proof public goods budgeting mechanism where agents determine both the total volume of expanses and the specific allocation. It is constructed as a modification of VCG to a less typical environment, namely where we do not assume quasi-linear utilities nor direct revelation. We further show that under plausible assumptions it satisfies strategy-proofness in strictly dominant strategies, and consequently implements the social optimum as a Coalition Proof Nash Equilibrium. A primary (albeit not an exclusive) motivation of our model is Participatory Budgeting, where members of a community collectively decide the spending policy of public tax dollars. While incentives alignment in our mechanism, as in classic VCG, is achieved via individual payments we charge from agents, in a PB context that seems unreasonable. Our second main result thus provides that, under further specifications relevant in that context, these payments will vanish in large populations. In the last section we expand the mechanism's definition to a class of mechanisms in which the designer can prioritize certain outcomes she sees as desirable. In particular we give the example of favoring equitable (egalitarian) allocations. △ Less",
      "url": "https://arxiv.org/abs/2303.06923"
    },
    {
      "title": "Mitigating Skewed Bidding for Conference Paper Assignment",
      "abstract": "The explosion of conference paper submissions in AI and related fields, has underscored the need to improve many aspects of the peer review process, especially the matching of papers and reviewers. Recent work argues that the key to improve this matching is to modify aspects of the \\emph{bidding phase} itself, to ensure that the set of bids over papers is balanced, and in particular to avoid \\emph{orphan papers}, i.e., those papers that receive no bids. In an attempt to understand and mitigate this problem, we have developed a flexible bidding platform to test adaptations to the bidding process. Using this platform, we performed a field experiment during the bidding phase of a medium-size international workshop that compared two bidding methods. We further examined via controlled experiments on Amazon Mechanical Turk various factors that affect bidding, in particular the order in which papers are presented \\cite{cabanac2013capitalizing,fiez2020super}; and information on paper demand \\cite{meir2021market}. Our results suggest that several simple adaptations, that can be added to any existing platform, may significantly reduce the skew in bids, thereby improving the allocation for both reviewers and conference organizers. △ Less",
      "url": "https://arxiv.org/abs/2303.00435"
    },
    {
      "title": "Convergence of Multi-Issue Iterative Voting under Uncertainty",
      "abstract": "We study the effect of strategic behavior in iterative voting for multiple issues under uncertainty. We introduce a model synthesizing simultaneous multi-issue voting with Meir, Lev, and Rosenschein (2014)'s local dominance theory and determine its convergence properties. After demonstrating that local dominance improvement dynamics may fail to converge, we present two sufficient model refinements that guarantee convergence from any initial vote profile for binary issues: constraining agents to have O-legal preferences and endowing agents with less uncertainty about issues they are modifying than others. Our empirical studies demonstrate that although cycles are common when agents have no uncertainty, introducing uncertainty makes convergence almost guaranteed in practice. △ Less",
      "url": "https://arxiv.org/abs/2301.08873"
    },
    {
      "title": "Empirical Bayes approach to Truth Discovery problems",
      "abstract": "When aggregating information from conflicting sources, one's goal is to find the truth. Most real-value \\emph{truth discovery} (TD) algorithms try to achieve this goal by estimating the competence of each source and then aggregating the conflicting information by weighing each source's answer proportionally to her competence. However, each of those algorithms requires more than a single source for such estimation and usually does not consider different estimation methods other than a weighted mean. Therefore, in this work we formulate, prove, and empirically test the conditions for an Empirical Bayes Estimator (EBE) to dominate the weighted mean aggregation. Our main result demonstrates that EBE, under mild conditions, can be used as a second step of any TD algorithm in order to reduce the expected error. △ Less",
      "url": "https://arxiv.org/abs/2206.04816"
    },
    {
      "title": "Welfare vs. Representation in Participatory Budgeting",
      "abstract": "Participatory budgeting (PB) is a democratic process for allocating funds to projects based on the votes of members of the community. Different rules have been used to aggregate participants' votes. Past research has studied the trade-off between notions of social welfare and fairness in the multi-winner setting (a special case of participatory budgeting with identical project costs) by Lackner and Skowron (2020). But there is little understanding of this trade-off in the more general PB setting. This paper provides a theoretical and empirical study of the worst-case guarantees of several common rules to better understand the trade-off between social welfare, representation. We show that many of the guarantees from the multi-winner setting do not generalize to the PB setting, and that the introduction of costs leads to substantially worse guarantees, thereby exacerbating the welfare-representation trade-off. We extend our theoretical analysis to studying how the requirement of proportionality over voting rules affects this trade-off. We further study how the requirement of proportionality over voting rules effects the guarantees on social welfare and representation. We study the latter point also empirically, both on real and synthetic datasets. We show that variants of the recently suggested voting rule Rule-X (which satisfies proportionality) do very well in practice both with respect to social welfare and representation. △ Less",
      "url": "https://arxiv.org/abs/2201.07546"
    },
    {
      "title": "Proportional Participatory Budgeting with Projects Interaction",
      "abstract": "Participatory budgeting (PB) is a democratic process for allocating funds to projects based on the votes of community members. PB outcomes are commonly evaluated for how they reflect voters preferences (e.g., social welfare) and the extent to which they are fair (e.g., proportionality). Due to practical and computational reasons, voters are usually asked to report their preferences over projects separately, possibly neglecting important dependencies among projects, which causes the outcome to no longer be proportional and achieve lower satisfaction. This work is the first to suggest a polynomial-time aggregation method capable of guaranteeing proportional outcomes under substitution dependencies. The method is a variant of the Method of Equal Shares, and we further provide another variation that can guarantee a more relaxed notion of proportionality for any type of dependency, and is FPT rather than polynomial. Through simulations, we demonstrate that these aggregation methods achieve, on average, higher social welfare than their counterparts that ignore the dependencies. △ Less",
      "url": "https://arxiv.org/abs/2106.05360"
    },
    {
      "title": "The Core of Approval Participatory Budgeting with Uniform Costs (or with up to Four Projects) is Non-Empty",
      "abstract": "In the Approval Participatory Budgeting problem an agent prefers a set of projects $W'$ over $W$ if she approves strictly more projects in $W'$. A set of projects $W$ is in the core, if there is no other set of projects $W'$ and set of agents $K$ that both prefer $W'$ over $W$ and can fund $W'$. It is an open problem whether the core can be empty, even when project costs are uniform. the latter case is known as the multiwinner voting core. We show that in any instance with uniform costs or with at most four projects (and any number of agents), the core is nonempty. △ Less",
      "url": "https://arxiv.org/abs/2104.05082"
    },
    {
      "title": "Strategyproof Facility Location Mechanisms on Discrete Trees",
      "abstract": "We address the problem of strategyproof (SP) facility location mechanisms on discrete trees. Our main result is a full characterization of onto and SP mechanisms. In particular, we prove that when a single agent significantly affects the outcome, the trajectory of the facility is almost contained in the trajectory of the agent, and both move in the same direction along the common edges. We show tight relations of our characterization to previous results on discrete lines and on continuous trees. We then derive further implications of the main result for infinite discrete lines. △ Less",
      "url": "https://arxiv.org/abs/2102.02610"
    },
    {
      "title": "Representative Committees of Peers",
      "abstract": "A population of voters must elect representatives among themselves to decide on a sequence of possibly unforeseen binary issues. Voters care only about the final decision, not the elected representatives. The disutility of a voter is proportional to the fraction of issues, where his preferences disagree with the decision. While an issue-by-issue vote by all voters would maximize social welfare, we are interested in how well the preferences of the population can be approximated by a small committee. We show that a k-sortition (a random committee of k voters with the majority vote within the committee) leads to an outcome within the factor 1+O(1/k) of the optimal social cost for any number of voters n, any number of issues $m$, and any preference profile. For a small number of issues m, the social cost can be made even closer to optimal by delegation procedures that weigh committee members according to their number of followers. However, for large m, we demonstrate that the k-sortition is the worst-case optimal rule within a broad family of committee-based rules that take into account metric information about the preference profile of the whole population. △ Less",
      "url": "https://arxiv.org/abs/2006.07837"
    },
    {
      "title": "Cumulative Games: Who is the current player?",
      "abstract": "Combinatorial Game Theory (CGT) is a branch of game theory that has developed almost independently from Economic Game Theory (EGT), and is concerned with deep mathematical properties of 2-player 0-sum games that are defined over various combinatorial structures. The aim of this work is to lay foundations to bridging the conceptual and technical gaps between CGT and EGT, here interpreted as so-called Extensive Form Games, so they can be treated within a unified framework. More specifically, we introduce a class of $n$-player, general-sum games, called Cumulative Games, that can be analyzed by both CGT and EGT tools. We show how two of the most fundamental definitions of CGT---the outcome function, and the disjunctive sum operator---naturally extend to the class of Cumulative Games. The outcome function allows for an efficient equilibrium computation under certain restrictions, and the disjunctive sum operator lets us define a partial order over games, according to the advantage that a certain player has. Finally, we show that any Extensive Form Game can be written as a Cumulative Game. △ Less",
      "url": "https://arxiv.org/abs/2005.06326"
    },
    {
      "title": "Distance-based Equilibria in Normal-Form Games",
      "abstract": "We propose a simple uncertainty modification for the agent model in normal-form games; at any given strategy profile, the agent can access only a set of \"possible profiles\" that are within a certain distance from the actual action profile. We investigate the various instantiations in which the agent chooses her strategy using well-known rationales e.g., considering the worst case, or trying to minimize the regret, to cope with such uncertainty. Any such modification in the behavioral model naturally induces a corresponding notion of equilibrium; a distance-based equilibrium. We characterize the relationships between the various equilibria, and also their connections to well-known existing solution concepts such as Trembling-hand perfection. Furthermore, we deliver existence results, and show that for some class of games, such solution concepts can actually lead to better outcomes. △ Less",
      "url": "https://arxiv.org/abs/2002.03169"
    },
    {
      "title": "Safe Voting: Resilience to Abstention and Sybils",
      "abstract": "Voting rules may implement the will of the society when all eligible voters vote, and only them. However, they may fail to do so when sybil (fake or duplicate) votes are present and when only some honest (non sybil) voters actively participate. As, unfortunately, sometimes this is the case, our aim here is to address social choice in the presence of sybils and voter abstention. To do so we build upon the framework of Reality-aware Social Choice: we assume the status-quo as an ever-present distinguished alternative, and study Status-Quo Enforcing voting rules, which add virtual votes in support of the status-quo. We characterize the tradeoff between safety and liveness (the ability of active honest voters to maintain/change the status-quo, respectively) in several domains, and show that the Status-Quo Enforcing voting rules are often optimal. We comment on the applicability of our methods and analyses to the governance of digital communities. △ Less",
      "url": "https://arxiv.org/abs/2001.05271"
    },
    {
      "title": "Bidding in Spades",
      "abstract": "We present a Spades bidding algorithm that is superior to recreational human players and to publicly available bots. Like in Bridge, the game of Spades is composed of two independent phases, \\textit{bidding} and \\textit{playing}. This paper focuses on the bidding algorithm, since this phase holds a precise challenge: based on the input, choose the bid that maximizes the agent's winning probability. Our \\emph{Bidding-in-Spades} (BIS) algorithm heuristically determines the bidding strategy by comparing the expected utility of each possible bid. A major challenge is how to estimate these expected utilities. To this end, we propose a set of domain-specific heuristics, and then correct them via machine learning using data from real-world players. The \\BIS algorithm we present can be attached to any playing algorithm. It beats rule-based bidding bots when all use the same playing component. When combined with a rule-based playing algorithm, it is superior to the average recreational human. △ Less",
      "url": "https://arxiv.org/abs/1912.11323"
    },
    {
      "title": "Modeling Peoples Voting Behavior with Poll Information",
      "abstract": "Despite the prevalence of voting systems in the real world there is no consensus among researchers of how people vote strategically, even in simple voting settings. This paper addresses this gap by comparing different approaches that have been used to model strategic voting, including expected utility maximization, heuristic decisionmaking, and bounded rationality models. The models are applied to data collected from hundreds of people in controlled voting experiments, where people vote after observing non-binding poll information. We introduce a new voting model, the Attainability- Utility (AU) heuristic, which weighs the popularity of a candidate according to the poll, with the utility of the candidate to the voter. We argue that the AU model is cognitively plausible, and show that it is able to predict peoples voting behavior significantly better than other models from the literature. It was almost at par with (and sometimes better than) a machine learning algorithm that uses substantially more information. Our results provide new insights into the strategic considerations of voters, that undermine the prevalent assumptions of much theoretical work in social choice. △ Less",
      "url": "https://arxiv.org/abs/1909.10492"
    },
    {
      "title": "Penalty Bidding Mechanisms for Allocating Resources and Overcoming Present Bias",
      "abstract": "From skipped exercise classes to last-minute cancellation of dentist appointments, underutilization of reserved resources abounds. Likely reasons include uncertainty about the future, further exacerbated by present bias. In this paper, we unite resource allocation and commitment devices through the design of contingent payment mechanisms, and propose the two-bid penalty-bidding mechanism. This extends an earlier mechanism proposed by Ma et al. (2019), assigning the resources based on willingness to accept a no-show penalty, while also allowing each participant to increase her own penalty in order to counter present bias. We establish a simple dominant strategy equilibrium, regardless of an agent's level of present bias or degree of \"sophistication\". Via simulations, we show that the proposed mechanism substantially improves utilization and achieves higher welfare and better equity in comparison with mechanisms used in practice and mechanisms that optimize welfare in the absence of present bias. △ Less",
      "url": "https://arxiv.org/abs/1906.09713"
    },
    {
      "title": "Frustratingly Easy Truth Discovery",
      "abstract": "Truth discovery is a general name for a broad range of statistical methods aimed to extract the correct answers to questions, based on multiple answers coming from noisy sources. For example, workers in a crowdsourcing platform. In this paper, we consider an extremely simple heuristic for estimating workers' competence using average proximity to other workers. We prove that this estimates well the actual competence level and enables separating high and low quality workers in a wide spectrum of domains and statistical models. Under Gaussian noise, this simple estimate is the unique solution to the MLE with a constant regularization factor. Finally, weighing workers according to their average proximity in a crowdsourcing setting, results in substantial improvement over unweighted aggregation and other truth discovery algorithms in practice. △ Less",
      "url": "https://arxiv.org/abs/1905.00629"
    },
    {
      "title": "Strategyproof Facility Location for Three Agents on a Circle",
      "abstract": "We consider the facility location problem in a metric space, focusing on the case of three agents. We show that selecting the reported location of each agent with probability proportional to the distance between the other two agents results in a mechanism that is strategyproof in expectation, and dominates the random dictator mechanism in terms of utilitarian social welfare. We further improve the upper bound for three agents on a circle to 7/6 (whereas random dictator obtains 4/3); and provide the first lower bounds for randomized strategyproof facility location in any metric space, using linear programming. △ Less",
      "url": "https://arxiv.org/abs/1902.08070"
    },
    {
      "title": "Heuristic Voting as Ordinal Dominance Strategies",
      "abstract": "Decision making under uncertainty is a key component of many AI settings, and in particular of voting scenarios where strategic agents are trying to reach a joint decision. The common approach to handle uncertainty is by maximizing expected utility, which requires a cardinal utility function as well as detailed probabilistic information. However, often such probabilities are not easy to estimate or apply. To this end, we present a framework that allows \"shades of gray\" of likelihood without probabilities. Specifically, we create a hierarchy of sets of world states based on a prospective poll, with inner sets contain more likely outcomes. This hierarchy of likelihoods allows us to define what we term ordinally-dominated strategies. We use this approach to justify various known voting heuristics as bounded-rational strategies. △ Less",
      "url": "https://arxiv.org/abs/1811.05529"
    },
    {
      "title": "Efficient Crowdsourcing via Proxy Voting",
      "abstract": "Crowdsourcing platforms offer a way to label data by aggregating answers of multiple unqualified workers. We introduce a \\textit{simple} and \\textit{budget efficient} crowdsourcing method named Proxy Crowdsourcing (PCS). PCS collects answers from two sets of workers: \\textit{leaders} (a.k.a proxies) and \\textit{followers}. Each leader completely answers the survey while each follower answers only a small subset of it. We then weigh every leader according to the number of followers to which his answer are closest, and aggregate the answers of the leaders using any standard aggregation method (e.g., Plurality for categorical labels or Mean for continuous labels). We compare empirically the performance of PCS to unweighted aggregation, keeping the total number of questions (the budget) fixed. We show that PCS improves the accuracy of aggregated answers across several datasets, both with categorical and continuous labels. Overall, our suggested method improves accuracy while being simple and easy to implement. △ Less",
      "url": "https://arxiv.org/abs/1806.06257"
    },
    {
      "title": "Cumulative subtraction games",
      "abstract": "We study zero-sum games, a variant of the classical combinatorial Subtraction games (studied for example in the monumental work \"Winning Ways\", by Berlekamp, Conway and Guy), called Cumulative Subtraction (CS). Two players alternate in moving, and get points for taking pebbles out of a joint pile. We prove that the outcome in optimal play (game value) of a CS with a finite number of possible actions is eventually periodic, with period $2s$, where $s$ is the size of the largest available action. This settles a conjecture by Stewart in his Ph.D. thesis (2011). Specifically, we find a quadratic bound, in the size of $s$, on when the outcome function must have become periodic. In case of two possible actions, we give an explicit description of optimal play. We generalize the periodicity result to games with a so-called reward function, where at each stage of game, the change of `score' does not necessarily equal the number of pebbles you collect. △ Less",
      "url": "https://arxiv.org/abs/1805.09368"
    },
    {
      "title": "Predicting Strategic Voting Behavior with Poll Information",
      "abstract": "The question of how people vote strategically under uncertainty has attracted much attention in several disciplines. Theoretical decision models have been proposed which vary in their assumptions on the sophistication of the voters and on the information made available to them about others' preferences and their voting behavior. This work focuses on modeling strategic voting behavior under poll information. It proposes a new heuristic for voting behavior that weighs the success of each candidate according to the poll score with the utility of the candidate given the voters' preferences. The model weights can be tuned individually for each voter. We compared this model with other relevant voting models from the literature on data obtained from a recently released large scale study. We show that the new heuristic outperforms all other tested models. The prediction errors of the model can be partly explained due to inconsistent voters that vote for (weakly) dominated candidates. △ Less",
      "url": "https://arxiv.org/abs/1805.07606"
    },
    {
      "title": "Social Choice with Non Quasi-linear Utilities",
      "abstract": "Without monetary payments, the Gibbard-Satterthwaite theorem proves that under mild requirements all truthful social choice mechanisms must be dictatorships. When payments are allowed, the Vickrey-Clarke-Groves (VCG) mechanism implements the value-maximizing choice, and has many other good properties: it is strategy-proof, onto, deterministic, individually rational, and does not make positive transfers to the agents. By Roberts' theorem, with three or more alternatives, the weighted VCG mechanisms are essentially unique for domains with quasi-linear utilities. The goal of this paper is to characterize domains of non-quasi-linear utilities where \"reasonable\" mechanisms (with VCG-like properties) exist. Our main result is a tight characterization of the maximal non quasi-linear utility domain, which we call the largest parallel domain. We extend Roberts' theorem to parallel domains, and use the generalized theorem to prove two impossibility results. First, any reasonable mechanism must be dictatorial when the utility domain is quasi-linear together with any single non-parallel type. Second, for richer utility domains that still differ very slightly from quasi-linearity, every strategy-proof, onto and deterministic mechanism must be a dictatorship. △ Less",
      "url": "https://arxiv.org/abs/1804.02268"
    },
    {
      "title": "Directed Graph Minors and Serial-Parallel Width",
      "abstract": "Graph minors are a primary tool in understanding the structure of undirected graphs, with many conceptual and algorithmic implications. We propose new variants of \\emph{directed graph minors} and \\emph{directed graph embeddings}, by modifying familiar definitions. For the class of 2-terminal directed acyclic graphs (TDAGs) our two definitions coincide, and the class is closed under both operations. The usefulness of our directed minor operations is demonstrated by characterizing all TDAGs with serial-parallel width at most $k$; a class of networks known to guarantee bounded negative externality in nonatomic routing games. Our characterization implies that a TDAG has serial-parallel width of $1$ if and only if it is a directed series-parallel graph. We also study the computational complexity of finding a directed minor and computing the serial-parallel width. △ Less",
      "url": "https://arxiv.org/abs/1711.01806"
    },
    {
      "title": "Contract Design for Energy Demand Response",
      "abstract": "Power companies such as Southern California Edison (SCE) uses Demand Response (DR) contracts to incentivize consumers to reduce their power consumption during periods when demand forecast exceeds supply. Current mechanisms in use offer contracts to consumers independent of one another, do not take into consideration consumers' heterogeneity in consumption profile or reliability, and fail to achieve high participation. We introduce DR-VCG, a new DR mechanism that offers a flexible set of contracts (which may include the standard SCE contracts) and uses VCG pricing. We prove that DR-VCG elicits truthful bids, incentivizes honest preparation efforts, enables efficient computation of allocation and prices. With simple fixed-penalty contracts, the optimization goal of the mechanism is an upper bound on probability that the reduction target is missed. Extensive simulations show that compared to the current mechanism deployed in by SCE, the DR-VCG mechanism achieves higher participation, increased reliability, and significantly reduced total expenses. △ Less",
      "url": "https://arxiv.org/abs/1705.07300"
    },
    {
      "title": "Proxy Voting for Better Outcomes",
      "abstract": "We consider a social choice problem where only a small number of people out of a large population are sufficiently available or motivated to vote. A common solution to increase participation is to allow voters use a proxy, that is, transfer their voting rights to another voter. Considering social choice problems on metric spaces, we compare voting with and without the use of proxies to see which mechanism better approximates the optimal outcome, and characterize the regimes in which proxy voting is beneficial. When voters' opinions are located on an interval, both the median mechanism and the mean mechanism are substantially improved by proxy voting. When voters vote on many binary issues, proxy voting is better when the sample of active voters is too small to provide a good outcome. Our theoretical results extend to situations where available voters choose strategically whether to participate. We support our theoretical findings with empirical results showing substantial benefits of proxy voting on simulated and real preference data. △ Less",
      "url": "https://arxiv.org/abs/1611.08308"
    },
    {
      "title": "Random Tie-breaking with Stochastic Dominance",
      "abstract": "Consider Plurality with random tie-breaking. This paper uses standard axiomatic extensions of preferences over elements to preferences over sets (Kelly, Gardenfors, Responsiveness) to characterize all better-replies of a voter under stochastic dominance. △ Less",
      "url": "https://arxiv.org/abs/1609.01682"
    },
    {
      "title": "Contingent Payment Mechanisms for Resource Utilization",
      "abstract": "We introduce the problem of assigning resources to improve their utilization. The motivation comes from settings where agents have uncertainty about their own values for using a resource, and where it is in the interest of a group that resources be used and not wasted. Done in the right way, improved utilization maximizes social welfare--- balancing the utility of a high value but unreliable agent with the group's preference that resources be used. We introduce the family of contingent payment mechanisms (CP), which may charge an agent contingent on use (a penalty). A CP mechanism is parameterized by a maximum penalty, and has a dominant-strategy equilibrium. Under a set of axiomatic properties, we establish welfare-optimality for the special case CP(W), with CP instantiated for a maximum penalty equal to societal value W for utilization. CP(W) is not dominated for expected welfare by any other mechanism, and second, amongst mechanisms that always allocate the resource and have a simple indirect structure, CP(W) strictly dominates every other mechanism. The special case with no upper bound on penalty, the contingent second-price mechanism, maximizes utilization. We extend the mechanisms to assign multiple, heterogeneous resources, and present a simulation study of the welfare properties of these mechanisms. △ Less",
      "url": "https://arxiv.org/abs/1607.06511"
    },
    {
      "title": "Acyclic Games and Iterative Voting",
      "abstract": "We consider iterative voting models and position them within the general framework of acyclic games and game forms. More specifically, we classify convergence results based on the underlying assumptions on the agent scheduler (the order of players) and the action scheduler (which better-reply is played). Our main technical result is providing a complete picture of conditions for acyclicity in several variations of Plurality voting. In particular, we show that (a) under the traditional lexicographic tie-breaking, the game converges for any order of players under a weak restriction on voters' actions; and (b) Plurality with randomized tie-breaking is not guaranteed to converge under arbitrary agent schedulers, but from any initial state there is \\emph{some} path of better-replies to a Nash equilibrium. We thus show a first separation between restricted-acyclicity and weak-acyclicity of game forms, thereby settling an open question from [Kukushkin, IJGT 2011]. In addition, we refute another conjecture regarding strongly-acyclic voting rules. △ Less",
      "url": "https://arxiv.org/abs/1606.05837"
    },
    {
      "title": "On Sex, Evolution, and the Multiplicative Weights Update Algorithm",
      "abstract": "We consider a recent innovative theory by Chastain et al. on the role of sex in evolution [PNAS'14]. In short, the theory suggests that the evolutionary process of gene recombination implements the celebrated multiplicative weights updates algorithm (MWUA). They prove that the population dynamics induced by sexual reproduction can be precisely modeled by genes that use MWUA as their learning strategy in a particular coordination game. The result holds in the environments of \\emph{weak selection}, under the assumption that the population frequencies remain a product distribution. We revisit the theory, eliminating both the requirement of weak selection and any assumption on the distribution of the population. Removing the assumption of product distributions is crucial, since as we show, this assumption is inconsistent with the population dynamics. We show that the marginal allele distributions induced by the population dynamics precisely match the marginals induced by a multiplicative weights update algorithm in this general setting, thereby affirming and substantially generalizing these earlier results. We further revise the implications for convergence and utility or fitness guarantees in coordination games. In contrast to the claim of Chastain et al.[PNAS'14], we conclude that the sexual evolutionary dynamics does not entail any property of the population distribution, beyond those already implied by convergence. △ Less",
      "url": "https://arxiv.org/abs/1502.05056"
    },
    {
      "title": "Plurality Voting under Uncertainty",
      "abstract": "Understanding the nature of strategic voting is the holy grail of social choice theory, where game-theory, social science and recently computational approaches are all applied in order to model the incentives and behavior of voters. In a recent paper, Meir et al.[EC'14] made another step in this direction, by suggesting a behavioral game-theoretic model for voters under uncertainty. For a specific variation of best-response heuristics, they proved initial existence and convergence results in the Plurality voting system. In this paper, we extend the model in multiple directions, considering voters with different uncertainty levels, simultaneous strategic decisions, and a more permissive notion of best-response. We prove that a voting equilibrium exists even in the most general case. Further, any society voting in an iterative setting is guaranteed to converge. We also analyze an alternative behavior where voters try to minimize their worst-case regret. We show that the two behaviors coincide in the simple setting of Meir et al., but not in the general case. △ Less",
      "url": "https://arxiv.org/abs/1411.4949"
    },
    {
      "title": "Congestion Games with Distance-Based Strict Uncertainty",
      "abstract": "We put forward a new model of congestion games where agents have uncertainty over the routes used by other agents. We take a non-probabilistic approach, assuming that each agent knows that the number of agents using an edge is within a certain range. Given this uncertainty, we model agents who either minimize their worst-case cost (WCC) or their worst-case regret (WCR), and study implications on equilibrium existence, convergence through adaptive play, and efficiency. Under the WCC behavior the game reduces to a modified congestion game, and welfare improves when agents have moderate uncertainty. Under WCR behavior the game is not, in general, a congestion game, but we show convergence and efficiency bounds for a simple class of games. △ Less",
      "url": "https://arxiv.org/abs/1411.4943"
    },
    {
      "title": "Playing the Wrong Game: Bounding Externalities in Diverse Populations of Agents",
      "abstract": "The robustness of multiagent systems can be affected by mistakes or behavioral biases (e.g., risk-aversion, altruism, toll-sensitivity), with some agents playing the \"wrong game.\" This can change the set of equilibria, and may in turn harm or improve the social welfare of agents in the system. We are interested in bounding what we call the biased price of anarchy (BPoA) in populations with diverse agent behaviors, which is the ratio between welfare in the \"wrong\" equilibrium and optimal welfare. We study nonatomic routing games, and derive an externality bound that depends on a key topological parameter of the underlying network. We then prove two general BPoA bounds for games with diverse populations: one that relies on the network structure and the average bias of all agents in the population, and one that is independent of the structure but depends on the maximal bias. Both types of bounds can be combined with known results to derive concrete BPoA bounds for a variety of specific behaviors (e.g., varied levels of risk-aversion). △ Less",
      "url": "https://arxiv.org/abs/1411.1751"
    },
    {
      "title": "A Local-Dominance Theory of Voting Equilibria",
      "abstract": "It is well known that no reasonable voting rule is strategyproof. Moreover, the common Plurality rule is particularly prone to strategic behavior of the voters and empirical studies show that people often vote strategically in practice. Multiple game-theoretic models have been proposed to better understand and predict such behavior and the outcomes it induces. However, these models often make unrealistic assumptions regarding voters' behavior and the information on which they base their vote. We suggest a new model for strategic voting that takes into account voters' bounded rationality, as well as their limited access to reliable information. We introduce a simple behavioral heuristic based on \\emph{local dominance}, where each voter considers a set of possible world states without assigning probabilities to them. This set is constructed based on prospective candidates' scores (e.g., available from an inaccurate poll). In a \\emph{voting equilibrium}, all voters vote for candidates not dominated within the set of possible states. We prove that these voting equilibria exist in the Plurality rule for a broad class of local dominance relations (that is, different ways to decide which states are possible). Furthermore, we show that in an iterative setting where voters may repeatedly change their vote, local dominance-based dynamics quickly converge to an equilibrium if voters start from the truthful state. Weaker convergence guarantees in more general settings are also provided. Using extensive simulations of strategic voting on generated and real preference profiles, we show that convergence is fast and robust, that emerging equilibria are consistent across various starting conditions, and that they replicate widely known patterns of human voting behavior such as Duverger's law. Further, strategic voting generally improves the quality of the winner compared to truthful voting. △ Less",
      "url": "https://arxiv.org/abs/1404.4688"
    },
    {
      "title": "Bidding Games and Efficient Allocations",
      "abstract": "Richman games are zero-sum games, where in each turn players bid in order to determine who will play next [Lazarus et al.'99]. We extend the theory to impartial general-sum two player games called \\emph{bidding games}, showing the existence of pure subgame-perfect equilibria (PSPE). In particular, we show that PSPEs form a semilattice, with a unique and natural \\emph{Bottom Equilibrium}. Our main result shows that if only two actions available to the players in each node, then the Bottom Equilibrium has additional properties: (a) utilities are monotone in budget; (b) every outcome is Pareto-efficient; and (c) any Pareto-efficient outcome is attained for some budget. In the context of combinatorial bargaining, we show that a player with a fraction of X% of the total budget prefers her allocation to X% of the possible allocations. In addition, we provide a polynomial-time algorithm to compute the Bottom Equilibrium of a binary bidding game. △ Less",
      "url": "https://arxiv.org/abs/1311.0913"
    },
    {
      "title": "Equilibrium in Labor Markets with Few Firms",
      "abstract": "We study competition between firms in labor markets, following a combinatorial model suggested by Kelso and Crawford [1982]. In this model, each firm is trying to recruit workers by offering a higher salary than its competitors, and its production function defines the utility generated from any actual set of recruited workers. We define two natural classes of production functions for firms, where the first one is based on additive capacities (weights), and the second on the influence of workers in a social network. We then analyze the existence of pure subgame perfect equilibrium (PSPE) in the labor market and its properties. While neither class holds the gross substitutes condition, we show that in both classes the existence of PSPE is guaranteed under certain restrictions, and in particular when there are only two competing firms. As a corollary, there exists a Walrasian equilibrium in a corresponding combinatorial auction, where bidders' valuation functions belong to these classes. While a PSPE may not exist when there are more than two firms, we perform an empirical study of equilibrium outcomes for the case of weight-based games with three firms, which extend our analytical results. We then show that stability can in some cases be extended to coalitional stability, and study the distribution of profit between firms and their workers in weight-based games. △ Less",
      "url": "https://arxiv.org/abs/1306.5855"
    },
    {
      "title": "Solving Cooperative Reliability Games",
      "abstract": "Cooperative games model the allocation of profit from joint actions, following considerations such as stability and fairness. We propose the reliability extension of such games, where agents may fail to participate in the game. In the reliability extension, each agent only \"survives\" with a certain probability, and a coalition's value is the probability that its surviving members would be a winning coalition in the base game. We study prominent solution concepts in such games, showing how to approximate the Shapley value and how to compute the core in games with few agent types. We also show that applying the reliability extension may stabilize the game, making the core non-empty even when the base game has an empty core. △ Less",
      "url": "https://arxiv.org/abs/1202.3700"
    },
    {
      "title": "Stability Scores: Measuring Coalitional Stability",
      "abstract": "We introduce a measure for the level of stability against coalitional deviations, called \\emph{stability scores}, which generalizes widely used notions of stability in non-cooperative games. We use the proposed measure to compare various Nash equilibria in congestion games, and to quantify the effect of game parameters on coalitional stability. For our main results, we apply stability scores to analyze and compare the Generalized Second Price (GSP) and Vickrey-Clarke-Groves (VCG) ad auctions. We show that while a central result of the ad auctions literature is that the GSP and VCG auctions implement the same outcome in one of the equilibria of GSP, the GSP outcome is far more stable. Finally, a modified version of VCG is introduced, which is group strategy-proof, and thereby achieves the highest possible stability score. △ Less",
      "url": "https://arxiv.org/abs/1105.5983"
    },
    {
      "title": "The Cost of Stability in Coalitional Games",
      "abstract": "A key question in cooperative game theory is that of coalitional stability, usually captured by the notion of the \\emph{core}--the set of outcomes such that no subgroup of players has an incentive to deviate. However, some coalitional games have empty cores, and any outcome in such a game is unstable. In this paper, we investigate the possibility of stabilizing a coalitional game by using external payments. We consider a scenario where an external party, which is interested in having the players work together, offers a supplemental payment to the grand coalition (or, more generally, a particular coalition structure). This payment is conditional on players not deviating from their coalition(s). The sum of this payment plus the actual gains of the coalition(s) may then be divided among the agents so as to promote stability. We define the \\emph{cost of stability (CoS)} as the minimal external payment that stabilizes the game. We provide general bounds on the cost of stability in several classes of games, and explore its algorithmic properties. To develop a better intuition for the concepts we introduce, we provide a detailed algorithmic study of the cost of stability in weighted voting games, a simple but expressive class of games which can model decision-making in political bodies, and cooperation in multiagent settings. Finally, we extend our model and results to games with coalition structures. △ Less",
      "url": "https://arxiv.org/abs/0907.4385"
    }
  ]
}