{
  "author": "Thomas Meyer",
  "results": [
    {
      "title": "Amplitude analysis of $B^0 \\rightarrow η_c(1S) K^+ π^- $ decays",
      "abstract": "An amplitude analysis of the $B^0 \\rightarrow η_{c}(1S) K^+ π^- $ decays with $η_{c}(1S) \\to p \\bar{p}$ is performed using a sample corresponding to an integrated luminosity of 9$\\text{fb}^{-1}$ of $pp$ collision data collected by the LHCb detector at centre-of-mass energies of $\\sqrt{s}$ = 7, 8 and 13TeV. The data are described with a model including only intermediate contributions from known $K^{0\\star}$ resonances. Evidence for an exotic resonance in the $η_{c}(1S) π^{-} $ system, reported in a previous analysis of this decay channel, is not confirmed. The inclusive branching fraction of the $B^0 \\rightarrow η_{c}(1S) K^+ π^- $ decays is measured to be \\begin{align*} \\mathcal{B}(B^0 \\rightarrow η_{c}(1S) K^+ π^- ) = (5.82 \\pm 0.20 \\pm 0.23 \\pm 0.55) \\times 10^{-4}, \\end{align*} where the first uncertainty is statistical, the second systematic, and the third arises from the limited knowledge of external branching fractions. △ Less",
      "url": "https://arxiv.org/abs/2509.03133"
    },
    {
      "title": "Inclusive $B$-meson flavour-tagging algorithm at LHCb",
      "abstract": "A new algorithm is developed to identify the flavour of neutral $B$ mesons at production in $pp$ collisions by utilising all tracks from the hadronisation process. The algorithm is calibrated separately for $B^0$ and $B^{0}_{s}$ mesons using $B^{0}\\to J/ψK^{+}π^-$ and $B^{0}_{s}\\to D_{s}^{-}π^+$ decays from $pp$ collision data collected by the LHCb experiment at a centre-of-mass energy of 13\\,TeV. This new algorithm improves the tagging power by 35\\% for $B^{0}$ mesons and 20\\% for $B^{0}_{s}$ mesons when compared to the combined performance of the existing LHCb flavour-tagging algorithms. △ Less",
      "url": "https://arxiv.org/abs/2508.20180"
    },
    {
      "title": "Dichography: Two-frame Ultrafast Imaging from a Single Diffraction Pattern",
      "abstract": "X-ray free-electron lasers can nowadays deliver pairs of ultrabright, ultrashort light pulses with controllable delays at different photon energies. When combined with diffraction experiments, the interaction of these pulses with a sample at different times can produce two snapshots of an evolving system, enabling spatial and temporal resolution of ultrafast dynamics in nanomatter at and beyond the terahertz time scale. However, light detectors are orders of magnitude slower. The diffraction signals from the two pulses overlap in the recorded data and cannot be separated using currently available analysis methods. Here, we address this challenge by introducing Dichography, a diffraction imaging technique that restores the two unique views of the sample from superimposed scattering signals. We apply Dichography to experimental diffraction patterns of isolated xenon-doped superfluid helium nanodroplets, imaged using time-delayed, two-color X-ray pulses at intensities near the detection limit. The reconstructed images provide evidence of the survival of the xenon structures up to 750 fs after the interaction with the first shot. The capabilities of Dichography are further explored by applying the method to data from a second experiment, in which we retrieve the images of two distinct silver nanoparticles intercepted by the same light pulse. Dichography enables a new class of experiments for spatially and temporally resolving ultrafast phenomena, making a significant step toward the original promise of X-ray free-electron lasers to capture ultrafast movies of nanomatter. △ Less",
      "url": "https://arxiv.org/abs/2508.20153"
    },
    {
      "title": "Two-Color X-Ray Coherent Diffraction Imaging of Helium Nanodroplets",
      "abstract": "Two-color X-ray imaging with Free Electron Laser pulses offers a powerful approach for probing ultrafast structural dynamics in nanoscale systems, combining (near-)atomic spatial resolution with femtosecond temporal precision. The first X-ray pulse captures the object's initial state, while the time-delayed second pulse records its subsequent evolution. A key challenge lies in disentangling the two views simultaneously recorded by the same detector. We demonstrate the realization of this approach on structurally varying nanoscale particles using two X-ray pulses of different photon energies, 1 and 1.2~keV. Sub-micrometer helium nanodroplets generated in vacuum are irradiated by the two X-ray pulses separated in time by up to 750 femtoseconds. Taking advantage of the high energy sensitivity of the imaging detector, we separate the overlapping images by analyzing individual pixel counts and applying pattern recognition. The helium nanodroplets' spherical shape allows us to cross-validate this approach by fitting the radial scattering profiles with Mie solutions for a bichromatic field. The excellent agreement between the two methods, particularly in the sparsely illuminated outer regions of the diffraction images where fine structural information is encoded, highlights the quality of this approach and its potential for future advanced X-ray movie techniques. △ Less",
      "url": "https://arxiv.org/abs/2508.19991"
    },
    {
      "title": "Measurement of branching fractions and $CP$ asymmetries in $\\mathitΛ_b^0(\\mathitΞ_b^0)\\!\\to pK_{\\mathrm S}^0h^-$ decays",
      "abstract": "A study of $\\mathitΛ_b^0$ and $\\mathitΞ_b^0$ baryon decays to the final states $pK_{\\mathrm S}^0π^-$ and $pK_{\\mathrm S}^0K^-$ is performed using $pp$ collision data collected by the LHCb experiment, corresponding to an integrated luminosity of $9\\,\\mathrm{fb}^{-1}$. The decays $\\mathitΛ_b^0\\!\\to pK_{\\mathrm S}^0K^-$ and $\\mathitΞ_b^0\\!\\to pK_{\\mathrm S}^0K^-$ are observed for the first time, with significances reaching eight standard deviations. The branching fractions and integrated $CP$ asymmetries are measured for the $\\mathitΛ_b^0\\!\\to pK_{\\mathrm S}^0π^-$, $\\mathitΛ_b^0\\!\\to pK_{\\mathrm S}^0K^-$, and $\\mathitΞ_b^0\\!\\to pK_{\\mathrm S}^0K^-$ decays. For the decay $\\mathitΛ_b^0\\!\\to pK_{\\mathrm S}^0π^-$, the $CP$ asymmetries are measured in different regions of the Dalitz plot. No evidence of $CP$ violation is observed. △ Less",
      "url": "https://arxiv.org/abs/2508.17836"
    },
    {
      "title": "First observation of the charmless baryonic decay $B^+\\to\\barΛp\\bar{p}p$",
      "abstract": "A search for the charmless baryonic decay $B^+\\to \\barΛ p\\bar{p}p$ is performed using proton-proton collision data recorded by the LHCb experiment, corresponding to an integrated luminosity of 5.4~$\\text{fb}^{-1}$. The branching fraction for this decay is measured for the first time relative to that of the topologically similar decay $B^+\\to J/ψK^+$, with $J/ψ\\to \\barΛ p K^-$. The branching fraction is measured to be \\mbox{$\\mathcal{B}(B^+\\to \\barΛ p\\bar{p}p) = (2.08 \\pm 0.34 \\pm 0.12 \\pm 0.26) \\times 10^{-7}$}, where the first uncertainty is statistical, the second is systematic, and the third arises from the uncertainty in the normalization channel branching fraction. The $CP$ asymmetry is measured to be $\\mathcal{A}_{CP}=(5.4\\pm 15.6\\pm 2.4)\\%$, where the uncertainties are statistical and systematic. The background-subtracted invariant-mass distributions of $\\barΛp$ and $\\bar{p}$ pairs exhibit pronounced enhancements at both kinematic thresholds, in contrast to a uniform phase-space distribution. △ Less",
      "url": "https://arxiv.org/abs/2508.16259"
    },
    {
      "title": "First observation of $CP$ violation and measurement of polarization in $B^+\\toρ(770)^0 K^*(892)^+$ decays",
      "abstract": "An amplitude analysis of the $B^+\\to(π^+π^-)(K^0_{\\mathrm{S}}π^+)$ decay is performed in the mass regions $0.30 < m_{π^+π^-} < 1.10\\,\\mathrm{GeV}/c^2$ and $0.75 < m_{K^0_{\\mathrm{S}}π^+} < 1.20\\,\\mathrm{GeV}/c^2$, using $pp$ collision data recorded with the LHCb detector corresponding to an integrated luminosity of $9\\,\\mathrm{fb}^{-1}$. The polarization fractions and $CP$ asymmetries for $B^+\\toρ(770)^0K^*(892)^+$ decays are measured. Violation of the $CP$ symmetry in the decay $B^+\\toρ(770)^0K^*(892)^+$ is observed for the first time, with a significance exceeding nine standard deviations. The $CP$ asymmetry is measured to be ${\\cal A}_{CP} = 0.507 \\pm 0.062\\ \\text{(stat)} \\pm 0.017\\ \\text{(syst)}$ and the $CP$-averaged longitudinal polarization fraction of $f_L = 0.720 \\pm 0.028\\ \\text{(stat)} \\pm 0.009\\ \\text{(syst)}$. The measurements help to shed light on the polarization puzzle of $B$ mesons decaying to two vector mesons. △ Less",
      "url": "https://arxiv.org/abs/2508.13563"
    },
    {
      "title": "First Results from WINERED: Detection of Emission Lines from Neutral Iron and a Combined Set of Trace Species on the Dayside of WASP-189 b",
      "abstract": "Ground and space-based observations have revealed that Ultra Hot Jupiters (UHJs,~$T_{\\rm{eq}} > 2200 \\ \\rm{K}$) typically have inverted thermal profiles, while cooler hot Jupiters have non-inverted ones. This shift is theorized due to the onset of strong optical absorbers like metal oxides (e.g., TiO, VO), metal hydrides (e.g. FeH), atomic species (e.g., Fe, Ti), and ions (e.g., H$^-$). High-resolution spectroscopy is valuable for characterizing the thermal, chemical, and dynamical atmospheric structures due to its sensitivity to detailed spectral line shapes. The newly commissioned WINERED high-resolution spectrograph ($R\\sim68,000$) on the Magellan Clay 6.5 m telescope enhances capabilities with its high throughput in the J-band (1.13-1.35 $μ$m), capturing strong spectral features from key atmospheric species. In this study, we report detecting the dayside atmosphere of the UHJ WASP-189 b at a $S/N\\sim10$, marking the first exoplanet atmosphere detection in emission with WINERED. Individually, we identify strong neutral iron (Fe) emission lines at a $S/N=6.3$, and tentatively detect neutral magnesium (Mg) and silicon (Si) at a $S/N>4$. Although not individually detected, we detect a combined set of trace species at a $S/N=7.2$, which is attributed mostly to neutral chromium (Cr) and aluminum (Al), alongside magnesium and silicon. These results help refine the understanding of key atmospheric species that influence the thermal structure of WASP-189 b and UHJs more broadly. △ Less",
      "url": "https://arxiv.org/abs/2508.11089"
    },
    {
      "title": "Deuteron identification via time of flight with LHCb",
      "abstract": "It is shown that the timing capabilities of the LHCb detector operated during the LHC Run 2 can be used to identify light ion particles with momenta of a few GeV/$c$. This is achieved by estimating the particle time of flight through a newly developed technique. A dedicated reconstruction procedure and a neural-network-based estimator of the particle speed have been developed to enable deuteron identification by suppressing the abundant background from lighter particles. The performance of the identification procedure is demonstrated in a sample of proton-helium collisions at $\\sqrt{s_{\\text{NN}}}=110$ GeV, where the production of deuteron and triton particles is observed. This novel approach opens the way to study deuteron and antideuteron production for different collision systems at different energy scales, exploiting the rich dataset collected by the LHCb experiment. △ Less",
      "url": "https://arxiv.org/abs/2508.06305"
    },
    {
      "title": "Graded contractions of the $\\mathbb{Z}_2^3$-gradings on the exceptional Lie algebras coming from octonions",
      "abstract": "A total of 860 nonisomorphic \\( \\mathbb{Z}_2^3 \\)-graded Lie algebras of dimensions 52, 78, 133, and 248 are obtained as graded contractions of the \\( \\mathbb{Z}_2^3 \\)-gradings on the exceptional Lie algebras (excluding \\( \\mathfrak{g}_2 \\)) arising from the octonions. It is shown that all graded contractions of these gradings are necessarily generic. Their supports correspond to a combinatorial object known as a \\emph{generalised nice set}, which serves as the main tool in the classification. The resulting algebras are distinguished by their Levi decompositions, the derived series of their radicals, their centers, and other structural features. △ Less",
      "url": "https://arxiv.org/abs/2508.02245"
    },
    {
      "title": "Measurement of transverse $Λ$ and $\\barΛ$ hyperon polarization in $p$Pb collisions at $\\sqrt{s_{NN}} = 5.02$ TeV",
      "abstract": "The transverse polarization of $Λ$ and $\\barΛ$ hyperons is measured in $p$Pb collisions collected by the LHCb experiment at a nucleon-nucleon center-of-mass energy of $5.02 $ TeV. The polarization is averaged over hyperon transverse momentum in the range $0.15 < p_{T} < 6.00 $ GeV/$c$, and Feynman-$x$ in the ranges $0.005 < x_{F} < 0.040$ (forward region) and $-0.10 < x_{F} < -0.01$ (backward region) defined relative to the proton beam direction. The transverse polarization is found to be compatible with zero for both $Λ$ and $\\barΛ$ hyperons. The results are also measured as a function of $p_{T}$ and $x_{F}$ with no significant dependence on these variables observed. The results are compared with previous experimental measurements at different center-of-mass energies and collision environments. △ Less",
      "url": "https://arxiv.org/abs/2508.02009"
    },
    {
      "title": "Amplitude analysis of the $Ξ^+_c\\to pK^-π^+$ decay and $Ξ^+_c$ baryon polarization measurement in semileptonic beauty-hadron decays",
      "abstract": "An amplitude analysis of the $Ξ^+_c\\to pK^-π^+$ decay together with a measurement of the $Ξ^+_c$ polarization vector in semileptonic beauty-hadron decays is presented. The analysis is performed using proton-proton collision data collected by the LHCb experiment, corresponding to an integrated luminosity of 9 ${\\rm fb}^{-1}$. An amplitude model is developed and the resonance fractions as well as two- and three-body decay parameters are reported. A sizeable $Ξ^+_c$ polarization is found. A large sensitivity of the $Ξ^+_c\\to pK^-π^+$ decay to the polarization is seen, making the amplitude model suitable for $Ξ^+_c$ polarization measurements in other systems. △ Less",
      "url": "https://arxiv.org/abs/2508.00492"
    },
    {
      "title": "Search for the decay $B^0 \\rightarrow φφ$",
      "abstract": "A search for the decay $B^0 \\rightarrow φφ$ is made using $pp$ collision data collected with the LHCb detector at centre-of-mass energies of 7, 8 and 13 TeV, corresponding to an integrated luminosity of $9$ fb$^{-1}$. No significant signal is observed, and an upper limit on the branching fraction of $1.3~(1.4)\\times 10^{-8}$ at $90 ~(95) \\%$ confidence level is set. This result supersedes the previous LHCb study and improves the upper limit by a factor of two. △ Less",
      "url": "https://arxiv.org/abs/2507.20945"
    },
    {
      "title": "Measurement of the $B^0\\rightarrow ρ(770)^{0}γ$ branching fraction",
      "abstract": "The ratio between the branching fractions of the $B^0\\rightarrow ρ(770)^{0}γ$ and $B^{0}\\rightarrow K^{*}(892)^{0}γ$ decays is measured with proton-proton collision data collected by the LHCb experiment at centre-of-mass energies of 7, 8, and 13 TeV, corresponding to an integrated luminosity of 9 fb${}^{-1}$. The measured value is \\begin{equation*} \\frac{{\\cal B}(B^0\\rightarrow ρ(770)^{0}γ)}{{\\cal B}(B^0\\rightarrow K^{*}(892)^{0}γ)}=0.0189\\pm 0.0007\\pm 0.0005, \\end{equation*} where the first uncertainty is statistical and the second systematic. The branching fraction for $B^0\\rightarrow ρ(770)^{0}γ$ decays is hence obtained as \\begin{equation*} {\\cal{B}}(B^0\\rightarrow ρ(770)^{0}γ) =(7.9\\pm 0.3\\pm 0.2\\pm 0.2) \\times 10^{-7}, \\end{equation*} where the last uncertainty is due to the branching fraction of the normalisation mode. This result assumes that both the $ρ(770)^0$ and $K^{*}(892)^0$ decays saturate the dihadron mass spectra considered in the analysis. It is consistent with the current world-average value and by far the most precise measurement to date. △ Less",
      "url": "https://arxiv.org/abs/2507.14401"
    },
    {
      "title": "Search for resonances decaying to photon pairs with masses between 4.9 and 19.4 GeV",
      "abstract": "A search is presented for axion-like particles (ALPs) with masses between 4.9 and 19.4 GeV decaying to a pair of photons, using proton-proton collisions collected with the LHCb detector during 2018 at a centre-of-mass energy of 13 TeV, corresponding to an integrated luminosity of 2.1 fb$^{-1}$. The same strategy and sample is used to search for the decays of the $B^0_s$, $B^0$ and $η_b$ mesons into photon pairs. No significant excess is found. Upper limits on the photon-pair branching fraction times the cross-section of ALP production are determined as a function of the ALP mass. Limits on the branching fractions of the beauty states are determined to be $\\mathcal{B}(B^0_s\\toγγ)<2.7\\times10^{-5}$, $\\mathcal{B}(B^0\\toγγ)<0.83\\times10^{-5}$, and $ σ(pp\\toη_b X)\\times\\mathcal{B}(η_b\\toγγ)<765\\,\\text{pb}$ at 95 % confidence level. △ Less",
      "url": "https://arxiv.org/abs/2507.14390"
    },
    {
      "title": "Improved measurement of $η/ η^{\\prime}$ mixing in $B^{0}_{(s)} \\rightarrow J/ψη^{(\\prime)}$ decays",
      "abstract": "Branching fraction ratios between the decays $B^{0}_{(s)} \\rightarrow J/ψη^{(\\prime)}$ are measured using proton-proton collision data collected by the LHCb experiment at centre-of-mass energies of $7$, $8$ and $13~\\textrm{TeV}$, corresponding to an integrated luminosity of $9~ \\textrm{fb}^{-1}$. The measured ratios of these branching fractions are $\\frac{BF(B^{0} \\rightarrow J/ψη^{\\prime})}{BF(B^{0} \\rightarrow J/ψη)} = 0.48 \\pm 0.06 \\pm 0.02 \\pm 0.01$ and $\\frac{BF(B^{0}_{s} \\rightarrow J/ψη^{\\prime})}{BF(B^{0}_{s} \\rightarrow J/ψη)} = 0.80 \\pm 0.02 \\pm 0.02 \\pm 0.01$, where the uncertainties are statistical, systematic and related to the precision of the $η^{(\\prime)}$ branching fractions, respectively. They are used to constrain the $η/η^{\\prime}$ mixing angle, $φ_{P}$, and to probe the presence of a possible glueball component in the $η^{\\prime}$ meson, described by the gluonic mixing angle $φ_{G}$. The obtained results are $φ_{P} = (41.6^{+1.0}_{-1.2})^\\circ$ and $φ_{G} = (28.1^{+3.9}_{-4.0})^\\circ$, where the uncertainties are statistically dominated. While the value of $φ_{P}$ is compatible with existing experimental determinations and theoretical calculations, the angle $φ_{G}$ differs from zero by more than four standard deviations, which points to a substantial glueball component in the $η^{\\prime}$ meson and/or unexpectedly large contributions from gluon-mediated processes in these decays. The absolute branching fractions are also measured relative to that of the well-established $B^{0}_{s} \\rightarrow J/ψφ$ decay, which serves as the normalisation channel. These results supersede the previous LHCb measurements and are the most precise to date. △ Less",
      "url": "https://arxiv.org/abs/2507.13914"
    },
    {
      "title": "Precision measurement of the ${\\itΞ}_b^0$ baryon lifetime",
      "abstract": "A sample of $pp$ collision data, corresponding to an integrated luminosity of 5.4 fb$^{-1}$ and collected by the LHCb experiment during LHC Run 2, is used to measure the ratio of the lifetime of the ${\\itΞ}_b^0$ baryon to that of the ${\\itΛ}_b^0$ baryon, $r_τ\\equivτ_{{\\itΞ}_b^0}/τ_{{\\itΛ}_b^0}$. The value ${r_τ^{\\rm Run\\,2}=1.004\\pm0.009\\pm0.006}$ is obtained, where the first uncertainty is statistical and the second systematic. This value is averaged with the corresponding value from Run 1 to obtain ${r_τ = 1.004\\pm0.008\\pm0.005}$. Multiplying by the known value of the ${\\itΛ}_b^0$ lifetime yields ${{τ_{{\\itΞ}_b^0}} = 1.475\\pm0.012\\pm0.008\\pm0.009~{\\rm ps}}$, where the last uncertainty is due to the limited knowledge of the ${\\itΛ}_b^0$ lifetime. This measurement improves the precision of the current world average of the ${\\itΞ}_b^0$ lifetime by about a factor of two, and is in good agreement with the most recent theoretical predictions. △ Less",
      "url": "https://arxiv.org/abs/2507.12402"
    },
    {
      "title": "Search for Accelerator-Produced Sub-GeV Dark Matter with the NOvA Near Detector",
      "abstract": "The NuMI facility at Fermilab produces a high-intensity beam of muon neutrinos and antineutrinos, designed to study neutrino oscillations. This beam may also be a source of dark matter particles produced through a light mediator. We search for dark matter particles with masses between 1 and 200 MeV that interact with Standard Model particles via a vector portal, producing forward-scattered single-electron events in the NOvA near detector. We set limits on the dark-visible coupling based on an exposure of 2.55x10^21 protons of 120 GeV energy on the NuMI target. For the dark matter mass range 10-20 MeV, this analysis sets the tightest constraints on the coupling to date. △ Less",
      "url": "https://arxiv.org/abs/2507.10754"
    },
    {
      "title": "First observation of the $\\mathitΛ_b^{0}\\!\\rightarrow\\mathitΛ_{c}^{+}D_{s}^{-}K^{+}K^{-}$ decay and search for pentaquarks in the $\\mathitΛ_{c}^{+}D_{s}^{-}$ system",
      "abstract": "The $\\mathitΛ_b^{0}\\!\\rightarrow\\mathitΛ_{c}^{+}D_{s}^{-}K^{+}K^{-}$ decay is observed for the first time using the data sample from proton-proton collisions recorded at a center-of-mass energy of $13\\,\\text{TeV}$ with the LHCb detector, corresponding to an integrated luminosity of $6\\,\\text{fb}^{-1}$. The ratio of branching fraction to that of $\\mathitΛ_b^{0} \\!\\rightarrow\\mathitΛ_{c}^{+}D_{s}^{-}$ decays is measured as $0.0141 \\pm 0.0019 \\pm 0.0012$, where the first uncertainty is statistical and the second systematic. A search for hidden-charm pentaquarks with strangeness is performed in the $\\mathitΛ_{c}^{+}D_{s}^{-}$ system. No evidence is found, and upper limits on the production ratio of $P_{c\\bar{c}s}(4338)^0$ and $P_{c\\bar{c}s}(4459)^0$ pentaquarks relative to the $\\mathitΛ_{c}^{+}D_{s}^{-}$ final state are set at the $95\\%$ confidence level as $0.12$ and $0.20$, respectively. △ Less",
      "url": "https://arxiv.org/abs/2507.10713"
    },
    {
      "title": "Extending Defeasibility for Propositional Standpoint Logics",
      "abstract": "In this paper, we introduce a new defeasible version of propositional standpoint logic by integrating Kraus et al.'s defeasible conditionals, Britz and Varzinczak's notions of defeasible necessity and distinct possibility, along with Leisegang et al.'s approach to defeasibility into the standpoint logics of Gómez Álvarez and Rudolph. The resulting logical framework allows for the expression of defeasibility on the level of implications, standpoint modal operators, and standpoint-sharpening statements. We provide a preferential semantics for this extended language and propose a tableaux calculus, which is shown to be sound and complete with respect to preferential entailment. We also establish the computational complexity of the tableaux procedure to be in PSpace. △ Less",
      "url": "https://arxiv.org/abs/2507.10133"
    },
    {
      "title": "Spatial and Temporal Evaluations of the Liquid Argon Purity in ProtoDUNE-SP",
      "abstract": "Liquid argon time projection chambers (LArTPCs) rely on highly pure argon to ensure that ionization electrons produced by charged particles reach readout arrays. ProtoDUNE Single-Phase (ProtoDUNE-SP) was an approximately 700-ton liquid argon detector intended to prototype the Deep Underground Neutrino Experiment (DUNE) Far Detector Horizontal Drift module. It contains two drift volumes bisected by the cathode plane assembly, which is biased to create an almost uniform electric field in both volumes. The DUNE Far Detector modules must have robust cryogenic systems capable of filtering argon and supplying the TPC with clean liquid. This paper will explore comparisons of the argon purity measured by the purity monitors with those measured using muons in the TPC from October 2018 to November 2018. A new method is introduced to measure the liquid argon purity in the TPC using muons crossing both drift volumes of ProtoDUNE-SP. For extended periods on the timescale of weeks, the drift electron lifetime was measured to be above 30 ms using both systems. A particular focus will be placed on the measured purity of argon as a function of position in the detector. △ Less",
      "url": "https://arxiv.org/abs/2507.08586"
    },
    {
      "title": "Gemini 2.5: Pushing the Frontier with Advanced Reasoning, Multimodality, Long Context, and Next Generation Agentic Capabilities",
      "abstract": "In this report, we introduce the Gemini 2.X model family: Gemini 2.5 Pro and Gemini 2.5 Flash, as well as our earlier Gemini 2.0 Flash and Flash-Lite models. Gemini 2.5 Pro is our most capable model yet, achieving SoTA performance on frontier coding and reasoning benchmarks. In addition to its incredible coding and reasoning skills, Gemini 2.5 Pro is a thinking model that excels at multimodal understanding and it is now able to process up to 3 hours of video content. Its unique combination of long context, multimodal and reasoning capabilities can be combined to unlock new agentic workflows. Gemini 2.5 Flash provides excellent reasoning abilities at a fraction of the compute and latency requirements and Gemini 2.0 Flash and Flash-Lite provide high performance at low latency and cost. Taken together, the Gemini 2.X model generation spans the full Pareto frontier of model capability vs cost, allowing users to explore the boundaries of what is possible with complex agentic problem solving. △ Less",
      "url": "https://arxiv.org/abs/2507.06261"
    },
    {
      "title": "Observation of orbitally excited $B_{c}^{+}$ states",
      "abstract": "The observation of a wide peaking structure in the $B_{c}^{+} γ$ mass spectrum is reported using proton-proton collision data collected by the LHCb detector at center-of-mass energies of $7$, $8$ and $13~\\text{TeV}$, corresponding to a total integrated luminosity of $9~\\text{fb}^{-1}$. The statistical significance over the background-only hypothesis exceeds seven standard deviations. The width of the observed structure is larger than the expectation from a single-peak hypothesis, and is well described by an effective minimal model consisting of two narrow peaks located at $6704.8 \\pm 5.5 \\pm 2.8 \\pm 0.3~\\mathrm{Me\\kern -0.1em V\\!/}c^2$ and $6752.4 \\pm 9.5 \\pm 3.1 \\pm 0.3~\\mathrm{Me\\kern -0.1em V\\!/}c^2$. The uncertainty terms are statistical, systematic, and associated to the knowledge of the $B_{c}^{+}$ mass, respectively. The measured peak locations are in line with theoretical predictions for lowest excited $P$-wave $B_{c}^{+}$ states, marking the first observation of orbitally excited beauty-charm mesons and providing important insights into the internal dynamics of hadrons containing two heavy quarks. △ Less",
      "url": "https://arxiv.org/abs/2507.02149"
    },
    {
      "title": "Study of $B_{c}(1P)^{+}$ states in the $B_{c}^{+} γ$ mass spectrum",
      "abstract": "The study of a wide peaking structure in the $B_{c}^{+} γ$ mass spectrum is reported using a data sample of proton-proton collisions collected by the LHCb detector at center-of-mass energies of $7$, $8$ and $13~\\text{TeV}$, corresponding to an integrated luminosity of $9~\\text{fb}^{-1}$. The observed structure is consistent with the lowest excited $P$-wave $B_{c}^{+}$ states and exhibits a statistical significance exceeding seven standard deviations relative to the background-only hypothesis. A two-peak model serves as an effective description of the data, with various theory-constrained models further explored to provide physical interpretation. Based on the predictions for the $B_{c}(1P)^{+}$ spectrum, the relative production cross-section of the overall $B_{c}(1P)^{+}$ states with respect to the $B_{c}^{+}$ ground state with the transverse momentum $p_{\\text{T}}$ and rapidity $y$ of $B_{c}^{+}$ mesons in the regions $p_{\\text{T}}<20~\\mathrm{Ge\\kern -0.1em V\\!/}c$ and $2.0<y<4.5$ at $\\sqrt{s}=13~\\text{TeV}$ is measured to be $0.20 \\pm 0.03 \\pm 0.02 \\pm 0.03$, where the uncertainty terms represent statistical, systematic, and uncertainties related to the choice of theoretical models, respectively. The results provide a test of theoretical models and deepen our understanding of quantum chromodynamics. △ Less",
      "url": "https://arxiv.org/abs/2507.02142"
    },
    {
      "title": "Photonics in Flatland: Challenges and Opportunities for Nanophotonics with 2D Semiconductors",
      "abstract": "Two-dimensional (2D) semiconductors are emerging as a versatile platform for nanophotonics, offering unprecedented tunability in optical properties through exciton resonance engineering, van der Waals heterostructuring, and external field control. These materials enable active optical modulation, single-photon emission, quantum photonics, and valleytronic functionalities, paving the way for next-generation optoelectronic and quantum photonic devices. However, key challenges remain in achieving large-area integration, maintaining excitonic coherence, and optimizing amplitude-phase modulation for efficient light manipulation. Advances in fabrication, strain engineering, and computational modelling will be crucial to overcoming these limitations. This perspective highlights recent progress in 2D semiconductor-based nanophotonics, emphasizing opportunities for scalable integration into photonics. △ Less",
      "url": "https://arxiv.org/abs/2507.00336"
    },
    {
      "title": "Demonstration of measurement-free universal fault-tolerant quantum computation",
      "abstract": "The ability to perform quantum error correction (QEC) and robust gate operations on encoded qubits opens the door to demonstrations of quantum algorithms. Contemporary QEC schemes typically require mid-circuit measurements with feed-forward control, which are challenging for qubit control, often slow, and susceptible to relatively high error rates. In this work, we propose and experimentally demonstrate a universal toolbox of fault-tolerant logical operations without mid-circuit measurements on a trapped-ion quantum processor. We present modular logical state teleportation between two four-qubit error-detecting codes without measurements during algorithm execution. Moreover, we realize a fault-tolerant universal gate set on an eight-qubit error-detecting code hosting three logical qubits, based on state injection, which can be executed by coherent gate operations only. We apply this toolbox to experimentally realize Grover's quantum search algorithm fault-tolerantly on three logical qubits encoded in eight physical qubits, with the implementation displaying clear identification of the desired solution states. Our work demonstrates the practical feasibility and provides first steps into the largely unexplored direction of measurement-free quantum computation. △ Less",
      "url": "https://arxiv.org/abs/2506.22600"
    },
    {
      "title": "Updated measurement of $CP$ violation and polarisation in $B^0_s \\rightarrow J/ψ\\overline{K}{}^{*}\\kern-1pt(892)^{0}$ decays",
      "abstract": "A time-integrated angular analysis of the decay $B^0_s \\rightarrow J/ψ\\overline{K}{}^{*}\\kern-1pt(892)^{0}$, with $J/ψ\\rightarrow μ^{+} μ^{-}$ and $\\overline{K}{}^{*}\\kern-1pt(892)^{0} \\rightarrow K^{-} π^{+}$, is presented. The analysis employs a sample of proton-proton collision data collected by the LHCb experiment during 2015-2018 at a centre-of-mass energy of $13 \\text{TeV}$, corresponding to an integrated luminosity of $6 \\text{fb}^{-1}$. A simultaneous maximum-likelihood fit is performed to the angular distributions in bins of the $K^{-} π^{+}$ mass. This fit yields measurements of the $CP$-averaged polarisation fractions and $CP$ asymmetries for the P-wave component of the $K^{-} π^{+}$ system. The longitudinal and parallel polarisation fractions are determined to be $f_{0} = 0.534 \\pm 0.012 \\pm 0.009$ and $f_{\\parallel} = 0.211 \\pm 0.014 \\pm 0.005$, respectively, where the first uncertainty is statistical and the second is systematic. The $CP$ asymmetries are measured with $3$-$7\\%$ precision and are found to be consistent with zero. These measurements, along with an updated determination of the branching fraction relative to the $B^0 \\rightarrow J/ψK^{*0}$ decay, are combined with previous LHCb results, providing the most precise values for these observables to date. △ Less",
      "url": "https://arxiv.org/abs/2506.22090"
    },
    {
      "title": "ECFA Higgs, electroweak, and top Factory Study",
      "abstract": "The ECFA Higgs, electroweak, and top Factory Study ran between 2021 and 2025 as a broad effort across the experimental and theoretical particle physics communities, bringing together participants from many different proposed future collider projects. Activities across three main working groups advanced the joint development of tools and analysis techniques, fostered new considerations of detector design and optimisation, and led to a new set of studies resulting in improved projected sensitivities across a wide physics programme. This report demonstrates the significant expansion in the state-of-the-art understanding of the physics potential of future e+e- Higgs, electroweak, and top factories, and has been submitted as input to the 2025 European Strategy for Particle Physics Update. △ Less",
      "url": "https://arxiv.org/abs/2506.15390"
    },
    {
      "title": "Search for the lepton-flavour-violating decays $B^0 \\to K^{*0} τ^\\pm e^\\mp$",
      "abstract": "A first search for the lepton-flavour-violating decays $B^0\\to K^{*0}τ^\\pm e^\\mp$ is presented. The analysis is performed using a sample of proton-proton collision data, collected with the LHCb detector at a centre-of-mass energy of 13 TeV between 2016 and 2018, corresponding to an integrated luminosity of 5.4 fb$^{-1}$. No significant signal is observed, and upper limits on the branching fractions are determined to be $\\cal{B}$$(B^0 \\to K^{*0}τ^-e^+)< 5.9$ $(7.1)\\times 10^{-6}$ and $\\cal{B}$$(B^0 \\to K^{*0}τ^+e^-)< 4.9$ $(5.9)\\times 10^{-6}$ at the 90\\% (95\\%) confidence level. △ Less",
      "url": "https://arxiv.org/abs/2506.15347"
    },
    {
      "title": "Measurement of the $Ω_c^0$ and $Ξ_c^0$ baryon lifetimes using hadronic $b$-baryon decays",
      "abstract": "The lifetimes of the $Ω_c^0$ and $Ξ_c^0$ baryons are measured using a $pp$ collision dataset collected by the LHCb experiment, corresponding to an integrated luminosity of $9~\\rm{fb^{-1}}$. The charm baryons are produced in the fully reconstructed decay chains $Ω_b^- \\rightarrow Ω_c^0 (\\rightarrow pK^-K^-π^+)~π^-$ and $Ξ_b^- \\rightarrow Ξ_c^0 (\\rightarrow pK^-K^-π^+)~π^-$. The measurement uses topologically and kinematically similar $B^- \\rightarrow D^0(\\rightarrow K^-K^+π^-π^+)~π^-$ decays for normalisation. The measured lifetimes are $τ_{Ω_c^0} = 276.3 \\pm 19.4~\\rm{(stat)} \\pm 1.8~\\rm{(syst)} \\pm 0.7~(τ_{D^0})~\\rm{fs}$, $τ_{Ξ_c^0} = 149.2 \\pm ~\\,2.5~\\rm{(stat)} \\pm 0.9~\\rm{(syst)} \\pm 0.4~(τ_{D^0})~\\rm{fs}$, where the first uncertainty is statistical, the second systematic and the third due to the uncertainty of the $D^0$ lifetime. These results are consistent with previous measurements performed by the LHCb experiment. △ Less",
      "url": "https://arxiv.org/abs/2506.13334"
    },
    {
      "title": "Building Automotive Security on Internet Standards: An Integration of DNSSEC, DANE, and DANCE to Authenticate and Authorize In-Car Services",
      "abstract": "The automotive industry is undergoing a software-as-a-service transformation that enables software-defined functions and post-sale updates via cloud and vehicle-to-everything communication. Connectivity in cars introduces significant security challenges, as remote attacks on vehicles have become increasingly prevalent. Current automotive designs call for security solutions that address the entire lifetime of a vehicle. In this paper, we propose to authenticate and authorize in-vehicle services by integrating DNSSEC, DANE, and DANCE with automotive middleware. Our approach decouples the cryptographic authentication of the service from that of the service deployment with the help of DNSSEC and thereby largely simplifies key management. We propose to authenticate in-vehicle services by certificates that are solely generated by the service suppliers but published on deployment via DNSSEC TLSA records solely signed by the OEM. Building on well-established Internet standards ensures interoperability with various current and future protocols, scalable management of credentials for millions of connected vehicles at well-established security levels. We back our design proposal by a security analysis using the STRIDE threat model and by evaluations in a realistic in-vehicle setup that demonstrate its effectiveness. △ Less",
      "url": "https://arxiv.org/abs/2506.13261"
    },
    {
      "title": "Unsupervised risk factor identification across cancer types and data modalities via explainable artificial intelligence",
      "abstract": "Risk stratification is a key tool in clinical decision-making, yet current approaches often fail to translate sophisticated survival analysis into actionable clinical criteria. We present a novel method for unsupervised machine learning that directly optimizes for survival heterogeneity across patient clusters through a differentiable adaptation of the multivariate logrank statistic. Unlike most existing methods that rely on proxy metrics, our approach represents novel methodology for training any neural network architecture on any data modality to identify prognostically distinct patient groups. We thoroughly evaluate the method in simulation experiments and demonstrate its utility in practice by applying it to two distinct cancer types: analyzing laboratory parameters from multiple myeloma patients and computed tomography images from non-small cell lung cancer patients, identifying prognostically distinct patient subgroups with significantly different survival outcomes in both cases. Post-hoc explainability analyses uncover clinically meaningful features determining the group assignments which align well with established risk factors and thus lend strong weight to the methods utility. This pan-cancer, model-agnostic approach represents a valuable advancement in clinical risk stratification, enabling the discovery of novel prognostic signatures across diverse data types while providing interpretable results that promise to complement treatment personalization and clinical decision-making in oncology and beyond. △ Less",
      "url": "https://arxiv.org/abs/2506.12944"
    },
    {
      "title": "The Karl G. Jansky Very Large Array Local Group L-band Survey (LGLBS)",
      "abstract": "We present the Local Group L-Band Survey (LGLBS), a Karl G. Jansky Very Large Array (VLA) survey producing the highest quality 21-cm and 1-2 GHz radio continuum images to date for the six VLA-accessible, star-forming, Local Group galaxies. Leveraging the VLA's spectral multiplexing power, we simultaneously survey the 21-cm line at high 0.4 km/s velocity resolution, the 1-2 GHz polarized continuum, and four OH lines. For the massive spiral M31, the dwarf spiral M33, and the dwarf irregular galaxies NGC6822, IC10, IC1613, and the Wolf-Lundmark-Melotte Galaxy (WLM), we use all four VLA configurations and the Green Bank Telescope to reach angular resolutions of $< 5''$ ($10{-}20$~pc) for the 21-cm line with $<10^{20}$~cm$^{-2}$ column density sensitivity, and even sharper views ($< 2''$; $5{-}10$~pc) of the continuum. Targeting these nearby galaxies ($D\\lesssim1$ Mpc) reveals a sharp, resolved view of the atomic gas, including 21-cm absorption, and continuum emission from supernova remnants and HII regions. These datasets can be used to test theories of the abundance and formation of cold clouds, the driving and dissipation of interstellar turbulence, and the impact of feedback from massive stars and supernovae. Here, we describe the survey design and execution, scientific motivation, data processing, and quality assurance. We provide a first look at and publicly release the wide-field 21-cm HI data products for M31, M33, and four dwarf irregular targets in the survey, which represent some of the highest physical resolution 21-cm observations of any external galaxies beyond the LMC and SMC. △ Less",
      "url": "https://arxiv.org/abs/2506.11792"
    },
    {
      "title": "Measurement of $ψ(2S)$ to $J/ψ$ cross-section ratio as function of multiplicity in $p$Pb collisions at$\\sqrt{s_{NN}} = 8.16$ TeV",
      "abstract": "The production ratio of $ψ(2S)$ to $J/ψ$ charmonium states is presented as a function of multiplicity in proton-lead collisions at a centre-of-mass energy of $\\sqrt{s_{NN}}=8.16$ TeV, for both prompt and nonprompt sources. The total luminosity recorded by the LHCb experiment corresponds to 13.6 $pb^{-1}$ for $p$Pb collisions and 20.8 $pb^{-1}$ for Pb$p$ collisions, where the first particle indicates the forward direction of the detector. Measurements are performed in the dimuon final state at forward (backward) centre-of-mass rapidity $1.5<y^*<4.0$ ($-5.0<y^*<-2.5$) for $p$Pb (Pb$p$) collisions.A multiplicity dependence of the prompt production ratio is observed in $p$Pb collisions, whereas no dependence is found in nonprompt production, nor in either prompt or nonprompt production in Pb$p$ collisions. These results suggest that in the Pb-going direction additional suppression mechanisms beyond comover effects may be present, possibly related to the formation of quark-gluon plasma. This highlights a transition from small to large collision systems and provides important insight into the suppression of charmonia in proton-nucleus collisions. △ Less",
      "url": "https://arxiv.org/abs/2506.08624"
    },
    {
      "title": "Coherent photoproduction of $ρ^0, ω$ and excited vector mesons in ultraperipheral PbPb collisions",
      "abstract": "The invariant-mass distribution for the coherent photoproduction of dipions in ultraperipheral PbPb collisions is measured using data, corresponding to an integrated luminosity of $ 224.6 \\pm 9.6\\ μ$b$^{-1}$, collected by the LHCb experiment in 2018 at a nucleon-nucleon centre-of-mass energy $\\sqrt{s_{\\rm NN}}=5.02$ TeV. The dominant contribution is due to the $ρ^0$ meson but a consistent description across the full invariant-mass range requires accounting for the $ω$ meson and introducing two resonances at masses of $1350\\pm20$ MeV and $1790\\pm20$ MeV with widths of about 300 MeV. The cross-section for each meson is measured differentially in twelve bins of rapidity from 2.05 to 4.90. Significant nuclear suppression is observed for the $ρ^0$ meson compared to expectations based on photoproduction on the proton. △ Less",
      "url": "https://arxiv.org/abs/2506.06250"
    },
    {
      "title": "Axiomatics of Restricted Choices by Linear Orders of Sets with Minimum as Fallback",
      "abstract": "We study how linear orders can be employed to realise choice functions for which the set of potential choices is restricted, i.e., the possible choice is not possible among the full powerset of all alternatives. In such restricted settings, constructing a choice function via a relation on the alternatives is not always possible. However, we show that one can always construct a choice function via a linear order on sets of alternatives, even when a fallback value is encoded as the minimal element in the linear order. The axiomatics of such choice functions are presented for the general case and the case of union-closed input restrictions. Restricted choice structures have applications in knowledge representation and reasoning, and here we discuss their applications for theory change and abstract argumentation. △ Less",
      "url": "https://arxiv.org/abs/2506.03315"
    },
    {
      "title": "Three-pion Bose-Einstein correlations measured in proton-proton collisions",
      "abstract": "A study on the Bose-Einstein correlations for triplets of same-sign pions is presented. The analysis is performed using proton-proton collisions at a centre-of-mass energy of $\\sqrt{s}$ = 7 TeV, recorded by the LHCb experiment, corresponding to an integrated luminosity of 1.0 fb$^{-1}$. For the first time, the results are interpreted in the core-halo model. The parameters of the model are determined in regions of charged-particle multiplicity. This measurement provides insight into the nature of hadronisation in terms of coherence, showing a coherent emission of pions. △ Less",
      "url": "https://arxiv.org/abs/2506.03072"
    },
    {
      "title": "Line shapes in time- and angle-resolved photoemission spectroscopy explored by machine learning",
      "abstract": "Time- and angle-resolved photoemission spectroscopy is a powerful technique for investigating the dynamics of excited carriers in quantum materials. Typically, data analysis proceeds via the inspection of time distribution curves (TDCs), which represent the time-dependent photoemission intensity in a region of interest -- often chosen somewhat arbitrarily -- in energy-momentum space. Here, we employ $k$-means, an unsupervised machine learning technique, to systematically investigate trends in TDC line shape for quasi-free-standing monolayer graphene and for a simple analytical model. Our analysis reveals how finite energy and time resolution can affect the TDC line shape. We discuss how this can be taken into account in a quantitative analysis, and under what conditions the time-dependent photoemission intensity after laser excitation can be approximated by a simple exponential decay. △ Less",
      "url": "https://arxiv.org/abs/2506.02137"
    },
    {
      "title": "Measurement of the Lund plane for light- and beauty-quark jets",
      "abstract": "The substructure of jets in quantum chromodynamics (QCD) has garnered significant attention with the advent of infrared- and collinear-safe clustering algorithms and observables. A key question emerging from these studies is how in-jet emissions at soft and hard energy scales, across collinear and wide angles relative to the emitter, differ with the mass of the emitting parton. The Lund jet plane (LJP) is a perturbatively well-defined substructure observable that maps the radiation pattern of jets onto a plane, visually distinguishing emissions with different kinematic properties. Comparing LJP for jets containing hadrons of low versus high mass enables the testing of QCD splitting functions from first-principles calculations across both soft and hard regimes and at different radiation angles. This article presents the first measurement of the LJP for light-quark-enriched and beauty-initiated jets at center-of-mass energy of 13\\tev at LHCb. This marks the first direct observation of the dead-cone effect in beauty-quark jets, measured in the collinear region of the LJP. △ Less",
      "url": "https://arxiv.org/abs/2505.23530"
    },
    {
      "title": "Technical recommendation on multiplex MR elastography for tomographic mapping of abdominal stiffness with a focus on the pancreas and pancreatic ductal adenocarcinoma",
      "abstract": "Objectives: MR elastography (MRE) offers valuable mechanical tissue characterization, however, in deep abdominal organs like the pancreas conventional single-driver, single-frequency approaches often fail. This study evaluates whether multiplex MRE using multiple drivers and vibration frequencies can overcome these limitations. Methods: This study used single-shot spin-echo MRE in 18 healthy volunteers targeting the liver, pancreas, kidneys, and spleen. Each healthy volunteer underwent 16 MRE examinations with different sets of four vibration frequencies (30-60 Hz) and four driver combinations, and an additional null experiment without vibrations. Further, a cohort of 14 patients with pancreatic ductal adenocarcinoma (PDAC) were retrospectively assessed. The quality of shear-wave fields and stiffness maps was assessed by displacement amplitudes and image sharpness. Results: In healthy volunteers, abdominal coverage with displacement amplitudes above the pre-determined noise level of 4 μm varied between MRE configurations: 24.2% ([0.0%-56.2%], single-driver, 60 Hz), 66.9% ([24.8%-97.7%], single-driver, 30-60 Hz), 70.2% ([0.0%-92.5%], multi-driver, 60 Hz) and 99.9% ([89.4%-100%], multi-driver, 30-60 Hz). In the pancreas, >60% coverage was achieved in all subjects using four drivers and multiple frequencies. This was achieved in only 2/18 subjects using single-driver/single-frequency MRE. Patients with PDAC had 99.1% [91.4%-100%] coverage in the pancreas and 96.3% [63.1%-100%] abdominal coverage (multi-driver, 30-60 Hz). Conclusion: MRE with four drivers and multiple vibration frequencies between 30-60 Hz enables tomographic mapping of tissue stiffness across the entire abdomen, including the pancreas. Multiplex MRE offers a promising approach for generating detailed images of abdominal stiffness, potentially enhancing clinical diagnostics for abdominal and pancreatic diseases. △ Less",
      "url": "https://arxiv.org/abs/2505.20093"
    },
    {
      "title": "Measurement of the Z-boson mass",
      "abstract": "The first dedicated $Z$-boson mass measurement at the LHC with $Z \\to μ^+μ^-$ decays is reported. The dataset uses proton-proton collisions at a centre-of-mass energy of $13$ TeV, recorded in 2016 by the LHCb experiment, and corresponds to an integrated luminosity of $1.7$ fb$^{-1}$. A template fit to the $μ^+μ^-$ mass distribution yields the following result for the $Z$-boson mass, \\begin{equation*} m_{Z} = 91184.2 \\pm 8.5 \\pm 3.8 \\rm{MeV}, \\end{equation*} where the first uncertainty is statistical and the second systematic. This result is consistent with previous measurements and predictions from global electroweak fits. △ Less",
      "url": "https://arxiv.org/abs/2505.15582"
    },
    {
      "title": "Measurements of charmed meson and antimeson production asymmetries at $\\sqrt{s} =13.6$ TeV",
      "abstract": "This article presents doubly differential measurements of the asymmetries in production rates between mesons containing a charm quark and those containing an anticharm quark in proton-proton collisions at a centre-of-mass energy of $\\sqrt{s}=13.6$ TeV using data recorded by the LHCb experiment. The asymmetries of $D^0$, $D^+$ and $D_s^+$ mesons are measured for two-dimensional intervals in transverse momentum and pseudorapidity, within the range $2.5<p_T<25.0$ GeV$/c$ and $2.0<η<4.5$. No significant production asymmetries are observed. Comparisons to the Pythia 8 and Herwig 7 event generators are also presented, and their agreement with the data is evaluated. These measurements constitute the first measurements of production asymmetries at this centre-of-mass energy of colliding beams, and the first measurements with the LHCb Run 3 detector. △ Less",
      "url": "https://arxiv.org/abs/2505.14494"
    },
    {
      "title": "First measurement of $b$-jet mass with and without grooming",
      "abstract": "The LHCb collaboration presents a novel suite of heavy-flavour jet substructure measurements at forward rapidity in proton-proton collisions at a centre-of-mass energy of $\\sqrt{s} = 13$ TeV. The jet mass is a perturbatively calculable probe of the virtuality of hard-scattered quarks and gluons, connecting small-distance quantum chromodynamics (QCD) with long-distance experimental measurement. It becomes dominated by nonperturbative corrections at small values, presenting an excellent test of QCD across a broad range of energies. Measuring heavy-flavour jet mass with a theoretically unambiguous flavour definition for the first time probes the gluon splitting mechanism for heavy-flavour production and pushes tests of perturbative QCD to unprecedented theoretical precision. Utilising the soft drop jet-grooming technique to access the perturbative jet core further enhances constraints on first-principles theory. Measurements of the jet mass for jets containing fully reconstructed $B^\\pm$ hadrons are reported with and without grooming. These results offer unparalleled tests of quark flavour and mass dependence in QCD and provide a baseline for future studies of heavy-flavour jet quenching in heavy-ion collisions. △ Less",
      "url": "https://arxiv.org/abs/2505.11955"
    },
    {
      "title": "Rapidity and multiplicity dependence of charged-particle flow in $p$Pb collisions at $\\sqrt{s_{NN}} = 8.16$ TeV",
      "abstract": "The elliptic and triangular flow of charged particles are measured using two-particle angular correlations in $p$Pb collisions in the pseudorapidity range \\cal{2.0 $< |η| <$ 4.8}. The data sample was collected by the LHCb experiment in 2016 at a centre-of-mass energy per nucleon pair of $\\sqrt{s_{NN}} = 8.16$ TeV, containing in total approximately 1.5 billion collision events. Non-flow contributions are obtained in low-multiplicity collisions and subtracted to extract the flow harmonics. The results are presented as a function of event multiplicity and hadron transverse momentum. Comparisons with a full (3+1)D dynamic model indicate that it overestimates the measured elliptic flow. A comparison between the forward and backward regions reveals no significant differences in flow parameters, suggesting that final-state effects may dominate over initial-state effects in the origin of flow in small systems. △ Less",
      "url": "https://arxiv.org/abs/2505.09273"
    },
    {
      "title": "Measurement of the branching fraction ratio $R_K$ at large dilepton invariant mass",
      "abstract": "A test of lepton universality between muons and electrons is performed using $B^+\\to K^+\\ell^+\\ell^-$ decays (where $\\ell$ = $e$, $μ$), in the dilepton invariant-mass-squared region above 14.3 GeV$^2/c^4$. The data used for the measurement consists of beauty meson decays produced in proton-proton collisions, corresponding to an integrated luminosity of 9 $\\text{fb}^{-1}$, collected by the LHCb experiment between 2011 and 2018. The ratio of branching fractions for $B^+\\to K^+μ^+μ^-$ and $B^+\\to K^+e^+e^-$ decays is measured to be $R_K = 1.08^{+0.11}_{-0.09}\\;(\\text{stat})\\;^{+0.04}_{-0.04}\\;(\\text{syst})$, which is consistent with the Standard Model prediction of unity. This constitutes the most precise test of lepton flavour universality using $B^+\\to K^+\\ell^+\\ell^-$ decays with dilepton invariant-mass-squared above the $ψ(2S)$ mass, whilst being the first of its kind at a hadron collider. △ Less",
      "url": "https://arxiv.org/abs/2505.03483"
    },
    {
      "title": "Roadmap on Advancements of the FHI-aims Software Package",
      "abstract": "Electronic-structure theory is the foundation of the description of materials including multiscale modeling of their properties and functions. Obviously, without sufficient accuracy at the base, reliable predictions are unlikely at any level that follows. The software package FHI-aims has proven to be a game changer for accurate free-energy calculations because of its scalability, numerical precision, and its efficient handling of density functional theory (DFT) with hybrid functionals and van der Waals interactions. It treats molecules, clusters, and extended systems (solids and liquids) on an equal footing. Besides DFT, FHI-aims also includes quantum-chemistry methods, descriptions for excited states and vibrations, and calculations of various types of transport. Recent advancements address the integration of FHI-aims into an increasing number of workflows and various artificial intelligence (AI) methods. This Roadmap describes the state-of-the-art of FHI-aims and advancements that are currently ongoing or planned. △ Less",
      "url": "https://arxiv.org/abs/2505.00125"
    },
    {
      "title": "Observation of the decay $B^0_{s}\\to K^0 p \\bar{p}$ and measurement of the $B^0_{(s)} \\to K^0 p \\bar{p}$ branching fractions",
      "abstract": "A study of the charmless baryonic decays $B^0_{(s)} \\to K^0 p \\bar{p}$ is presented, where $B^0_{(s)}$ denotes either a $B^0$ or a $B^0_s$ meson. The analysis is based on proton-proton collision data collected by the LHCb experiment at centre-of-mass energies of 7, 8, and $13~\\mathrm{Tev}$, corresponding to an integrated luminosity of $9~\\mathrm{fb}^{-1}$. The decay $B^0_s \\to K^0 p \\bar{p}$ is observed for the first time, with a measured branching fraction of $(9.14 \\pm 1.69 \\pm 0.90 \\pm 0.33 \\pm 0.20) \\times 10^{-7}$ and a significance of $5.6σ$. The uncertainties respectively account for statistical and systematic contributions, the precision of the branching fraction of the normalisation channel $B^0 \\to K^0 π^{+} π^{-}$ and the fragmentation fraction ratio ${f_s}/{f_d}$. The branching fraction determined for $B^0 \\to K^0 p \\bar{p}$ is $(2.82 \\pm 0.08 \\pm 0.12 \\pm 0.10) \\times 10^{-6}$, which is the most precise measurement to date. △ Less",
      "url": "https://arxiv.org/abs/2504.21269"
    },
    {
      "title": "Rational Inference in Formal Concept Analysis",
      "abstract": "Defeasible conditionals are a form of non-monotonic inference which enable the expression of statements like \"if $φ$ then normally $ψ$\". The KLM framework defines a semantics for the propositional case of defeasible conditionals by construction of a preference ordering over possible worlds. The pattern of reasoning induced by these semantics is characterised by consequence relations satisfying certain desirable properties of non-monotonic reasoning. In FCA, implications are used to describe dependencies between attributes. However, these implications are unsuitable to reason with erroneous data or data prone to exceptions. Until recently, the topic of non-monotonic inference in FCA has remained largely uninvestigated. In this paper, we provide a construction of the KLM framework for defeasible reasoning in FCA and show that this construction remains faithful to the principle of non-monotonic inference described in the original framework. We present an additional argument that, while remaining consistent with the original ideas around non-monotonic reasoning, the defeasible reasoning we propose in FCA offers a more contextual view on inference, providing the ability for more relevant conclusions to be drawn when compared to the propositional case. △ Less",
      "url": "https://arxiv.org/abs/2504.16938"
    },
    {
      "title": "Association-Based Track-Before-Detect with Object Contribution Probabilities",
      "abstract": "Multiobject tracking provides situational awareness that enables new applications for modern convenience, applied ocean sciences, public safety, and homeland security. In many multiobject tracking applications, including radar and sonar tracking, after coherent prefiltering of the received signal, measurement data is typically structured in cells, where each cell represent, e.g., a different range and bearing value. While conventional detect-then-track (DTT) multiobject tracking approaches convert the cell-structured data within a detection phase into so-called point measurements in order to reduce the amount of data, track-before-detect (TBD) methods process the cell-structured data directly, avoiding a potential information loss. However, many TBD tracking methods are computationally intensive and achieve a reduced tracking accuracy when objects interact, i.e., when they come into close proximity. We here counteract these difficulties by introducing the concept of probabilistic object-to-cell contributions. As many conventional DTT methods, our approach uses a probabilistic association of objects with data cells, and a new object contribution model with corresponding object contribution probabilities to further associate cell contributions to objects that occupy the same data cell. Furthermore, to keep the computational complexity and filter runtimes low, we here use an efficient Poisson multi-Bernoulli filtering approach in combination with the application of belief propagation for fast probabilistic data association. We demonstrate numerically that our method achieves significantly increased tracking performance compared to state-of-the-art TBD tracking approaches, where performance differences are particularly pronounced when multiple objects interact. △ Less",
      "url": "https://arxiv.org/abs/2504.16814"
    },
    {
      "title": "Probing the Outskirts of M Dwarf Planetary Systems with a Cycle 1 JWST NIRCam Coronagraphy Survey",
      "abstract": "The population of giant planets on wide orbits around low-mass M dwarf stars is poorly understood, but the unprecedented sensitivity of JWST NIRCam coronagraphic imaging now provides direct access to planets significantly less massive than Jupiter beyond 10 AU around the closest, youngest M dwarfs. We present the design, observations, and results of JWST GTO Program 1184, a Cycle 1 NIRCam coronagraphic imaging survey of 9 very nearby and young low-mass stars at 3-5 micron wavelengths. In the F356W and F444W filters, we achieve survey median 5-sigma contrasts deeper than 10-5 at a separation of 1\", corresponding to 0.20 MJup in F444W and 1.30 MJup in F356W at planet-star separations of 10 AU. Our results include 3-5 micron debris disk detections and the identification of many extended and point-like sources in the final post-processed images. In particular, we have identified two marginal point source candidates having fluxes and color limits consistent with model predictions for young sub-Jupiter mass exoplanets. Under the assumption that neither candidate is confirmed, we place the first direct-imaging occurrence constraints on M dwarf wide-orbit (semimajor axes 10-100 AU), sub-Jupiter mass exoplanets (0.3-1 MJup). We find frequency limits of < 0.10 and < 0.16 objects per star with 1 and 3-sigma confidence, respectively. This survey brings to the forefront the unprecedented capabilities of JWST NIRCam coronagraphic imaging when targeting young, low-mass stars and acts as a precursor to broader surveys to place deep statistical constraints on wide-orbit, sub-Jupiter mass planets around M dwarfs. △ Less",
      "url": "https://arxiv.org/abs/2504.11659"
    }
  ]
}